{
    "id": "caramel-rose-apple-pie",
    "link": "https://tasty.co/recipe/caramel-rose-apple-pie",
    "name": "Caramel Rose Apple Pie Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/b0cdbb71268c4cba85139c77fde99d49/final.jpg",
    "description": "Here's what you need: apple, lemon, granulated sugar, brown sugar, cinnamon, nutmeg, prepared pie dough, heavy cream",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "4 apples",
        "n/a",
        "½ cup sugar",
        "½ cup brown sugar",
        "¼ teaspoon cinnamon",
        "¼ teaspoon nutmeg",
        "1 pie dough",
        "¼ cup heavy cream"
    ],
    "recipeInstructionSteps": [
        "Peel the apples and place them in a large bowl with enough water to cover. Squeeze lemon juice in the water to prevent the apples from browning. Working with 1 apple at a time, cut around the core, discarding the core and removing the &quot;cheeks.&quot; Slice the cheeks very thin.",
        "In a large bowl, combine the granulated sugar, brown sugar, cinnamon and nutmeg. Stir to combine. Add the sliced apples, stir to coat, and let sit for 30 minutes.",
        "Line a pie dough in a 9-inch (23-cm) cast-iron pan, and prick the dough with a fork all around. Chill in the fridge until very firm, 20-30 minutes.",
        "Working in batches, remove the apples from the cinnamon-sugar mixture by taking a handful at a time and carefully squeezing them with your hands to remove the excess moisture. Place the drained apples in a separate large bowl, reserving the liquid to make the caramel sauce.",
        "Preheat the oven to 375˚F (190˚C).",
        "Working from the outside in, line the apple slices on the pie dough by overlapping each slice to create a rose shape. Roll up 1 apple slice tightly and place it in the center, creating a bud shape. Cover the pan with foil and bake for 30 minutes. Uncover and bake for 10 minutes more, or until golden brown. Remove from the oven and let cool for 10 minutes.",
        "In a saucepan, bring the reserved cinnamon-sugar liquid to a boil. Once the liquid is reduced by half, 10-15 minutes, add the heavy cream and stir well.",
        "To serve, pour the caramel sauce over the apple pie.",
        "Enjoy!"
    ]
}