{
    "id": "copycat-baked-apple-pie-pockets-to-go",
    "link": "https://tasty.co/recipe/copycat-baked-apple-pie-pockets-to-go",
    "name": "Copycat Baked Apple Pie Pockets To Go Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/0303f85aaed1436f9a258aa30cac9760/fb_thumb.jpg",
    "description": "Here's what you need: apple, baking powder, butter, brown sugar, cinnamon, nutmeg, salt, puff pastry, egg, parchment paper",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "4-5 apples",
        "1 teaspoon baking soda",
        "3 tablespoon butter",
        "2 tablespoon brown sugar",
        "1 teaspoon cinnamon",
        "½ teaspoon nutmeg",
        "Salt, to taste",
        "1 sheet puff pastry",
        "1 egg (for egg wash)",
        "Parchment paper"
    ],
    "recipeInstructionSteps": [
        "Peel and dice apples.",
        "Stir water and baking powder together in a small bowl.",
        "Combine the baking powder-water mixture, butter, brown sugar, cinnamon, nutmeg, and salt in a medium-size skillet over medium-high heat. Whisk together until combined and mixture has become thick and bubbly.",
        "Add apples and stir until they are fully coated and tender.",
        "Lay pastry out and flatten with rolling pin so that it is about ¼-inch (6cm) thick throughout.",
        "Preheat oven to 375°F (190°C).",
        "Slice pastry into 12 rectangles.",
        "Spoon apple mixture onto top 6 rectangles.",
        "Dip your finger in water and line the outer rim of each rectangle before sandwiching apple filling between two rectangles. Using a fork, press the sides around each rectangle to seal the filling in.",
        "Whisk an egg and brush it over the top of each pie then place them on a greased baking sheet.",
        "Using a knife, make 3 or 4 slits in each pie.",
        "Bake for 20-25 minutes or until golden brown.",
        "Fold a rectangle of parchment paper in half horizontally",
        "Take the bottom corners and fold up ¾ of the way and then ⅔ of the way.",
        "Flip the rectangle over and fold the left third into the center, taking the right third and folding it into the “wing” created by the middle fold.",
        "Flip this pocket over and use to hold and travel with an apple pie.",
        "Enjoy!"
    ]
}