{
    "id": "chocolate-stuffed-churro-donuts",
    "link": "https://tasty.co/recipe/chocolate-stuffed-churro-donuts",
    "name": "Chocolate-Stuffed Churro Donuts Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/525a66a5010046448d68c4d69d344b8c/Thumb_B.jpg",
    "description": "Here's what you need: butter, brown sugar, salt, water, flour, vanilla extract, egg, chocolate chips, oil, cinnamon sugar, piping bag, nonstick baking sheet",
    "recipeCategory": "Desserts",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "¼ cup butter, cubed",
        "2 tablespoons brown sugar",
        "½ teaspoon salt",
        "1 cup water",
        "1 cup flour",
        "1 teaspoon vanilla",
        "3-4 eggs",
        "½ cup chocolate chips",
        "Oil for frying",
        "Cinnamon sugar",
        "Piping bag with a large star tip",
        "Nonstick baking sheet"
    ],
    "recipeInstructionSteps": [
        "In a saucepan over medium-high heat, add butter, brown sugar, salt, and water, and bring to a boil.",
        "As soon as the butter has fully melted and the mixture begins to boil, reduce the heat to medium-low and add in flour.",
        "Using a wooden spoon, stir until the dough comes together to form a ball and there are no lumps.",
        "Remove from heat and let cool for 5 minutes before proceeding to the next step (to prevent accidentally cooking the eggs).",
        "Mix in the vanilla extract and add in the eggs, one at a time, being sure to fully incorporate each egg before adding the next.",
        "Once all the eggs are incorporated, transfer it to a piping bag with a large star tip.",
        "On a nonstick baking sheet, pipe the dough in circles leaving a hole in the center.",
        "Place the chocolate chips in a ring and top with remaining dough, making sure there are no gaps in between each layer.",
        "Transfer the tray to the freezer and freeze until solid, about 3 hours or overnight.",
        "Heat oil in a deep pot to 350˚F (175˚C).",
        "Remove the baking tray from the freezer and use a butter knife to release the churro donuts. Return any extras to the freezer while you wait to fry.",
        "Fry the donuts in batches to avoid overcrowding the pan, until brown and the dough is cooked through.",
        "Drain on a paper towel before rolling in cinnamon sugar.",
        "Enjoy!"
    ]
}