{
    "id": "cinnamon-sugar-donut-cones",
    "link": "https://tasty.co/recipe/cinnamon-sugar-donut-cones",
    "name": "Cinnamon Sugar Donut Cones Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/e1afaf5c20454dd1b7de62eab69f24cf/facebook.jpg",
    "description": "Here's what you need: warm water, granulated sugar, active dry yeast, all-purpose flour, salt, warm milk, unsalted butter, large egg yolk, olive oil, large egg, granulated sugar, ground cinnamon, chocolate, rainbow sprinkles, ice cream",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "",
    "recipeIngredient": [
        "½ cup warm water",
        "2 tablespoons plus 1 teaspoon granulated sugar, divided",
        "¼ ounces active dry yeast",
        "3 cups all-purpose flour, plus more as needed",
        "Pinch of salt",
        "½ cup warm milk of your choice",
        "5 tablespoons unsalted butter, melted, divided",
        "2 large egg yolks, room temperature",
        "1 tablespoon olive oil",
        "1 large egg, beaten",
        "1 cup granulated sugar",
        "2 teaspoons ground cinnamon",
        "1 cup chocolate, melted",
        "Rainbow sprinkles",
        "Ice cream"
    ],
    "recipeInstructionSteps": [
        "In a large bowl, stir together the water and 1 teaspoon sugar. Sprinkle the yeast over the water mixture and rest for 5 minutes, or until it becomes foamy.",
        "Sift together the flour, 2 tablespoons sugar, and the salt over the yeast mixture.",
        "Add the milk, 3 tablespoons melted butter, and the egg yolks. Stir until the dough comes together in a ball. Add more flour if dough is too sticky.",
        "Knead the dough for five minutes, or until the dough is smooth on the outside and springs back when pressed on with your fingers.",
        "Grease bowl with the oil, return the dough to the bowl, and cover with plastic wrap.",
        "Let rise for one hour at room temperature, or until the dough has doubled in size.",
        "Preheat the oven to 375°F (190°C).",
        "Cut the dough into eight equal parts.",
        "Roll out each piece of dough into a long, thick strip.",
        "Fold a sheet of aluminum foil in half and, starting from the bottom right hand corner, roll into a cone shape, measuring 6 inches (15 cm) long and about ⅛-inch (3 mm) thick around the opening. Repeat to make 7 more cones.",
        "Wrap the dough strips around each aluminum cone.",
        "Arrange the cones point-up in a muffin tin. Brush with egg wash.",
        "Bake for 18-20 minutes, or until golden brown.",
        "Cool for 10 minutes.",
        "On a large plate, mix the cinnamon with the remaining sugar.",
        "Brush the cones with the remaining melted butter.",
        "Carefully remove the aluminum foil.",
        "Roll the cone in cinnamon sugar.",
        "Fill the cone with melted chocolate, letting the excess drip out. Top with ice cream, or dip the edge in chocolate, then roll in rainbow sprinkles, if desired. Top with ice cream.",
        "Enjoy!"
    ]
}