{
    "id": "cookies-and-cream-stuffed-doughnuts",
    "link": "https://tasty.co/recipe/cookies-and-cream-stuffed-doughnuts",
    "name": "Cookies And Cream–stuffed Doughnuts Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/4402e6cba5394f27b7043b0406e64dbe/Doughnut-Compilation-FB-Final-Final.jpg",
    "description": "Here's what you need: chocolate cookie, cream cheese, chocolate, plain flour, caster sugar, baking powder, salt, milk, butter, sunflower oil, sunflower oil, white  chocolate",
    "recipeCategory": "Snacks",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "10 chocolate cookies",
        "90 grams cream cheese",
        "12 pieces of chocolate",
        "250 grams plain flour",
        "50 grams caster sugar",
        "1 ½ teaspoons baking powder",
        "½ teaspoon salt",
        "120 milliliters milk",
        "50 milliliters melted butter",
        "2 tablespoons sunflower oil",
        "1 liter sunflower oil (for frying)",
        "50 grams melted white chocolate"
    ],
    "recipeInstructionSteps": [
        "Pour the cookies into a ziplock bag, fasten, and bash into crumbs using a rolling pin.",
        "Pour half of the cookie crumbs into a bowl and mix with the cream cheese. Set aside.",
        "Prepare the doughnut mixture by combining the flour, sugar, baking powder, and salt in a bowl. Make a well in the middle of the dry ingredients.",
        "Add the milk, melted butter, and sunflower oil into the well of dry ingredients.",
        "Mix together with a fork until a dough is formed. Start rolling the dough into golf ball-size balls and then flatten using your thumb.",
        "Spoon in a teaspoon of the cream cheese mixture and a square of chocolate. Close the dough with your hands, pinching the seams if necessary, and roll into a ball.",
        "Heat up the liter of sunflower oil in a pan until it reaches 375°F (190.5°C).",
        "Deep-fry the doughnut balls for about 4-5 minutes, until golden brown. Then leave donuts to drain and cool on a wiring rack or paper towel.",
        "Drizzle over the melted white chocolate and remaining half of the cookie crumbs.",
        "Enjoy!"
    ]
}