{
    "id": "dairy-free-chocolate-glazed-donuts",
    "link": "https://tasty.co/recipe/dairy-free-chocolate-glazed-donuts",
    "name": "Dairy-Free Chocolate-Glazed Donuts Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/145997.jpg",
    "description": "Here's what you need: nonstick cooking spray, all-purpose flour, baking powder, salt, unsweetened applesauce, almond milk, maple syrup, vanilla extract, apple cider vinegar, powdered sugar, cocoa powder, almond milk, vegan sprinkles",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "Nonstick cooking spray",
        "1 cup all-purpose flour",
        "1 teaspoon baking powder",
        "Pinch of salt",
        "½ cup unsweetened applesauce",
        "½ cup almond milk or dairy-free milk of choice",
        "¼ cup maple syrup",
        "2 teaspoons vanilla extract",
        "1 teaspoon apple cider vinegar",
        "½ cup powdered sugar",
        "⅓ cup dairy-free cocoa powder",
        "½ cup almond milk or dairy-free milk of choice, as needed",
        "Vegan sprinkles, optional"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 375˚F (190˚C). Grease a 6-indent donut pan with nonstick spray.",
        "Combine the flour, baking powder, and a pinch of salt in a medium bowl.",
        "In a large bowl, combine the applesauce, almond milk, maple syrup, vanilla, and apple cider vinegar. Whisk until smooth.",
        "Using a spatula, fold the dry ingredients into the wet ingredients in two additions until thoroughly combined.",
        "Pour the batter into the donut pan and smooth the tops with a spatula.",
        "Bake for 15–20 minutes, or until golden brown and a toothpick inserted in a donut comes out clean.",
        "Let cool for 5–10 minutes, then invert onto a wire rack to cool completely.",
        "Combine the powdered sugar and cocoa powder in a wide, medium bowl. Add the almond milk, about 2 tablespoons at a time, until the glaze is smooth, but thick enough to set on top of the donuts.",
        "Dip the top of each donut in the glaze and return to baking rack to let any excess glaze drip off.",
        "If using sprinkles, add them immediately after glazing the donuts. Work quickly, as the glaze will harden very fast.",
        "Enjoy!"
    ]
}