{
    "id": "mac-and-cheese-bun-burgers",
    "link": "https://tasty.co/recipe/mac-and-cheese-bun-burgers",
    "name": "Mac And Cheese Bun Burgers Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/98426.jpg",
    "description": "Here's what you need: macaroni, unsalted butter, shredded sharp cheddar cheese, shredded parmesan cheese, american cheese, whole milk, salt, mustard powder, cayenne pepper, garlic powder, all-purpose flour, egg, panko breadcrumbs, vegetable oil, ground beef, salt, pepper, red onion, tomato",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 pound macaroni",
        "4 tablespoons unsalted butter",
        "8 ounces sharp cheddar cheese, shredded",
        "8 ounces Parmesan cheese, shredded",
        "8 ounces American cheese, cubed",
        "12 ounces whole milk",
        "1 tablespoon salt",
        "1 tablespoon mustard powder",
        "½ teaspoon cayenne pepper",
        "1 teaspoon garlic powder",
        "1½ cups all-purpose flour",
        "4 eggs, beaten",
        "1½ cups panko bread crumbs",
        "Vegetable oil, for frying",
        "1½-2 pounds ground beef, formed into hamburger patties",
        "Salt and pepper",
        "n/a",
        "Red onion, sliced, to serve",
        "Tomato, sliced, to serve"
    ],
    "recipeInstructionSteps": [
        "Prepare macaroni according to package directions. Drain the macaroni in a colander and return to the pot.",
        "Add butter, cheddar cheese, Parmesan cheese, American cheese, milk, salt, mustard powder, cayenne to the pot. Turn heat up to medium-low and stir until cheeses are melted and all ingredients are well combined.",
        "Remove the pot from the heat and pour onto a parchment paper-lined sheet tray. Spread evenly with a spatula, cover with plastic wrap, and refrigerate for at least 30 minutes.",
        "Once cooled, use a ring mold or rounded container roughly 4-inches (10 cm) in diameter to cut out 6-8 “buns.”",
        "Place flour, eggs, and bread crumbs in three separate bowls.",
        "Dip each macaroni bun in flour, then egg, and finally bread crumbs, coating evenly.",
        "Preheat vegetable oil to 350°F (175°C).",
        "Place the macaroni buns gently in oil and fry 3-4 minutes, until golden brown. Remove with a slotted spoon and drain on paper towel-lined plate.",
        "Season hamburger patties liberally with salt and pepper. In a cast-iron skillet over high heat, sear patties to desired doneness, flipping halfway through.",
        "Place burger between two mac and cheese buns and top with sliced onions and tomatoes.",
        "Enjoy!"
    ]
}