{
    "id": "ultimate-mac-n-cheese",
    "link": "https://tasty.co/recipe/ultimate-mac-n-cheese",
    "name": "Ultimate Mac ‘n’ Cheese Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/2f13acb9b15f4bc8b7c7a8f2cc50c6d1/FB_04forpkg.jpg",
    "description": "Here's what you need: bacon, garlic, panko breadcrumbs, fresh chives, fresh parsley, butter, flour, evaporated milk, salt, pepper, dry mustard powder, cayenne pepper, macaroni, cheddar cheese, gruyère cheese, colby jack cheese, smoked gouda cheese, provolone cheese, shredded mozzarella cheese, shredded cheddar cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "½ pound bacon, sliced",
        "5 cloves garlic, minced",
        "2 cups panko bread crumbs",
        "½ cup chives, chopped",
        "½ cup parsley, chopped",
        "4 tablespoons butter",
        "¼ cup flour",
        "3 cups evaporated milk",
        "Salt, to taste",
        "Pepper, to taste",
        "2 teaspoons dry mustard powder",
        "½ teaspoons cayenne pepper",
        "1 pound macaroni, cooked",
        "½ cup cheddar cheese, cubed",
        "½ cup Gruyère cheese, shredded",
        "½ cup colby jack cheese, cubed",
        "½ cup Gouda cheese, shredded",
        "½ cup provolone cheese, cubed",
        "1 cup mozzarella cheese, shredded",
        "1 cup cheddar cheese, shredded"
    ],
    "recipeInstructionSteps": [
        "In a large pot, cook the bacon on medium heat until the bacon is crispy and the fat is rendered.",
        "Add the garlic, bread crumbs, chives, and chopped parsley. Stir and cook until the bread crumbs are toasted around 5 minutes. Remove from the pot.",
        "To the same pot on medium heat, add the butter. Melt it, sprinkle in flour, and stir until combined.",
        "Add the evaporated milk and bring to a simmer. Season with salt, pepper, dry mustard, and cayenne pepper. Whisk to incorporate and remove any lumps. The sauce should be thick enough to coat the back of the spoon.",
        "Preheat oven to 350˚F (180˚C).",
        "Add the pasta into the sauce, and stir to combine.",
        "Add the cheddar, Gruyère, colby jack, Gouda, and provolone cheese, fold the cheeses into the pasta. If it seems too dry, add extra milk to your liking.",
        "Pour the mixture into a baking dish and top with shredded mozzarella and cheddar.",
        "Bake for 45 minutes or until the mac ‘n’ cheese is bubbly, melted, and golden brown on top.",
        "Serve with a sprinkle of the bread crumb mixture for added flavor!",
        "Enjoy!"
    ]
}