{
    "id": "rainbow-hummus",
    "link": "https://tasty.co/recipe/rainbow-hummus",
    "name": "Rainbow Hummus Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/163538.jpg",
    "description": "Here's what you need: chickpeas, roasted red pepper, tahini, olive oil, lemon juice, garlic, smoked paprika, salt, chickpeas, sun-dried tomato, tahini, olive oil, garlic, salt, lemon juice, chickpeas, tahini, olive oil, garlic, ground turmeric, lemon juice, salt, chickpeas, fresh spinach, artichoke heart, tahini, olive oil, garlic, lemon juice, salt, chickpeas, purple sweet potato, tahini, olive oil, garlic, lemon juice, salt, water, chickpeas, beet, tahini, olive oil, lemon juice, garlic, salt, baby carrot, crackers, pita bread",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 15-ounce can of chickpeas, drained and rinsed",
        "1 14-ounce jar of roasted red peppers",
        "1 tablespoon tahini",
        "1 tablespoon olive oil",
        "1 tablespoon lemon juice",
        "1 clove garlic",
        "½ teaspoon smoked paprika",
        "¾ teaspoon salt",
        "1 15-ounce can of chickpeas, drained and rinsed",
        "⅓ cup sun-dried tomatoes",
        "2 tablespoons tahini",
        "2 tablespoons olive oil",
        "1 clove garlic",
        "¾ teaspoon salt",
        "1 tablespoon lemon juice",
        "1 15-ounce can of chickpeas, drained and rinsed",
        "2 tablespoons tahini",
        "3 tablespoons olive oil",
        "2 cloves garlic",
        "1 teaspoon ground turmeric",
        "1 tablespoon lemon juice",
        "½ teaspoon salt",
        "1 15-ounce can of chickpeas, drained and rinsed",
        "2 cups fresh spinach",
        "¾ cup artichoke hearts",
        "2 tablespoons tahini",
        "2 tablespoons olive oil",
        "1 clove garlic",
        "1 tablespoon lemon juice",
        "½ teaspoon salt",
        "½ cup canned chickpeas, drained and rinsed",
        "1½ cups cubed cooked purple sweet potatoes",
        "2 tablespoons tahini",
        "3 tablespoons olive oil",
        "1 clove garlic",
        "1 tablespoon lemon juice",
        "¾ teaspoon salt",
        "2-3 tablespoons water, if needed",
        "1 15-ounce can of chickpeas, drained, and rinsed",
        "1 cup canned beets",
        "2 tablespoons tahini",
        "2 tablespoons olive oil",
        "1 tablespoon lemon juice",
        "1 clove garlic",
        "¾ teaspoon salt",
        "Baby carrots, for serving",
        "Crackers, for serving",
        "Quarted pita bread, for serving"
    ],
    "recipeInstructionSteps": [
        "Make the roasted red pepper hummus: combine the chickpeas, roasted red peppers, tahini, olive oil, lemon juice, garlic, paprika, and salt in a food processor and pulse until smooth. Transfer to a small bowl and wash out the food processor.",
        "Make the sun-dried tomato hummus: combine the chickpeas, sun-dried tomatoes, tahini, olive oil, garlic, salt, and lemon juice in a food processor and pulse until smooth. Transfer to a small bowl and wash out the food processor.",
        "Make the turmeric garlic hummus: combine the chickpeas, tahini, olive oil, garlic, turmeric, lemon juice, and salt in a food processor and pulse until smooth. Transfer to a small bowl and wash out the food processor.",
        "Make the spinach and artichoke hummus: combine the chickpeas, spinach, artichoke hearts, tahini, olive oil, garlic, lemon juice, and salt in a food processor and process until smooth. Transfer to a small bowl and wash out the food processor.",
        "Make the purple sweet potato hummus: combine the chickpeas, purple sweet potatoes, tahini, olive oil, garlic, lemon juice, and salt in a food processor and process until smooth. Add 2-3 tablespoon of water, as needed, if the hummus seems too thick. Transfer to a small bowl and wash out the food processor.",
        "Make the beet hummus: combine the chickpeas, beets, tahini, olive oil, lemon juice, garlic, and salt in a food processor and process until smooth. Transfer to a small bowl.",
        "To assemble, spoon each hummus color in six strips in a medium to large baking or serving dish. Use a spatula or bench scraper to help separate the sections.",
        "Serve with carrots, crackers, and pita bread.",
        "Enjoy!"
    ]
}