{
    "id": "greek-chicken-gyro-salad",
    "link": "https://tasty.co/recipe/greek-chicken-gyro-salad",
    "name": "Greek Chicken Gyro Salad Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/5ea73118cab04a43bfbaeca7c7f81808/BFV34152_ChickenSalads4Ways-FB_2.jpg",
    "description": "Here's what you need: plain nonfat greek yogurt, cucumber, lemon juice, olive oil, garlic, salt, small whole wheat pita, lemon, olive oil, fresh oregano, lemon, garlic, salt, ground black pepper, boneless, skinless chicken breast, baby spinach, cherry tomato, red onion, cucumber",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Greek",
    "recipeIngredient": [
        "⅔ cup plain nonfat Greek yogurt",
        "2 tablespoons grated cucumber, excess water squeezed out",
        "1 tablespoon lemon juice",
        "1 tablespoon olive oil",
        "1 clove garlic, minced",
        "½ teaspoon salt",
        "1 small whole wheat pita, cut into wedges",
        "Juice of 1 lemon",
        "1 tablespoon + 1 teaspoon olive oil, divided",
        "1 tablespoon oregano, chopped",
        "Zest of 1 lemon",
        "1 clove garlic, minced",
        "½ teaspoon salt",
        "¼ teaspoon ground black pepper",
        "1 boneless, skinless chicken breast, cubed",
        "2 cups baby spinach",
        "½ cup cherry tomatoes, halved",
        "½ red onion, thinly sliced",
        "½ cucumber, thinly sliced"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 375˚F (190˚C).",
        "In a bowl, add the Greek yogurt, cucumber, lemon juice, olive oil, garlic, and salt, and stir to combine.",
        "Place pita wedges on a baking sheet and bake until crisp, about 8 minutes.",
        "In a bowl, add the lemon juice, 1 tablespoon olive oil, oregano, lemon zest, garlic, salt, black pepper, and chicken, and toss to coat.",
        "Heat remaining olive oil in a pan over medium heat. Once the oil begins to shimmer, add the chicken and cook until browned, about 5 minutes.",
        "Add the spinach, cherry tomatoes, red onion, cucumber, chicken, and pita chips together in a large bowl and drizzle with tzatziki dressing.",
        "Enjoy!"
    ]
}