{
    "id": "hot-chicken-chopped-salad",
    "link": "https://tasty.co/recipe/hot-chicken-chopped-salad",
    "name": "Hot Chicken Chopped Salad Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/be67d98741c647adb1afa7fad3f9c7c3/BFV34152_ChickenSalads4Ways-FB_2.jpg",
    "description": "Here's what you need: plain nonfat greek yogurt, lemon juice, green onion, salt, dijon mustard, garlic, ground black pepper, flour, salt, ground black pepper, egg, plain breadcrumbs, boneless, skinless chicken breast, buffalo sauce, honey, baby spinach, red cabbage, cherry tomato, cucumber",
    "recipeCategory": "Lunch",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "⅓ cup plain nonfat Greek yogurt",
        "1 tablespoon lemon juice",
        "2 teaspoons green onions, chopped",
        "¼ teaspoon salt",
        "¼ teaspoon Dijon mustard",
        "½ clove garlic, minced",
        "Pinch of ground black pepper",
        "2 tablespoons flour",
        "½ teaspoon salt",
        "¼ teaspoon ground black pepper",
        "1 egg",
        "2 tablespoons plain bread crumbs",
        "1 boneless, skinless chicken breast",
        "1 tablespoon buffalo sauce",
        "1 tablespoon honey",
        "2 cups baby spinach",
        "1 cup red cabbage, shredded",
        "¾ cup cherry tomatoes, halved",
        "½ cucumber, thinly sliced"
    ],
    "recipeInstructionSteps": [
        "In a bowl, add the Greek yogurt, lemon juice, green onions, salt, mustard, garlic, and black pepper, and whisk to combine.",
        "Add the flour, salt, and pepper to a wide, shallow bowl and stir to combine.",
        "Add the egg into another bowl, and whisk until beaten.",
        "Place bread crumbs in a third wide, shallow bowl.",
        "Dip the chicken in the flour, the egg, and then bread crumbs.",
        "Heat olive oil in a pan over medium heat. Once the oil begins to shimmer, add the chicken breast and cook until crispy and golden, about 3 minutes per side.",
        "Remove the chicken from the pan and toss in a bowl of buffalo sauce and honey. Slice the chicken into strips.",
        "Add the spinach, cabbage, tomatoes, and cucumber to a bowl and drizzle with the dressing. Top with the hot chicken. Toss to combine.",
        "Enjoy!"
    ]
}