{
    "id": "bbq-pork-party-tower",
    "link": "https://tasty.co/recipe/bbq-pork-party-tower",
    "name": "BBQ Pork Party Tower Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/170308.jpg",
    "description": "Here's what you need: boneless pork shoulder, brown sugar, coarse kosher salt, paprika, mustard powder, ground cumin, garlic powder, chile powder, ground coriander, onion powder, black pepper, cayenne pepper, russet potato, hamburger bun, coleslaw, mac 'n' cheese, pickle, ketchup, dark brown sugar, molasses, worcestershire sauce, apple cider vinegar, garlic powder, paprika, dijon mustard, cayenne pepper, wooden skewer",
    "recipeCategory": "Dinner",
    "recipeCuisine": "BBQ",
    "recipeIngredient": [
        "7 pounds boneless pork shoulder",
        "3 tablespoons brown sugar",
        "2 tablespoons coarse kosher salt",
        "2 tablespoons paprika",
        "2 teaspoons mustard powder",
        "1 tablespoon ground cumin",
        "1 tablespoon garlic powder",
        "1 tablespoon chile powder",
        "2 teaspoons ground coriander",
        "1 tablespoon onion powder",
        "1 teaspoon black pepper",
        "1 teaspoon cayenne pepper",
        "1 russet potato, halved lengthwise",
        "12 hamburger buns or dinner rolls",
        "Coleslaw, for serving (optional)",
        "Mac ‘n’ cheese, for serving (optional)",
        "Pickles, for serving (optional)",
        "1½ cups ketchup",
        "¼ cup packed dark brown sugar",
        "3 tablespoons molasses",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon garlic powder",
        "1 tablespoon paprika",
        "1 tablespoon Dijon mustard",
        "½ teaspoon cayenne pepper",
        "2 wooden skewers"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 300°F (150°C). Arrange an oven rack on the lowest setting, removing the other racks if needed.",
        "Place the pork shoulder on a cutting board and slice the meat into 2-inch (5 cm) thick slices.",
        "In a small bowl, combine the brown sugar, salt, paprika, mustard powder, cumin, garlic powder, chile powder, coriander, onion powder, black pepper, and cayenne.",
        "Sprinkle the spice mixture all over the sliced pork and toss to coat evenly.",
        "Set a wire rack over a baking sheet and grease with nonstick spray. Place the potato halves on the rack, cut sides down. Insert a skewer into each potato half.",
        "Thread the pork slices onto the skewers.",
        "Cover the pork tower with foil, place in the oven, and roast for 4 hours or until the pork is fully cooked and tender.",
        "To a small pot on medium heat, add oil, minced onion, garlic, and the leftover spice mixture. Stir the vegetables and cook until soft.",
        "Make the barbecue sauce: In a medium pot over medium heat, combine the ketchup, brown sugar, molasses, Worcestershire sauce, apple cider vinegar, garlic powder, paprika, Dijon, and cayenne. Whisk and bring the sauce to a boil. Remove from the heat and set aside until ready to use.",
        "Once the pork is finished cooking, remove the foil and pour the barbecue sauce over the pork tower. Use a brush to evenly cover all of the meat.",
        "Return the pork to the oven for 30 minutes, or until the sauce starts to caramelize.",
        "Carve the pork tower with a serrated knife. Serve the meat on the buns, with sides like coleslaw, mac ‘n’ cheese, and pickles.",
        "Enjoy!"
    ]
}