{
    "id": "chicken-alfredo-ravioli-lasagna",
    "link": "https://tasty.co/recipe/chicken-alfredo-ravioli-lasagna",
    "name": "Chicken Alfredo Ravioli Lasagna Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/178920.jpg",
    "description": "Here's what you need: unsalted butter, garlic, heavy cream, grated parmesan cheese, salt, pepper, nutmeg, spinach ricotta ravioli, rotisserie chicken, shredded mozzarella cheese, fresh parsley",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "2 tablespoons unsalted butter",
        "1 tablespoon minced garlic",
        "4 cups heavy cream",
        "2 cups grated Parmesan cheese",
        "Salt, to taste",
        "Pepper, to taste",
        "½ teaspoon grated nutmeg",
        "3 10-ounce packages of spinach ricotta ravioli, uncooked",
        "2 cups shredded rotisserie chicken, divided",
        "2 cups shredded mozzarella cheese, divided",
        "2 tablespoons chopped fresh parsley"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 400˚F (200˚C).",
        "In a large sauté pan, melt the butter over medium heat. Add the garlic and sauté for 2-3 minutes, until softened.",
        "Add the heavy cream and Parmesan and stir to incorporate. Once the mixture comes to a low boil, reduce the heat to low and simmer for 10-15 minutes, until the sauce coats the back of a spoon. Season with salt, pepper, and nutmeg. Remove the sauce from the heat.",
        "Pour a thin layer of sauce in a the bottom of a 9x13-inch (23x33 cm) glass baking dish. Arrange 1 package of spinach ricotta ravioli over the sauce. Top with 1 cup of shredded chicken and ½ cup (50 g) of mozzarella cheese. Cover with more sauce.",
        "Arrange another package of ravioli over the first layer, and top with the remaining cup of shredded chicken and another ½ cup (50 g) of mozzarella. Top with more sauce. Add the last package of ravioli and cover with remaining sauce, making sure all the ravioli are covered. Top with the remaining cup of shredded mozzarella cheese.",
        "Cover the ravioli lasagna with foil and bake for 20 minutes. Uncover and cook for another 20 minutes, until the cheese is golden brown. Let cool for 10 minutes.",
        "Sprinkle with chopped parsley, then serve.",
        "Enjoy!"
    ]
}