{
    "id": "easy-butternut-squash-ravioli",
    "link": "https://tasty.co/recipe/easy-butternut-squash-ravioli",
    "name": "Easy Butternut Squash Ravioli Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/8a409d58dfb246a08130a32ecdca7170/BFV30243_ButternutSquashRavioliNINO-FB_05.jpg",
    "description": "Here's what you need: butternut squash, onion, garlic, olive oil, salt, pepper, brown sugar, grated parmesan cheese, flour, egg, olive oil, unsalted butter, roasted hazelnut, fresh sage, salt, lemon, grated parmesan cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "2 cups butternut squash, peeled and chopped",
        "½ onion, chopped",
        "3 cloves garlic, peeled",
        "1 tablespoon olive oil",
        "Salt, to taste",
        "Pepper, to taste",
        "1 tablespoon brown sugar",
        "2 ounces grated Parmesan cheese",
        "2 cups flour",
        "4 eggs",
        "1 tablespoon olive oil",
        "5 tablespoons unsalted butter",
        "¼ cup roasted hazelnuts, chopped",
        "10 sage leaves",
        "Salt, to taste",
        "Juice of 1 lemon",
        "1 ounce grated Parmesan cheese"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 425˚F (220˚C).",
        "Add the diced butternut squash, chopped onion, whole garlic cloves, olive oil, salt, and pepper to a baking sheet, tossing until fully coated.",
        "Bake until the squash is golden brown and tender, about 30 minutes.",
        "While the squash is in the oven, make the dough.",
        "When the squash is finished cooking, add it to the food processor along with the brown sugar and Parmesan cheese. Pulse until it becomes smooth. Set aside to chill.",
        "Rinse the bowl of the food processor.",
        "To the bowl of a food processor, add the flour, eggs, and olive oil, and pulse until the dough comes together into a large ball and swirls around the processor.",
        "Remove the dough, wrap in plastic wrap, and rest it the refrigerator for 30 minutes.",
        "Cut 2 ounces (55 g) of pasta dough from the ball and roll out into large, wide, thin sheets of pasta.",
        "Lay a sheet over an empty ice cube tray, and press the dough down gently into each of the holes.",
        "Fill each hole with a tablespoon of the butternut squash filling. Place a second sheet on top of the ice cube tray. Press down on all the sides of the raviolis. Flip the ice cup tray over to release the pasta and cut off any excess dough.",
        "Separate each ravioli with a knife or cutting tool.",
        "Gently place a few raviolis into boiling salted water and cook until the raviolis float and firm up slightly, 2-3 minutes. Scoop out the ravioli and set aside briefly to cook a new batch or dump out the water and start the hazelnut brown butter sauce.",
        "In a pan, add 3 tablespoons of the butter, sage leaves, and hazelnuts. Cook until the butter browns deeply, the nuts are heated through, and the sage is fried and crispy. Turn off the heat and add the lemon juice and season to taste.",
        "Swirl in 2 more tablespoons more of chilled butter, to thicken the sauce. Add the cooked raviolis back in and toss gently to coat the pasta.",
        "Serve the pasta with brown butter sauce.",
        "Enjoy!"
    ]
}