{
    "id": "four-cheese-ravioli-with-rosemary-butter-sauce",
    "link": "https://tasty.co/recipe/four-cheese-ravioli-with-rosemary-butter-sauce",
    "name": "Four Cheese Ravioli With Rosemary Butter Sauce Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/a22b6632ef8c47088b22b4b3b13af48e/BFV6685_Four_Cheese_Ravioli_With_Rosemary_Butter_Sauce_ALT_THUMB.jpg",
    "description": "Here's what you need: '00' grade pasta flour, egg, ricotta cheese, cream cheese, grated mozzarella cheese, grated cheddar cheese, fresh parsley leaf, salt, pepper, fresh rosemary, butter, pine nuts",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "300g ’00’ grade pasta flour (plus more for dusting)",
        "3 eggs",
        "225g ricotta",
        "100g cream cheese",
        "60g mozzarella (grated)",
        "60g cheddar (grated)",
        "A handful of fresh parsley leaves (finely chopped, about 5g)",
        "Salt and pepper",
        "n/a",
        "2 sprigs rosemary (just the leaves, finely chopped)",
        "30g butter",
        "100g pine nuts"
    ],
    "recipeInstructionSteps": [
        "Pour the flour into a large bowl and make a well in the centre, crack the eggs into the well and mix everything together with a spoon or fork.",
        "When the mixture has combined, knead the dough for 5 minutes. Form it into a ball, wrap it in cling film and refrigerate for 30 minutes.",
        "While the dough is in the fridge, mix together the ricotta, cream cheese, mozzarella, cheddar, parsley and a sprinkling of salt and pepper to make the filling. Set aside until needed.",
        "On a floured surface, roll half of the dough out as thin as you can using a rolling pin to make a long rectangular shape (If you have a pasta machine, use the 2nd thinnest setting) - keep the other half of the dough in cling film in the fridge to keep it fresh until you’re ready for it.",
        "On one side, dollop tablespoons of the cheese filling onto the pasta, leaving at least a 1-2cm (⅓-¾ inch) gap in all directions.",
        "Brush the pasta that’s surrounding the filling with water or egg white. Fold the other side of the past over and on top of the filling, pushing down around each part to seal it in, creating a long strip of ravioli pieces.",
        "Use a knife or pizza cutter to cut around and create individual pieces of ravioli.",
        "Dust these pieces with flour and repeat from step 4 using the other half of the dough.",
        "Boil the pasta in salted water on a medium heat for 2-3 minutes until the pasta floats to the top, then drain.",
        "Melt the butter in a frying pan then add the pine nuts, cook for 2 minutes then add the rosemary - cook for a further minute or two until the pine nuts look toasted and the rosemary has just begun to brown and crisp up a bit.",
        "Enjoy!"
    ]
}