{
    "id": "truffle-shrimp-ravioli-by-estrella-sunset-sweetfin-poke-s-chef-dakota-weiss",
    "link": "https://tasty.co/recipe/truffle-shrimp-ravioli-by-estrella-sunset-sweetfin-poke-s-chef-dakota-weiss",
    "name": "Truffle Shrimp Ravioli Pasta By Estrella Sunset &amp; Sweetfin Poké&#x27;s Chef Dakota Weiss Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/63f7f7cead0945169485f56599f2d9bf/BFV17081_TruffleShrimpRavioli_-thumb_FB.jpg",
    "description": "Here's what you need: 00 pasta flour, milk, egg yolk, extra virgin olive oil, salt, shrimp, cream cheese, ricotta cheese, black truffle butter, black truffle oil, salt, fresh chives, lemon, lemon, hazelnuts, panko breadcrumbs, brown butter, salt, butter, chicken stock, shallot, fresh chives",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "500 grams double “00” pasta flour",
        "70 grams milk",
        "200 grams egg yolks",
        "20 grams extra virgin olive oil",
        "Pinch of salt",
        "½ pound shrimp, peeled and deveined",
        "3 tablespoons cream cheese",
        "2 tablespoons ricotta cheese",
        "1 tablespoons black truffle butter",
        "1 tablespoons black truffle oil",
        "Salt, to taste",
        "2 tablespoons chives, chopped",
        "1 lemon, zested",
        "1 lemon, juiced",
        "6 ounces toasted hazelnuts",
        "6 ounces panko bread crumbs",
        "3 ounces brown butter",
        "Salt, to taste",
        "1 tablespoon butter",
        "¼ cup chicken stock",
        "2 tablespoons minced shallot",
        "1 tablespoon minced chives"
    ],
    "recipeInstructionSteps": [
        "Make the pasta by adding flour and a pinch of salt to the bowl of a food processor, pulse a few times.",
        "Add the egg yolks, milk, and olive oil.",
        "Run the food processor, adding additional milk or flour if the mixture is too wet or dry. Once it to starts to clump together and becomes a dough, let it get “worked” in the food processor for about 10 turns.",
        "Take your pasta to a floured table surface and knead it with your hands until you start to get a shiny, smooth surface. Wrap in plastic and set it aside to rest, about 30 minutes.",
        "Add all of the truffle shrimp mousse ingredients to a cleaned food processor and run until very smooth.",
        "Transfer to piping bag and set aside in the refrigerator.",
        "Begin rolling out the pasta dough by cutting off about an eighth of the dough ball and flattening with a rolling pin, until it forms a long rectangle about ¼ inch (6 mm) in thickness and is no wider than your pasta machine.",
        "Run the dough strip through your pasta machine from the machine’s widest setting a few times until smooth.",
        "Start rolling the dough through the settings, towards the most narrow, skipping no settings in between, rolling the dough through each setting twice.",
        "NOTE: Cut the dough strip into smaller pieces if it becomes too long and unmanageable. Store finished strips under a damp cloth to keep pasta from drying out.",
        "Use a circular cutter about 3 inches (7 cm) in diameter to cut ravioli.",
        "Pipe about 1 tablespoon onto each circle (the amount will vary depending on the exact size of your circles). Egg wash the perimeter and join sides of the circle to form a half circle. Gently pinch dough together to seal ravioli.",
        "Place prepared ravioli on a floured surface to prevent sticking, covered with a lightly moistened towel.",
        "Egg wash the perimeter and join sides of the circle to form a half circle. Gently pinch dough together to seal ravioli.",
        "Heat butter for the bread crumbs in a saucepan until milk solids begin to brown and it starts to smell nutty, then remove from heat.",
        "Puree all bread crumb ingredients with the browned butter in food processor until it reaches a coarse sand-like texture.",
        "Return bread crumbs to saucepan and toast until golden. Stir often to prevent burning.",
        "Cook ravioli in salted boiling water 2 minutes.",
        "NOTE: Submerge in ice bath if not serving immediately.",
        "For the glace, melt butter in saucepan. Add chicken stock and whisk together until simmering. Add shallots and chives and then immediately add ravioli. Continuously move the ravioli to warm and coat the with the glace, about 2 minutes.",
        "Serve topped with toasted hazelnut bread crumbs.",
        "Enjoy!"
    ]
}