{
    "id": "zucchini-ravioli",
    "link": "https://tasty.co/recipe/zucchini-ravioli",
    "name": "Low-Carb Zucchini &quot;Ravioli&quot; Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/104062.jpg",
    "description": "Here's what you need: medium zucchini, olive oil, garlic, fresh spinach, ricotta cheese, fresh basil, salt, pepper, marinara sauce, shredded mozzarella cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "2 medium zucchinis",
        "Olive oil, to taste",
        "2 cloves garlic, minced",
        "2 cups spinach, chopped",
        "1 cup ricotta",
        "2 tablespoons basil, finely sliced",
        "Salt, to taste",
        "Pepper, to taste",
        "1 cup marinara sauce",
        "½ cup shredded mozzarella cheese"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 425°F (220°C).",
        "Cut off the end of each zucchini then using a vegetable peeler, peel each zucchini into wide strips.",
        "Transfer the zucchini strips to a plate then layer two strips vertically and two strips horizontally to make a cross. Repeat process with remaining strips.",
        "Heat a pan over medium-high heat.",
        "Add olive oil then garlic and sauté for 30 seconds to 1 minute.",
        "Add spinach, salt, and pepper. Sauté for 1-2 minutes, until wilted down.",
        "Remove from heat and allow to cool for 10 minutes.",
        "In a large bowl, add the spinach and garlic. Add the ricotta, basil, salt, and pepper. Mix until well combined.",
        "Using a spoon or cookie scoop, scoop approximately 1 tablespoon of the mixture and place in the middle of each zucchini noodle cross.",
        "Fold each side to seal the ricotta mixture then flip over the ravioli so the seam side is on the bottom.",
        "In a baking dish pour the marinara sauce then smooth with a spatula.",
        "Evenly place the zucchini raviolis then top with mozzarella cheese.",
        "Bake for 15-20 minutes.",
        "Serve with fresh basil.",
        "Enjoy!"
    ]
}