{
    "id": "cookies-and-cream-macarons",
    "link": "https://tasty.co/recipe/cookies-and-cream-macarons",
    "name": "Cookies and Cream Macarons Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/35bd73b2ad0b49288dac04fe01e2e57a/Final_FB_04.jpg",
    "description": "Here's what you need: egg white, sugar, powdered sugar, superfine almond flour, chocolate cookie, dark cocoa powder, black food coloring, powdered sugar, butter, vanilla, milk, cookie and cream filling",
    "recipeCategory": "Desserts",
    "recipeCuisine": "French",
    "recipeIngredient": [
        "3 eggs whites, room temperature",
        "¼ cup sugar",
        "1¼ cups powdered sugar",
        "¾ cup superfine almond flour",
        "¼ cup crushed chocolate cookies",
        "2 tablespoons dark cocoa powder",
        "½ teaspoons black food coloring",
        "2 cups of powdered sugar",
        "1 cup of softened butter",
        "1 teaspoons of vanilla",
        "2 tablespoons of milk",
        "½ cup cookies and cream filling"
    ],
    "recipeInstructionSteps": [
        "In a medium bowl, beat the egg whites until frothy.",
        "Keep beating and slowly add sugar until stiff peaks form.",
        "Sift powdered sugar, cookie crumbs, almond flour, and cocoa powder over the egg whites.",
        "Fold the dry mixture into the egg whites completely, but make sure to not overmix or the macarons will not rise.",
        "Once the batter reaches a lava-like consistency, add the food coloring. Mix until just combined, without over mixing.",
        "Preheat oven to 285ºF (140ºC).",
        "Place the mixture into a piping bag or zip-top bag. Cut of the tip to pipe.",
        "Pipe 1½-inch (4 cm) dollops onto a baking sheet lined with parchment paper. Tip: take a little batter to “glue” down the edges of the parchment paper so it stays put.",
        "Let the cookies rest at room temperature for 30 minutes to an hour, until they are no longer wet to the touch and a skin forms on top.",
        "While resting, make the filling by mixing the butter, powdered sugar, cookie cream filling, vanilla, and milk in a bowl until smooth.",
        "Transfer to a piping bag and set aside until ready to fill.",
        "When the cookies are dry to the touch, bake for 15-18 minutes until they have risen.",
        "Let rest for 10 minutes before filling.",
        "To fill, pipe about about a tablespoon of the buttercream onto one macaron and place another on top.",
        "Macarons are best kept refrigerated until serving.",
        "Enjoy!"
    ]
}