{
    "id": "strawberry-cheesecake-macarons",
    "link": "https://tasty.co/recipe/strawberry-cheesecake-macarons",
    "name": "Strawberry Cheesecake Macarons Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/55122.jpg",
    "description": "Here's what you need: egg white, granulated sugar, powdered sugar, superfine almond flour, red food coloring, cream cheese, powdered sugar, milk, strawberry jam",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "French",
    "recipeIngredient": [
        "3 eggs whites, room temperature",
        "¼ cup sugar",
        "1¾ cup powdered sugar",
        "1 cup superfine almond flour",
        "3 drops red food coloring",
        "1 8-ounce package of cream cheese",
        "1 cup powdered sugar",
        "2 tablespoons milk",
        "Strawberry jam"
    ],
    "recipeInstructionSteps": [
        "In a medium bowl, beat the egg whites until frothy. Keep beating and slowly add the sugar until stiff peaks form. Sift the powdered sugar and almond flour over the egg whites. Fold the dry mixture into the egg whites, giving the bowl a quarter turn every third fold. Once the batter reaches a lava-like consistency, transfer half to another bowl and add the food coloring. Mix until just combined. Do not overmix!",
        "Working quickly, put the white and pink batters into separate small zip-top bags. Cut a corner off of each bag and squeeze the 2 batters evenly into a larger gallon-size bag or piping bag to create a multicolor effect.",
        "Line a baking sheet with parchment paper. (Tip: use a little batter to “glue” down the edges of the parchment paper so it stays put). In a circular motion, pipe 1½-inch (4-cm) dollops onto the baking sheet. Lift the baking sheet and gently tap on the counter to settle the batter. Let the cookies rest for 1 hour, until they are no longer wet to the touch and a skin forms on top.",
        "Preheat the oven to 285ºF (140ºC).",
        "Make the filling by mixing the cream cheese, powdered sugar, and milk in a medium bowl until smooth. Transfer to a piping bag and set aside until ready to fill the cookies.",
        "When the cookies are dry to the touch, bake for 13-15 minutes, until they have risen. Let them cool for 10 minutes. To fill, pipe a circle of the cream cheese mixture around the edge of 1 cookie and place a small dollop of jam in the center. Sandwich with another cookie. Macarons are best kept refrigerated until serving.",
        "Enjoy!"
    ]
}