{
    "id": "bacon-wrapped-burger-ring",
    "link": "https://tasty.co/recipe/bacon-wrapped-burger-ring",
    "name": "Bacon-Wrapped Burger Ring Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/f6a55ff181ba4fe1b28f69f723cc6e18/BFV29883cheeseburgerringFB_Final.jpg",
    "description": "Here's what you need: ground beef, worcestershire, dijon mustard, salt, pepper, garlic powder, onion powder, bacon, roll, lettuce, tomato, milk, flour, salt, shredded cheddar cheese, pepper, garlic powder, onion powder, green chilli, dijon mustard",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "2 pounds ground beef",
        "¼ cup worcestershire",
        "¼ cup Dijon mustard",
        "½ tablespoon salt",
        "½ tablespoon pepper",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 pound of bacon, cut in half",
        "8 rolls",
        "1 cup lettuce, chopped",
        "1 tomato, sliced",
        "1½ cups milk divided",
        "2 tablespoons flour",
        "½ teaspoon salt",
        "1 cup shredded cheddar cheese",
        "½ teaspoon pepper",
        "½ teaspoon garlic powder",
        "½ teaspoon onion powder",
        "½ cup green chilies",
        "¼ cup Dijon mustard"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 375˚F (190˚C).",
        "In a bowl, add the ground beef, worcestershire sauce, Dijon mustard, salt, pepper, onion powder, and garlic powder. Mix to combine.",
        "Transfer to a wire rack on a sheet pan. Create a ring shape with the meat mixture, gently pressing it flat until it’s 2 inches (5 cm) thick.",
        "Place each piece of bacon around the meat ring tucking the bacon underneath.",
        "Bake for 20 minutes, then broil 15-20 minutes on high heat until bacon is crisp.",
        "In a saucepan, add ½ cup (120 ml) of milk and flour on medium heat, whisking until thickened and pulling away from pan.",
        "Pour in the rest of the milk and add the salt, stir until bubbling and thickened about 5 minutes. Remove from heat.",
        "Stir in cheese, pepper, garlic powder, onion powder, green chilies, and Dijon mustard. Transfer to a ramekin or bowl. Set aside.",
        "Arrange the bottom rolls in a circle. Place meat ring on top of buns. Add lettuce and tomato on top of the meat ring then place the top part of the buns around the top of the meat ring.",
        "Place fondue in the center of the meat ring. Slice and serve immediately.",
        "Enjoy!"
    ]
}