{
    "id": "buffalo-chicken-onion-rings",
    "link": "https://tasty.co/recipe/buffalo-chicken-onion-rings",
    "name": "Buffalo Chicken Onion Rings Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/e21bbe6148834880a089632023ce7986/FB_04.jpg",
    "description": "Here's what you need: cream cheese, buffalo sauce, chicken, shredded cheddar cheese, dry ranch dressing mix, large onion, all-purpose flour, egg, panko breadcrumbs, oil",
    "recipeCategory": "Snacks",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "8 ounces cream cheese, softened",
        "½ cup buffalo hot sauce",
        "4 cups shredded chicken",
        "2 cups cheddar cheese, shredded",
        "1 1-ounce packet of dry ranch dressing mix",
        "3 large onions",
        "3 cups all-purpose flour",
        "3 eggs, beaten",
        "3 cups panko breadcrumbs",
        "Oil, for frying"
    ],
    "recipeInstructionSteps": [
        "In a bowl, combine the cream cheese, buffalo sauce, chicken, cheddar, and ranch. Mix with a fork until smooth and evenly mixed.",
        "Cut each end of the onion, peel of the papery onion skin, and cut the onion on its side into large rings.",
        "Separate the large slices into its separate layers.",
        "Put the rings on a parchment paper-lined sheet tray. Take the chicken mixture and press a small amount against the inside of the onion creating a ring shape of the mixture with a hole in the middle.",
        "Freeze until solid. Usually 3-4 hours.",
        "Heat a pot of oil to 375˚F (190˚C).",
        "Set up a breading station by placing flour, beaten eggs, and panko bread crumbs into separate bowls.",
        "Working quickly, bread each frozen ring by coating in flour, then dredge in egg and lastly in bread crumbs. Transfer to a baking dish.",
        "Carefully lower two coated rings into the oil and fry for about 3 minutes or until golden brown. Continue this until all of the rings are fried.",
        "Serve warm with blue cheese, ranch, or more buffalo sauce.",
        "Enjoy!"
    ]
}