{
    "id": "meatball-stuffed-onion-ring-cone",
    "link": "https://tasty.co/recipe/meatball-stuffed-onion-ring-cone",
    "name": "Meatball-Stuffed Onion Ring Cone Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/148861.jpg",
    "description": "Here's what you need: large white onion, all-purpose flour, large egg, panko breadcrumbs, ground beef, small yellow onion, garlic, grated parmesan cheese, panko breadcrumbs, fresh flat-leaf parsley, worcestershire sauce, large egg, salt, black pepper, oil, marinara sauce, grated parmesan cheese, fresh basil",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "2 large white onions",
        "1 cup all-purpose flour",
        "6 large eggs, beaten",
        "3 cups panko bread crumbs",
        "1 pound ground beef",
        "1 small yellow onion, finely chopped",
        "1 clove garlic, minced",
        "½ cup grated Parmesan cheese",
        "½ cup panko bread crumbs",
        "¼ cup finely chopped flat leaf parsley",
        "1 tablespoon Worcestershire sauce",
        "1 large egg",
        "1 teaspoon salt",
        "½ teaspoon black pepper",
        "Oil, for frying",
        "Marinara sauce, for serving",
        "Grated Parmesan cheese, for serving",
        "Chopped fresh parsley, for serving"
    ],
    "recipeInstructionSteps": [
        "On a cutting board, peel the onions, and cut into ½-inch (1 ¼-cm) rings. Separate the rings.",
        "Sort the onion rings into four cones, starting with a big ring and going up to a small one.",
        "Place the flour, eggs, and panko in 3 separate medium bowls.",
        "Dip an onion ring into the flour, shaking off any excess. Dip it into the eggs, then the panko, then back into the eggs, and into the panko again.",
        "Place the onion ring on a greased, parchment-lined baking sheet. Repeat with remaining onion rings, creating four stacked cones on the tray. Freeze the onions ring cones for 1-3 hours.",
        "Preheat the oven to 400˚F (200˚C).",
        "In a medium bowl, mix the ground beef, onion, garlic, Parmesan, panko, parsley, Worcestershire, egg, salt, and pepper with your hands until fully combined.",
        "Take a baseball-size handful of the meat mixture and roll it into a ball. Transfer to a parchment-lined baking sheet. Repeat with the remaining meat mixture, creating four meatballs total.",
        "Bake for 18 minutes.",
        "Heat the oil in a large pot over medium heat until it reaches 350˚F (180˚C).",
        "Gently lower one frozen onion ring cone into the oil. Fry until golden brown all over, 2-4 minutes.",
        "Remove the cone with a slotted spoon and transfer to a wire rack set over paper towels to drain. Repeat with the remaining onion ring cones.",
        "Add 1 meatball to each onion ring cone. Top with marinara sauce, grated Parmesan cheese, and basil.",
        "Enjoy!"
    ]
}