{
    "id": "chicken-parmesan-stuffed-garlic-bread",
    "link": "https://tasty.co/recipe/chicken-parmesan-stuffed-garlic-bread",
    "name": "Chicken Parmesan-Stuffed Garlic Bread Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/d2051c6c7e714e3d8cd788b5f04f7a18/BFV10794_ChickenParmGarlicBread-ThumbA1080.jpg",
    "description": "Here's what you need: boneless, skinless chicken breast, flour, egg, seasoned breadcrumb, oil, large baguette, mozzarella cheese, marinara sauce, melted butter, garlic, fresh parsley, grated parmesan cheese",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 chicken breast, boneless &amp; skinless",
        "2 cups flour",
        "4 eggs, beaten",
        "2 cups seasoned breadcrumbs",
        "1 cup oil, for frying",
        "1 large baguette",
        "10–12 mozzarella slices",
        "marinara sauce",
        "⅓ cup melted butter",
        "3 cloves garlic, minced",
        "1 tablespoon parsley, chopped",
        "1 tablespoon Parmesan, grated"
    ],
    "recipeInstructionSteps": [
        "Slice the chicken breast into ½ inch (1 ¼ cm) thick strips.",
        "Place the flour, eggs, and bread crumbs into 3 separate bowls.",
        "Roll a chicken strip in the flour, dusting off excess. Dip the strip into the egg, then place into the bread crumbs, coating it completely.",
        "Repeat with the remaining chicken.",
        "Heat the oil in a pan over medium heat to 350˚F (180˚C) and preheat oven to 350°F (180˚C).",
        "Fry the breaded chicken strips until both sides are golden brown.",
        "Remove from heat and drain on a paper towel.",
        "Slice the baguette into thirds or fourths (each baguette piece should be roughly the same length of the fried chicken strips).",
        "Hollow out the insides of the baguette pieces with a knife.",
        "Lay two slices of mozzarella on top of each other with a 1 inch (2 ½ cm) overlap. Place a chicken strip on the overlapping region, then fold the mozzarella tightly around the chicken.",
        "Push the rolled chicken strips into a baguette piece.",
        "Slice the stuffed baguette pieces into 1 inch (2 ½ cm)  slices, then place them tightly side-by-side on a baking sheet lined with foil.",
        "In a small bowl, mix together ingredients for garlic butter.",
        "Brush the garlic butter evenly over the baguette slices, making sure some drips in between the slices.",
        "Wrap the foil over the re-assembled baguette and bake for 20–25 minutes, until cheese is melted and the top is starting to brown.",
        "Remove the foil and serve with marinara!",
        "Enjoy!"
    ]
}