{
    "id": "meatball-stuffed-garlic-bread",
    "link": "https://tasty.co/recipe/meatball-stuffed-garlic-bread",
    "name": "Meatball-stuffed Garlic Bread Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/c674c89ac9d740539f2beaa2c2a2bfbc/BFV15294_Meatball-Stuffed_Garlic_Bread_FB.jpg",
    "description": "Here's what you need: baguette, ground beef, bread crumbs, fresh parsley, salt, pepper, egg, mozzarella cheese, marinara sauce, butter, garlic, fresh parsley, grated parmesan cheese",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 baguette",
        "1 pound ground beef",
        "¼ cup bread crumbs",
        "2 tablespoons parsley, chopped",
        "½ tablespoon salt",
        "½ tablespoon pepper",
        "1 egg",
        "10-12 slices mozzarella cheese",
        "Marinara Sauce",
        "3 tablespoons melted butter",
        "3 cloves garlic, minced",
        "n/a",
        "2 tablespoons parmesan, grated"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350°F (180˚C).",
        "In a medium bowl, mix the ground beef, bread crumbs, parsley, egg, salt, and pepper.",
        "Pinch off a ball of the mixture, roll between your hands to make ping-pong ball-sized meatballs.",
        "Cook the meatballs over medium heat, turning to brown each side. Remove from heat and drain on a paper towel.",
        "Slice the baguette into thirds or fourths (each baguette piece should be roughly the same length of two meatballs).",
        "Hollow out the insides of the baguette pieces with a knife.",
        "Lay two slices of mozzarella on top of each other with a 1-inch (2 cm) overlap. Place two meatballs on the overlapping region, then fold the mozzarella tightly around the meatballs.",
        "Push the rolled meatballs and cheese into a baguette piece.",
        "Slice the stuffed baguette pieces into 1-inch (2 cm) slices, then place them tightly side-by-side on a baking sheet lined with foil.",
        "In a small bowl, mix together ingredients for garlic butter.",
        "Brush the garlic butter evenly over the baguette slices, making sure some drips in between the slices.",
        "Wrap the foil over the re-assembled baguette and bake for 15–20 minutes, until cheese is melted and the top is starting to brown.",
        "Remove the foil and serve with marinara.",
        "Enjoy!"
    ]
}