{
    "id": "cauliflower-meat-nachos",
    "link": "https://tasty.co/recipe/cauliflower-meat-nachos",
    "name": "Cauliflower “Meat” Nachos Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/7499327ae6cc4ebbbcf91f58ed3b80db/Tacos_V3_final.jpg",
    "description": "Here's what you need: cauliflower, mushroom, olive oil, medium yellow onion, garlic, ground cumin, smoked paprika, chili powder, soy sauce, salt, pepper, tortilla chips, cherry tomato, black olive, jalapeño slices, shredded cheese blend, fresh cilantro",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "",
    "recipeIngredient": [
        "1 medium head of cauliflower, washed",
        "5 ounces mushrooms, such as baby bella, cleaned and quartered",
        "1½ tablespoons olive oil",
        "1 medium yellow onion, minced",
        "2 cloves garlic, minced",
        "2 teaspoons ground cumin",
        "1½ teaspoons smoked paprika",
        "2 tablespoons chili powder",
        "2 tablespoons soy sauce",
        "Salt, to taste",
        "Pepper, to taste",
        "Tortilla chips",
        "Sliced cherry tomatoes",
        "Sliced black olives",
        "Jalapeño slices",
        "Shredded cheese blend",
        "Chopped fresh cilantro, for garnish"
    ],
    "recipeInstructionSteps": [
        "Cut the cauliflower in half and break it into small florets.",
        "Place the florets in a food processor and pulse until they break down to rice-size pieces. Remove from the processor and set aside.",
        "Add the mushrooms to the food processor and pulse until broken down to rice-size pieces.",
        "Heat the olive oil in a large skillet over medium heat. Add the onion and garlic to the pan and cook for about 4 minutes, until fragrant and the onion is translucent.",
        "Add the cauliflower, mushrooms, cumin, smoked paprika, chili powder, soy sauce, salt, and pepper and stir. Cook for about 10 minutes, until the cauliflower and mushroom mixture is tender and the water released from the mushrooms has evaporated.",
        "Preheat the oven to 350ºF (180ºC).",
        "Add the tortilla chips to an oven-proof dish.",
        "Load with the cauliflower “meat” and other toppings of your choice. Sprinkle with the shredded cheese.",
        "Bake for about 10 minutes, until the cheese has melted.",
        "Let cool for 5 minutes, then garnish with cilantro and serve.",
        "Enjoy!"
    ]
}