{
    "id": "eggplant-nachos",
    "link": "https://tasty.co/recipe/eggplant-nachos",
    "name": "Eggplant Nachos Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/79ee760eb4ce4384a511b029a74c2d1f/BFV36558EggplantNachos_FB_Final.jpg",
    "description": "Here's what you need: paprika, garlic powder, onion powder, cumin, dried oregano, cayenne pepper, salt, pepper, eggplant, olive oil, onion, red bell pepper, cooked chicken, lime, shredded monterey jack cheese, shredded cheddar cheese, guacamole, pickled jalapenos, fresh cilantro, salsa, cooking oil spray",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 tablespoon paprika",
        "1 tablespoon garlic powder",
        "1 teaspoon onion powder",
        "½ teaspoon cumin",
        "2 teaspoons dried oregano",
        "¼ teaspoon cayenne pepper",
        "1 teaspoon salt",
        "½ teaspoon pepper",
        "2 eggplants",
        "1 tablespoon olive oil",
        "1 onion, diced",
        "1 red bell pepper, diced",
        "2 cups cooked chicken, shredded",
        "Juice of ½ lime",
        "1 cup shredded Monterey Jack cheese",
        "1 cup shredded cheddar cheese",
        "1 cup guacamole, to serve",
        "Pickled jalapeños, to serve",
        "Cilantro, chopped, to serve",
        "Salsa, to serve",
        "Cooking oil spray"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 250˚F (120˚C).",
        "In a small bowl mix together the paprika, garlic powder, onion powder, cumin, oregano, cayenne pepper, salt, and pepper. Set aside.",
        "On a cutting board, take one of the eggplants and cut off one end.",
        "Thinly slice the eggplant into ¹⁄₁₆ of an inch (1 mm) slices. Repeat with the rest of the eggplant.",
        "Generously spray a sheet tray with cooking oil spray.",
        "Place the eggplant slices on the sheet tray. The slices will be touching but should not overlap. Lightly sprinkle each slice with the seasoning mix.",
        "Flip each eggplant slice. Spray the eggplant slices with more cooking oil spray. Lightly sprinkle the seasoning mixture over each eggplant slice.",
        "Bake for one hour, or until the chips are crisp.",
        "In a pan, heat the olive oil over medium heat. Once the oil is hot, add the onion and pepper, and stir until caramelized.",
        "Add the chicken and the rest of the spice mixture leftover from the chips and mix thoroughly.",
        "In a ovenproof dish or cast-iron skillet place, an ovenproof ramekin in the center. Remove eggplant chips from the sheet pan and place around the ramekin. Place chicken mixture on top of the chips. Sprinkle Monterey Jack cheese over the chicken. Sprinkle cheddar cheese over the Monterey Jack cheese. Broil on high for 5 minutes.",
        "Place dollops of guacamole over the nachos and top with pickled jalapeños. Pour salsa into the ramekin and sprinkle with cilantro. Serve immediately.",
        "Enjoy!"
    ]
}