{
    "id": "loaded-sweet-potato-nachos",
    "link": "https://tasty.co/recipe/loaded-sweet-potato-nachos",
    "name": "Loaded Sweet Potato Nachos Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/07c7c36227914eeb8d1dc732efee1593/BFV17577_LoadedSweetPotatoNachos-Thumb01.jpg",
    "description": "Here's what you need: sweet potato, olive oil, salt, pepper, paprika, garlic powder, skinless chicken breast, black beans, jalapeño pepper, low-fat cheese, avocado, pico de gallo, green onion",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Mexican",
    "recipeIngredient": [
        "2 small sweet potatoes",
        "1 tablespoon olive oil",
        "¼ teaspoon salt",
        "¼ teaspoon pepper",
        "1 teaspoon paprika",
        "1 teaspoon garlic powder",
        "1 skinless chicken breast",
        "2 cups black beans",
        "1 jalapeño (optional)",
        "½ cup low fat cheese",
        "½ avocado",
        "Pico de gallo (optional)",
        "Green onion, for garnish"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 400˚F (200˚C).",
        "Evenly slice sweet potatoes into rounds.",
        "In a medium-sized bowl, toss rounds with 1 tablespoon of olive oil, garlic powder, paprika, salt, and pepper until well-coated.",
        "Lay rounds flat on a parchment-lined baking sheet and set aside.",
        "On a second parchment-lined baking sheet, season chicken breast with olive oil, salt, and pepper, to taste. Wrap the parchment around the chicken, folding at the edges.",
        "Bake the sweet potatoes and the chicken in the oven for 20 minutes or until the chicken is cooked through and juices run clear.",
        "Allow both to cool. Then, shred the chicken using two forks.",
        "Line the bottom of a medium-sized skillet with the sweet potato rounds. Top with shredded chicken, black beans, jalapeño if desired, and cheese. Broil for 5-10 minutes or until toppings are heated through and cheese is melted.",
        "Garnish with avocado, pico de gallo, and green onion, if desired. Serve immediately.",
        "Enjoy!"
    ]
}