{
    "id": "steak-and-potato-taco-nachos",
    "link": "https://tasty.co/recipe/steak-and-potato-taco-nachos",
    "name": "Steak And Potato Taco Nachos Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/162033.jpg",
    "description": "Here's what you need: salt, pepper, onion powder, paprika, garlic powder, chili powder, cumin, medium russet potato, skirt steak, canola oil, shredded cheese blend, pico de gallo, guacamole, fresh chives, sour cream",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "3 teaspoon salt, divided",
        "2 teaspoons pepper",
        "1 teaspoon onion powder",
        "1 teaspoon paprika",
        "1 teaspoon garlic powder",
        "1 teaspoon chili powder",
        "1 teaspoon cumin",
        "3 medium russet potatoes, scrubbed",
        "1 pound skirt steak",
        "1 tablespoon canola oil",
        "1 cup shredded cheese blend",
        "Pico de gallo, for serving",
        "Guacamole, for serving",
        "1 tablespoon chives, finely chopped",
        "Sour cream, for serving"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 300˚F (150˚C).",
        "In a small bowl, combine 1 teaspoon of salt, the pepper, onion powder, paprika, garlic powder, chili powder, and cumin.",
        "Slice the potatoes on a mandolin or with a sharp knife into ¹⁄₁₆-inch (1 mm) thick slices.",
        "Transfer the potato slices to a large bowl and cover with water. Toss the potato slices around to remove excess starch, then drain the water.",
        "Sprinkle the remaining 2 teaspoons of salt onto the potato slices and toss, then drain any excess water.",
        "Sprinkle half the spice mixture over the potatoes and toss until well-coated.",
        "Invert a muffin tin and place the potato slices in between the muffin tin walls to create taco shapes. If you have one, use a second muffin tin for the remaining potato slices, or repeat when finished baking the first batch.",
        "Bake the potato slices for 25 minutes, or until golden brown.",
        "Season the skirt steak with the remaining spice mix on both sides.",
        "Heat the oil in a large cast-iron skillet over high heat. Add the skirt steak and cook for 3 minutes on each side until it is seared with a golden brown crust.",
        "Remove the steak from the pan and let rest on a cutting board for 10 minutes. Once rested, cut the steak into ½-inch (1 cm) cubes.",
        "Sprinkle the cheese blend and steak into the potato taco shells.",
        "Bake for another 5 minutes or until cheese is melted.",
        "Serve with pico de gallo, guacamole, and sour cream.",
        "Garnish with chopped chives, if desired.",
        "Enjoy!"
    ]
}