{
    "id": "lasagna-dome",
    "link": "https://tasty.co/recipe/lasagna-dome",
    "name": "Lasagna Dome Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/160586.jpg",
    "description": "Here's what you need: olive oil, medium yellow onion, garlic, ground beef, salt, black pepper, tomato sauce, tomato paste, ricotta cheese, fresh basil, large egg, parmesan cheese, lasagna noodle, shredded mozzarella cheese, unsalted butter, all-purpose flour, milk, salt, freshly ground black pepper, shredded parmesan cheese, fresh basil, shredded parmesan cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "3 tablespoons olive oil, divided",
        "½ medium yellow onion, diced",
        "4 cloves garlic, minced",
        "1 pound ground beef",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "15 ounces tomato sauce",
        "3 ounces tomato paste",
        "15 ounces (425 grams) ricotta cheese",
        "½ cup chopped fresh basil",
        "1 large egg",
        "½ cup shredded Parmesan cheese",
        "30 lasagna noodles, boiled until al dente,",
        "2 cups shredded mozzarella cheese",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "1½ cups milk, hot",
        "Salt, to taste",
        "Freshly ground pepper, to taste",
        "¼ cup shredded Parmesan cheese",
        "Chopped basil, for garnish",
        "Shredded Parmesan cheese, for garnish"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 375°F (190°C).",
        "Heat 2 tablespoons of olive oil in a large pot over high heat. Add the onion and garlic. Cook until starting to brown, stirring occasionally, 3-4 minutes.",
        "Add the beef, salt, and pepper. Cook until all of the moisture has evaporated and the meat is starting to brown on the edges, breaking the meat up as you stir, 10-12 minutes.",
        "Add the tomato sauce and tomato paste, then reduce the heat to medium and bring the sauce to a simmer. Cook it down until the mixture becomes thick, about 15 minutes. Remove the pot from the heat and set aside.",
        "In a small bowl, combine the ricotta, basil, egg, and Parmesan. Stir until smooth. Set aside.",
        "Grease a large oven-safe metal bowl with the remaining tablespoon of olive oil, then lay about 25 lasagna noodles along the sides and bottom of the bowl, fanning them out in an overlapping pattern. The ends of the noodles should hang over the sides of the bowl.",
        "Slice the remaining lasagna noodles in half crosswise. These will serve as the layers between the meat and the cheese mixtures.",
        "Sprinkle half of the mozzarella into the bottom of the bowl on top of the noodles. This will help bind the noodles together when cooked. Spread half of the meat mixture evenly over the mozzarella, then lay half of the cut noodles over the sauce. ",
        "Spread all of the ricotta mixture over the noodles, then layer with the rest of the noodles, then the rest of the mozzarella, and the rest of the meat sauce.",
        "Fold the edges of the lasagna noodles hanging over the sides of the bowl back towards the center, creating another overlapping pattern.",
        "Cover with foil and bake for about 45 minutes, until cooked through.",
        "Meanwhile, make the béchamel: In a saucepan over medium heat, melt the butter. Add the flour and cook, whisking continuously, for about 2 minutes until a paste forms.",
        "Add the hot milk and continue to whisk as the sauce thickens and comes to a boil. Season with salt and pepper and add the Parmesan. Reduce the heat to low, and cook, still whisking, for 2-3 minutes more.",
        "Invert the lasagna dome onto a cutting board.",
        "Pour the béchamel sauce over the dome and top with basil.",
        "Slice the dome, then top with more Parmesan and basil, if desired.",
        "Enjoy!"
    ]
}