{
    "id": "classic-canadian-poutine",
    "link": "https://tasty.co/recipe/classic-canadian-poutine",
    "name": "Mixed Gravy Poutine Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/165828.jpg",
    "description": "Here's what you need: large russet potato, olive oil, salt, pepper, unsalted butter, all-purpose flour, beef stock, worcestershire sauce, cornstarch, water, cheese curd",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "",
    "recipeIngredient": [
        "3 large russet potatoes, scrubbed",
        "3 tablespoons olive oil",
        "1½ teaspoon salt, divided",
        "1 teaspoon pepper, divided",
        "6 tablespoons (¾ stick) unsalted butter",
        "¼ cup all-purpose flour",
        "2 ½ cups beef stock",
        "2 teaspoons Worcestershire sauce",
        "3 tablespoons cornstarch",
        "2 tablespoons water",
        "1½ cups cheese curds"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 450˚F (230˚C). Line 2 baking sheets with parchment paper.",
        "On a cutting board, slice the potatoes into matchsticks by quartering lengthwise. Cut the quarters lengthwise into ¼-inch slices, then cut into ¼-inch (6 mm) matchsticks.",
        "Place the potatoes in a large bowl. Drizzle with the olive oil and sprinkle with 1 teaspoon of salt and ½ teaspoon of pepper. Toss to coat.",
        "Arrange the fries evenly in 2 rows on each baking sheet so they are not touching.",
        "Bake for 25 minutes, flipping halfway through, until golden brown.",
        "In a medium saucepan over medium heat, add the butter and flour. Whisk until the mixture is a golden brown. Add the beef stock, Worcestershire, remaining ½ teaspoon of salt and remaining ½ teaspoon of pepper. Bring to a boil, whisking continuously.",
        "Add the water to the cornstarch in a small bowl and mix until dissolved. Add the cornstarch slurry to the gravy and stir until thickened. Remove from the heat and cover to keep the gravy hot.",
        "Transfer the baked fries to a large bowl, add the cheese curds, and pour the hot gravy over the top. Toss to coat.",
        "Transfer to a dish and serve immediately.",
        "Enjoy!"
    ]
}