{
    "id": "steak-and-ale-samosas",
    "link": "https://tasty.co/recipe/steak-and-ale-samosas",
    "name": "Steak And Ale Samosas Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/a994b3447c7c4f35b3a90735f942be36/BFV4704_SteakAndAleSamosas-FB_thumbnail.jpg",
    "description": "Here's what you need: braising steak, flour, large carrot, medium onion, ale, stock, fresh thyme, frozen peas, greek yogurt, fresh mint, lemon wedge, salt, flour, vegetable oil, fresh rosemary, salt, water, vegetable oil",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "500 grams braising steak.",
        "100 grams flour.",
        "1 large carrot.",
        "1 medium onion.",
        "Half a pint of Ale",
        "100 milliliters stock",
        "2 springs of thyme",
        "150 grams frozen peas",
        "100 milliliters greek yogurt",
        "33 grams of mint",
        "1 wedge of lemon",
        "1 pinch of salt",
        "120 grams of flour",
        "1 tablespoon vegetable oil",
        "2 teaspoon minced rosemary",
        "1 teaspoon of salt",
        "40 milliliters of water",
        "50 milliliters of vegetable oil"
    ],
    "recipeInstructionSteps": [
        "Cut steak into 8 mm (¼ inch) cubes.",
        "Toss with flour to coat evenly.",
        "In a large stock pot or dutch oven, sear steak pieces in batches.",
        "Remove all steak and sauté 1 large carrot and 1 medium onion, diced, until translucent. Add steak back to the pot with carrots and onions.",
        "Pour over 240 ml (½ pint) of ale and 100 ml (½ cup) of stock.",
        "Add 2 sprigs of thyme. Simmer for 1-2 hours, the longer the better.",
        "For the Samosa dough, combine flour, 1 tbsp vegetable oil, 2 tsp minced rosemary, and 1 tsp salt.",
        "Add water, a splash at a time, working the flour into a dough. You’ll end up using approximately 40 ml (3 tbsp). Let dough rest 30 minutes before using.",
        "For Minted Mushy Peas, in a food processor, whizz up frozen peas, greek yogurt, a bunch of mint, a squirt of lemon, and a pinch of salt.",
        "To form the Samosa, split the dough in half and then in half again. Take one of these quarters and roll it into a flat circle, about 2 mm (⅛ inch) thick. Cut this dough in half with a knife.",
        "Pick up 1 semi-circle, and wipe the flat edge with a wet finger. Fold this flat edge together to form a cone, pinch together the overlapping dough. Holding in one hand like a cone, fill 80% full with cooled samosa filling. Wipe the rim of the cone with a wet finger and pull together, pinching to seal.",
        "Shallow fry in approximately 3 cm (1 inch)  of vegetable oil.",
        "Serve with Minted Mushy Peas.",
        "Enjoy!"
    ]
}