{
    "id": "carrot-dogs-4-ways",
    "link": "https://tasty.co/recipe/carrot-dogs-4-ways",
    "name": "Carrot Dogs 4 Ways Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/167165.jpg",
    "description": "Here's what you need: vegetable broth, apple cider vinegar, soy sauce, maple syrup, liquid smoke, mustard powder, paprika, ground coriander, garlic powder, ground black pepper, carrot, olive oil, hot dog bun, relish, yellow mustard, ketchup, red onion, vegetarian chili, shredded cheddar cheese, fresh cilantro, caramelized onions, green pepper, fresh parsley, black beans, corn, salsa, fresh cilantro",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 cup vegetable broth",
        "¼ cup apple cider vinegar",
        "2 tablespoons soy sauce",
        "1 teaspoon maple syrup",
        "½ teaspoon liquid smoke",
        "2 teaspoons mustard powder",
        "1 tablespoon paprika",
        "½ teaspoon ground coriander",
        "½ teaspoon garlic powder",
        "1 teaspoon ground black pepper",
        "6 carrots, washed and peeled (and boiled, if grilling)",
        "1 tablespoon olive oil, for grilling",
        "6 hot dog buns",
        "Relish",
        "Yellow mustard",
        "Ketchup",
        "Chopped red onion",
        "Vegetarian chili",
        "Shredded cheddar cheese",
        "Chopped fresh cilantro",
        "Caramelized onions and green peppers",
        "n/a",
        "Chopped fresh parsley",
        "Black beans",
        "Corn",
        "Salsa",
        "Chopped fresh cilantro"
    ],
    "recipeInstructionSteps": [
        "In a medium bowl, combine the vegetable broth, apple cider, soy sauce, maple syrup, liquid smoke, mustard powder, paprika, ground coriander, garlic powder, and pepper.",
        "Place the carrots into a baking dish and pour the marinade on top. Let marinate for at least 30 minutes.",
        "Preheat the oven to 425°F (220˚C).",
        "If baking, cover the baking dish with aluminum foil and bake for about 40 minutes. Remove the foil and bake for another 25 minutes, until the carrots are just tender enough to be poked with a knife.",
        "If grilling, heat the olive oil on a grill pan on high heat. Add the marinated carrots to the pan and spoon a bit of the marinade over. Cook for about 2 minutes on each side, until slightly charred.",
        "Place the carrots in buns and add your desired toppings.",
        "Enjoy!"
    ]
}