{
    "id": "cheesy-jalapeno-corn-dogs",
    "link": "https://tasty.co/recipe/cheesy-jalapeno-corn-dogs",
    "name": "Cheesy Jalapeño Corn Dogs Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/381777cc1cf44c03ac298d7411d39b0c/corn_dog_fb_thumb.jpg",
    "description": "Here's what you need: hot dog, thin slices of cheddar cheese, all-purpose flour, yellow cornmeal, sugar, baking powder, salt, black pepper, milk, egg, jalapeño, peanut or vegetable oil, mustard, wooden skewers",
    "recipeCategory": "Dinner",
    "recipeCuisine": "BBQ",
    "recipeIngredient": [
        "4 hot dogs",
        "4 thinly sliced cheddar cheese, room temperature",
        "1 cup flour",
        "1 cup yellow cornmeal",
        "¼ cup sugar",
        "4 teaspoons baking powder",
        "¼ teaspoon salt",
        "⅛ teaspoon black pepper",
        "1 cup milk",
        "1 egg",
        "1 Jalapeño, minced",
        "1 quart vegetable oil for frying",
        "n/a",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "Place a hot dog on a slice of cheese, then roll the cheese slice around it. Push a wooden skewer through the cheese-wrapped hot dog, then place seam side down on a baking sheet. Repeat with the remaining hot dogs. Freeze for 20 minutes.",
        "In a large bowl, add the dry ingredients and stir to combine. Once fully combined, mix in the milk, egg, and jalapeño. Stir until the batter is smooth and without lumps. You may need to add 1 or 2 tablespoon of flour; the batter should be thick enough to cling to the hot dog. Pour it into a tall glass for easier dipping.",
        "Heat the oil in a large pot until it reaches 350°F (180°C).",
        "Holding the tip of the skewer, take a frozen hot dog and dip it fully into the batter, lifting it out, then rotating it to let excess batter drip off. Using tongs, carefully place the battered dog into the hot oil. Hold it fully submerged for 30-60 seconds until a crust forms, then rotate it so that it fries evenly. Cook for 3-5 minutes, or until golden brown. Repeat with the remaining hot dogs. Serve with mustard for dipping.",
        "Enjoy!"
    ]
}