{
    "id": "grilled-swineapple-dogs",
    "link": "https://tasty.co/recipe/grilled-swineapple-dogs",
    "name": "Grilled Swineapple Dogs Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/10625dcbc0f24874a9bdcfb0356463cd/BF_THUMB_1.jpg",
    "description": "Here's what you need: paprika, black pepper, kosher salt, chili powder, garlic powder, onion powder, pineapple, bacon, pork hot dog, hot dog bun, BBQ sauce, red onion, jalapeño",
    "recipeCategory": "Lunch",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "2 teaspoons paprika",
        "½ teaspoon black pepper",
        "½ teaspoon salt",
        "1 teaspoon chili powder",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "½ pineapple, cut into 12 thin spears",
        "24 slices of bacon",
        "12 pork hot dogs",
        "12 hot buns",
        "Barbecue sauce",
        "Red onion, minced",
        "Jalapeño, minced"
    ],
    "recipeInstructionSteps": [
        "Preheat a grill or grill plate to medium-low heat.",
        "Sprinkle the paprika, garlic powder, chili powder, onion powder black pepper, and salt over the pineapple spears in a bowl. Mix until they are completely coated.",
        "Lay a slice of bacon at a slight diagonal angle on your work surface. Lay a second slice above it making sure they slightly overlapped in the middle.",
        "Place one hot dog and one thin pineapple spear near the bottom part of the first slice of bacon. Tuck the end of the bacon around the hot dog and pineapple and roll across the counter until they are completely encased. Use toothpicks if needed to get a tight seal.",
        "Place the hot dogs on the grill and cook gently until the bacon is crispy and the pineapple and hot dog are heated through, about 40 minutes. Flip halfway through.",
        "Place into hot dog buns, top with barbecue sauce, minced red onion, and minced jalapeño (optional).",
        "Enjoy!"
    ]
}