{
    "id": "pretzel-dogs",
    "link": "https://tasty.co/recipe/pretzel-dogs",
    "name": "Pretzel Dogs Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/87d02cb1ff814628aa195aef11528e0f/BFV22297_Pretzel_Dogs_Four_Ways_FB_1080x1080.jpg",
    "description": "Here's what you need: flour, pizza dough, hot dog, water, baking soda, egg yolk, coarse sea salt, shredded cheddar cheese, jalapeño, butter, garlic, fresh parsley, shredded mozzarella cheese, pepperoni",
    "recipeCategory": "Snacks",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "Flour",
        "12 ounces pizza dough",
        "4 hot dogs",
        "5 cups water",
        "¼ cup baking soda",
        "1 egg yolk, beaten",
        "Coarse sea salt",
        "Cheddar cheese, shredded",
        "Jalapeños, sliced into rings and seeds taken out",
        "2 tablespoons butter, melted",
        "2 cloves of garlic, minced",
        "1 tablespoon parsley, chopped",
        "Mozzarella, shredded",
        "Pepperoni"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 450˚F (230˚C).",
        "Dust the cutting board with flour, and cut the pizza dough into 4 equal pieces.",
        "Roll each piece of dough out until it’s a 12-inch (30 cm) rope. It’s okay if the dough naturally shrinks.",
        "Take the rolled out dough and wrap it around a hot dog in a spiraling motion, leaving room on the ends.",
        "In a pot, combine the baking soda with the water and bring it to a boil.",
        "Cook each pretzel dog in the solution for 30 seconds each. Remove with a slotted spoon and transfer to a baking tray.",
        "Brush each pretzel dog with the egg wash.",
        "Top the pretzels with your toppings of choice.",
        "For sea salt, sprinkle the salt on top. For jalapeño cheddar, top the pretzel with cheddar cheese, then follow with jalapeños. For garlic butter, combine the butter, garlic, and parsley, and brush on top. For pizza, top with mozzarella and follow with pepperoni.",
        "Bake in the oven for 12-15 minutes, or until it reaches a deep golden brown.",
        "Enjoy!"
    ]
}