{
    "id": "blooming-quesadilla-ring",
    "link": "https://tasty.co/recipe/blooming-quesadilla-ring",
    "name": "Blooming Quesadilla Ring Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/2a14ce8335cf4117afd207b394efcc7f/1506556254_00001.jpg",
    "description": "Here's what you need: cooked and shredded chicken, onion, red bell pepper, jalapeño, taco sauce, taco-size tortilla, shredded cheddar cheese, shredded monterey jack cheese",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "2 cups cooked chicken, shredded",
        "1 onion, chopped",
        "1 red bell pepper, chopped",
        "1 jalapeño, chopped",
        "1 cup taco sauce",
        "20 taco-size tortillas",
        "3 cups shredded cheddar cheese",
        "3 cups shredded Monterey Jack"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 375˚F (190˚C). Line a baking sheet with parchment paper.",
        "In a large bowl, add the chicken, onion, red bell pepper, jalapeño, and taco sauce, and mix to combine. Set aside.",
        "Cut each tortilla in half. Evenly add about 2 tablespoons each of the cheddar cheese, Monterey Jack cheese, and chicken mixture to each tortilla half. Roll the tortillas into cones, starting fro the cut edge and making sure not to push the ingredients out of the tortilla.",
        "Place a wide mouth jar or glass in the center of the baking sheet.",
        "Create a ring around the jar with about 13 tortilla cones. The points of the cones should be in the center, touching the jar. Sprinkle cheddar and Monterey Jack cheese over the layer. Repeat with the remaining cones to make 2 more layers, finishing with the rest of the cheddar and Monterey Jack. Remove the jar from the center of the ring.",
        "Bake until the cheese is melted and the edges of the tortillas are crispy, 15-20 minutes.",
        "Carefully transfer the blooming quesadilla to a serving platter. Place your dip of choice inside the ring and top with your desired garnishes. Serve immediately.",
        "Enjoy!"
    ]
}