{
    "id": "egg-shaped-sugar-cookies",
    "link": "https://tasty.co/recipe/egg-shaped-sugar-cookies",
    "name": "Egg Shaped Sugar Cookies Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/146687.jpg",
    "description": "Here's what you need: all-purpose flour, baking soda, cream of tartar, fine sea salt, unsalted butter, powdered sugar, large egg, lemon, pure vanilla extract, large pasteurized egg white, powdered sugar, fresh lemon juice, food coloring",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "",
    "recipeIngredient": [
        "2½ cups all-purpose flour, plus more for rolling",
        "1 teaspoon baking soda",
        "1 teaspoon cream of tartar",
        "½ teaspoon fine sea salt",
        "1 cup (2 sticks) unsalted butter, at room temperature",
        "1½ cups powdered sugar",
        "1 large egg",
        "Zest of ½ lemon",
        "2 teaspoons pure vanilla extract",
        "4 large pasteurized egg whites",
        "4 cups powdered sugar, sifted",
        "1 teaspoon fresh lemon juice",
        "Food coloring of choice"
    ],
    "recipeInstructionSteps": [
        "Make the cookies: in a medium bowl, whisk together the flour, baking soda, cream of tartar, and salt.",
        "In another large bowl, beat the butter and sugar with a hand mixer on medium-high until light in color and fluffy in texture, 3-5 minutes.",
        "Add the egg and mix until incorporated.",
        "Mix in the lemon zest and vanilla, then add the flour mixture and mix with a spatula until just combined.",
        "Transfer the cookie dough to a clean work surface and divide into two balls. Flatten each into a 5-inch (12-cm) disc, wrap in plastic wrap, and refrigerate for at least 2 hours, up to 3 days.",
        "Preheat the oven to 350°F (180°C). Line two baking sheets with parchment paper.",
        "On a lightly floured surface, roll out one of the dough discs into a ¼-inch (6 mm) thick circle.",
        "Use egg-shaped cookie cutters to cut out shapes and transfer to the prepared baking sheets.",
        "Bake until the cookies are golden around the edges, 6-8 minutes depending on the size.",
        "Cool for 1 minute on the baking sheets, then transfer to a wire rack to cool completely before decorating. Repeat with the other dough disc.",
        "Make the icing: in a large bowl, beat the egg whites on high speed with a hand mixer until foamy. Reduce the speed to low and gradually add the sugar, beating until completely incorporated. Add the lemon juice and return the speed to high, beating until the icing is very stiff, 5-7 minutes.",
        "Divide the icing between four bowls and color three with food coloring of choice.",
        "Transfer the icings to piping bags or plastic bags fitted with round tips and decorate the cooled cookies.",
        "Enjoy!"
    ]
}