{
    "id": "fruit-spring-rolls-with-strawberry-lemonade-dip",
    "link": "https://tasty.co/recipe/fruit-spring-rolls-with-strawberry-lemonade-dip",
    "name": "Fruit Spring Rolls With Strawberry Lemonade Dip Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/bec34330f2324d4982fe9226b7a93d4f/BFV22990_SweetandSavorySpringRolls_FB.jpg",
    "description": "Here's what you need: warm water, rice paper wrapper, kiwi, strawberry, mango, raspberry, green apple, vanilla greek yogurt, strawberry, fresh mint leaf, honey, lemon juice, lemon zest",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "",
    "recipeIngredient": [
        "Warm water",
        "8 rice paper wrappers",
        "1 kiwi, sliced",
        "¼ cup sliced strawberries",
        "½ mango, sliced",
        "¼ cup raspberries",
        "½ green apple, sliced",
        "½ cup vanilla Greek yogurt",
        "½ cup sliced strawberries",
        "3 sprigs fresh mint leaves",
        "1 tablespoon honey",
        "1 tablespoon lemon juice",
        "¼ tablespoon lemon zest, plus more for garnish"
    ],
    "recipeInstructionSteps": [
        "Make the Strawberry Lemonade Dip: Add the Greek yogurt, strawberries, mint, honey, lemon juice, and lemon zest to a blender. Blend until smooth.",
        "Transfer the dip to a small bowl and garnish with more lemon zest. Chill in the fridge while you assemble the rolls.",
        "Fill a medium shallow bowl with warm water and set near your work station.",
        "Dip a rice paper wrapper in the warm water for a few seconds, submerging completely. Remove and lay flat on a smooth, clean surface, such as a plate.",
        "Add your desired combination of sliced kiwi, sliced strawberries, sliced mango, raspberries, and sliced green apple to the middle of the wrapper. Be careful not to overfill, or rolling it will become difficult.",
        "Working quickly, before the rice paper dries out, fold both sides of the rice paper over the fruit to secure.",
        "Lift the bottom edge of the rice paper and carefully fold it over the top of the fruit, tucking it under on the other side, then gently roll until the fruit is completely covered and the top edge of the wrapper adheres to the spring roll.",
        "Set the spring roll aside and cover with a damp paper towel to keep fresh while you repeat with the remaining ingredients.",
        "Serve with the chilled dip.",
        "Enjoy!"
    ]
}