{
    "id": "no-bake-spring-berry-pie",
    "link": "https://tasty.co/recipe/no-bake-spring-berry-pie",
    "name": "No-Bake Spring Berry Pie Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/1665d05e7a924ed8bc279378674ce28c/FB_1.jpg",
    "description": "Here's what you need: graham cracker, melted butter, cream cheese, maple syrup, blueberry, strawberry, water, lemon juice, sugar, cornstarch",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "10 graham crackers",
        "½ cup butter, melted",
        "8 ounces cream cheese, softened",
        "¼ cup maple syrup",
        "1 cup blueberries",
        "1 cup strawberries, sliced",
        "4 tablespoons water",
        "2 tablespoons lemon juice, about half a lemon",
        "¼ cup sugar",
        "2 tablespoons cornstarch"
    ],
    "recipeInstructionSteps": [
        "Place graham crackers in a plastic bag and crush them into fine crumbs using a rolling pin. Alternatively, a food processor can be used to crush the crackers.",
        "Pour the graham cracker crumbs into a medium bowl with the melted butter. Mix until the crumbs take on the character of a coarse, wet sand.",
        "Pour the crumbs into a 9-inch (23 cm) pie dish. Press the crumbs firmly into the dish, making sure to coat the bottom and sides of the dish evenly. Once the crust has been formed, place the pie dish into the refrigerator to firm up.",
        "In a medium-sized bowl, whisk together cream cheese and maple syrup. Once combined, pour the mixture into pie crust and return it to refrigerator to chill.",
        "Meanwhile, add half of the blueberries and strawberries to a saucepan over medium heat. Then add the lemon juice, sugar, and half of the water.",
        "Cook for 2-4 minutes or until sugar is dissolved and berries begin to expel their juice, creating a loose, deep-red mixture.",
        "In a small bowl or ramekin, mix cornstarch and remaining water into a smooth paste.",
        "Add the cornstarch mixture to the berries and cook for an additional 2 minutes, until the filling thickens. Remove from heat and set aside, allowing the mixture to cool for 5 minutes.",
        "Remove the chilled pie crust with the cream cheese layer from the refrigerator. Take the remaining blueberries and strawberries and evenly distribute them over the top of the cream cheese layer.",
        "Next, pour the cooked berry mixture over the top of the fresh fruit and cream cheese, filling in the rest of the pie crust. Spread the filling evenly.",
        "Chill the pie completely in the refrigerator for 1.5-2 hours before serving.",
        "Enjoy!"
    ]
}