{
    "id": "veggie-spring-rolls-with-peanut-sauce",
    "link": "https://tasty.co/recipe/veggie-spring-rolls-with-peanut-sauce",
    "name": "Veggie Spring Rolls With Peanut Sauce Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/680d7096f50c415ebd908c302f428e5d/BFV22990_SweetandSavorySpringRolls_FB.jpg",
    "description": "Here's what you need: warm water, rice paper wrapper, white mushroom, medium carrot, english cucumber, red cabbage, yellow bell pepper, natural peanut butter, ginger, sesame oil, rice wine vinegar, soy sauce, maple syrup, red pepper flakes",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "",
    "recipeIngredient": [
        "Warm water",
        "8 rice paper wrappers",
        "1 cup sliced white mushrooms",
        "2 medium carrots, sliced",
        "½ English cucumber, sliced",
        "1 cup sliced red cabbage",
        "½ yellow bell pepper, sliced",
        "¼ cup natural peanut butter",
        "½ teaspoon minced ginger, optional",
        "2 tablespoons sesame oil",
        "2 tablespoons rice wine vinegar",
        "1 tablespoon soy sauce",
        "2 teaspoons maple syrup",
        "Pinch of red pepper flakes"
    ],
    "recipeInstructionSteps": [
        "Fill a medium shallow bowl with warm water and set near your work station.",
        "Dip a rice paper wrapper in the warm water for a few seconds, submerging completely. Remove and lay flat on a smooth, clean surface, such as a plate.",
        "Add your desired combination of sliced mushrooms, sliced carrots, sliced cucumber, sliced cabbage, and sliced bell pepper to the middle of the wrapper. Be careful not to overfill, or rolling it will become difficult.",
        "Working quickly, before the rice paper dries out, fold both sides of the rice paper over the vegetables to secure.",
        "Lift the bottom edge of the rice paper and carefully fold it over the top of the vegetables, tucking it under on the other side, then gently roll until the vegetables are completely covered and the top edge of the wrapper adheres to the spring roll.",
        "Set the spring roll aside and cover with a damp paper towel to keep fresh while you repeat with the remaining ingredients. Once you’ve finished making the spring rolls, chill in the fridge while you make the sauce.",
        "Make the Peanut Sauce: Add the peanut butter, ginger (if using), sesame oil, rice wine vinegar, soy sauce, and maple syrup to a small bowl. Whisk until combined.",
        "Transfer the sauce to a small serving bowl and sprinkle with red pepper flakes.",
        "Serve the chilled spring rolls with the sauce.",
        "Enjoy!"
    ]
}