{
    "id": "triple-decker-cheesecake-tower",
    "link": "https://tasty.co/recipe/triple-decker-cheesecake-tower",
    "name": "Triple-Decker Cheesecake Tower Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/177278.jpg",
    "description": "Here's what you need: brownie mix, chocolate cheesecake, red velvet cake mix, vanilla cheesecake, chocolate chip cookie dough, cream cheese icing, chocolate ganache, chocolate, springform pan",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "2 18-ounce boxes of brownie mix, prepared according to package instructions",
        "1 8-inch chocolate cheesecake, prepared",
        "1½ 15-ounce boxes of red velvet cake mix, prepared according to package instructions without the water",
        "2 8-inch vanilla cheesecakes, prepared",
        "40 ounces chocolate chip cookie dough",
        "8 cups cream cheese icing",
        "2 cups chocolate ganache",
        "10 ounces chocolate, chopped",
        "3 9-inch springform pans"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 300°F (150°C).",
        "In a greased, 9-inch (23 cm) springform pan, spread ⅓ of the brownie batter evenly on the bottom. Lay the chocolate cheesecake in the center, then spread the rest of the batter on top. Set aside.",
        "In another greased springform pan, spread ⅓ of the cake batter evenly on the bottom, then lay the vanilla cheesecake on top. Spread the rest of the red velvet batter over the cheesecake and set aside.",
        "In a third springform pan, press ⅓ of the cookie dough evenly on the bottom, then another ⅓ of the dough around the sides of the pan to make a wall. Lay the remaining vanilla cheesecake in the center, then cover with the rest of the cookie dough and seal the edges.",
        "Bake all 3 filled cakes for 2 hours, until a toothpick inserted in the center of each comes out clean.",
        "Chill the cakes overnight in the refrigerator.",
        "Dollop a bit of of cream cheese frosting onto a serving platter and line the sides with parchment paper.",
        "Add the cookie cake to the platter and spread the top with layer of frosting.",
        "Stack the brownie cake on top, then spread another layer of frosting on top.",
        "Finally, place the red velvet cake on top, then frost the top and sides evenly.",
        "Add the chocolate ganache to a squeeze bottle, then decorate the top of the cake working your way around the top edge of the cake to make a drip pattern. Squeeze more ganache over the top of the cake and spread evenly to cover.",
        "Decorate the lower part of the cake by pressing the chocolate chunks into the sides.",
        "Slice and serve.",
        "Enjoy!"
    ]
}