{
    "id": "loaded-chicken-fajita-nachos",
    "link": "https://tasty.co/recipe/loaded-chicken-fajita-nachos",
    "name": "Loaded Chicken Fajita Nachos Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/07db163798b847549edfd7f99916effd/BFV21074_Chicken_Fajita_Nachos_FB1080SQ.jpg",
    "description": "Here's what you need: boneless, skinless chicken breast, salt, pepper, chili powder, garlic powder, cumin, vegetable oil, onion, garlic, bell pepper, lime, tortilla chips, pepper jack cheese, shredded sharp cheddar cheese, sour cream, salsa, guacamole",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Mexican",
    "recipeIngredient": [
        "3 boneless, skinless chicken breasts, cubed",
        "2 teaspoons salt",
        "1 teaspoon pepper",
        "2 teaspoons chili powder",
        "2 teaspoons garlic powder",
        "2 teaspoons cumin",
        "3 tablespoons vegetable oil",
        "1 onion, halved and sliced",
        "4 cloves garlic, sliced",
        "3 bell peppers, seeds removed, sliced lengthwise",
        "Juice of 1 lime",
        "1 13 ounce bag of tortilla chips",
        "2 cups shredded pepper Jack cheese",
        "1 cup shredded sharp cheddar cheese",
        "Sour cream",
        "Salsa",
        "Guacamole"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350˚F (180˚C).",
        "Add the chicken breast to a bowl and season with salt, chili powder, garlic powder, and cumin.",
        "In a large skillet, heat 2 tablespoons vegetable oil and cook chicken until slightly charred and no longer pink. Cook chicken in batches to avoid overcrowding the pan. Remove cooked chicken from the skillet, and transfer into a bowl.",
        "Heat another tablespoon of oil, add the onions and cook for a couple minutes until onions are slightly translucent.",
        "Add the garlic and peppers and cook slightly, then remove from heat. Transfer garlic and peppers to the chicken bowl, then top with lime juice.",
        "Lay down half the tortilla chips on the skillet, followed by half the fajita mixture, and top with pepper Jack and cheddar cheese. Repeat with the remaining ingredients.",
        "Bake until the cheese has melted, about 15 minutes.",
        "Add your choice of topping (optional).",
        "Enjoy!"
    ]
}