{
    "id": "cornbread-crab-cakes-as-made-by-lawrence-page",
    "link": "https://tasty.co/recipe/cornbread-crab-cakes-as-made-by-lawrence-page",
    "name": "Cornbread Crab Cakes By Lawrence Page Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/161517.jpg",
    "description": "Here's what you need: prepared cornbread, red pepper, green onion, mayonnaise, sour cream, fresh parsley, fresh cilantro, garlic, large egg, old bay seasoning, olive oil, salt, pepper, fresh lump crab meat, vegetable oil",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "Prepared cornbread (enough to make 2 cups of crumbs)",
        "⅔ cup finely diced red pepper",
        "½ cup sliced green onion",
        "⅓ cup mayonnaise",
        "1 tablespoon sour cream",
        "¼ cup chopped fresh parsley",
        "2 teaspoons chopped fresh cilantro",
        "1 clove garlic, minced",
        "2 large eggs, beaten",
        "1 teaspoon Old Bay Seasoning",
        "2 teaspoons olive oil",
        "Salt, to taste",
        "Pepper, to taste",
        "1 pound fresh lump crab meat",
        "Vegetable oil, for frying"
    ],
    "recipeInstructionSteps": [
        "Over a large bowl, crumble the cornbread into fine crumbs until you have about 2 cups (200 g) worth.",
        "Add the red pepper, green onion, mayonnaise, sour cream, parsley, cilantro, garlic, beaten eggs, Old Bay seasoning, olive oil, salt, pepper, and crab meat to the bowl.",
        "Break up the crab meat into fine pieces until it is all uniform in size.",
        "Mix all the ingredients together with your hands or a wooden spoon until evenly combined.",
        "Form the mixture into small patties, about 2.5 inches (6 cm) in diameter and ¾-inch (2 cm) thick and set aside.",
        "Add enough vegetable oil to a large skillet to come about ¼-inch (6 mm) up the sides. Heat the oil over medium-high heat until it reaches 350˚F (180˚C).",
        "Fry the crab cakes in batches, about 3-4 at a time. Cook on each side until golden brown, about 2-3 minutes.",
        "Transfer to a paper-towel lined plate to drain.",
        "Serve with your choice of dipping sauce, or they’re great just on their own!",
        "Enjoy!"
    ]
}