{
    "id": "churro-cheesecake",
    "link": "https://tasty.co/recipe/churro-cheesecake",
    "name": "Churro Cheesecake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/275b46b7282b4d6eaa27008b333c3bc5/BFV494735PopularMexicanDessertsFB.jpg",
    "description": "Here's what you need: water, butter, salt, flour, egg, cream cheese, sweetened condensed milk, vanilla extract, unflavored gelatin, whipped cream, sugar, cinnamon",
    "recipeCategory": "Desserts",
    "recipeCuisine": "Mexican",
    "recipeIngredient": [
        "1 cup water",
        "3 tablespoons butter",
        "1 pinch salt",
        "1 cup flour",
        "3 eggs",
        "2 (8 ounce) packs of cream cheese, softened.",
        "1 can sweetened condensed milk",
        "1 tablespoon vanilla extract",
        "1 packet unflavored gelatin, dissolved in ¼ cup cold water",
        "1 cup whipped cream",
        "Sugar and cinnamon to taste",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "In a saucepan combine water, butter and salt, bring to boil. Add the flour and mix well.",
        "Cook for a few minutes while stirring and remove from heat.",
        "Add the eggs one by one, beating well between each addition.",
        "Transfer the dough to a bag with a nozzle and pipe a large spiral on the base of a springform pan.",
        "Freeze the base until it is firm.",
        "Preheat a large pot of oil to 350˚F (175˚C). Make sure the pot is wide enough for the entire churro base to fit!",
        "Fry the churro base until it is golden brown on both sides.",
        "Transfer it to a plate and sprinkle with sugar and cinnamon to taste. Place the churro base in the springform pan and reserve.",
        "For the filling, in a bowl, beat the cream cheese, condensed milk, vanilla and hydrated gelatin until smooth. Then fold in the whipped cream.",
        "Pour the mixture on the churro base and refrigerate for 4 hours or until it is firm. Sprinkle with sugar and cinnamon to taste.",
        "Enjoy!"
    ]
}