{
    "id": "churro-ice-cream-bowls",
    "link": "https://tasty.co/recipe/churro-ice-cream-bowls",
    "name": "Churro Ice Cream Bowls Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/611fa066ddb445b282cbed439031694d/BFV8528_ChurroIceCreamBowl-Thumb1080SQ.jpg",
    "description": "Here's what you need: butter, brown sugar, salt, water, flour, vanilla, egg, cooking spray, oil, cinnamon sugar, ice cream, hot fudge, caramel sauce, piping bag, muffin tin",
    "recipeCategory": "Desserts",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "¼ cup butter, cubed",
        "2 Tbsp. brown sugar",
        "½ tsp salt",
        "1 cup water",
        "1 cup flour",
        "1 tsp vanilla",
        "4 eggs",
        "Cooking-oil spray",
        "Oil for frying",
        "Cinnamon sugar",
        "Ice cream",
        "Hot fudge and caramel topping (optional)",
        "n/a",
        "Piping bag with a small star tip",
        "Muffin tin (6 to 12 cups)"
    ],
    "recipeInstructionSteps": [
        "In a 1.5-quart saucepan over medium-high heat, add butter, brown sugar, salt, and water, and bring to a boil.",
        "As soon as the butter has fully melted and the mixture begins to boil, reduce the heat to medium-low and add in flour. Using a wooden spoon, stir until the dough comes together to form a ball (about 1 minute).",
        "Remove from heat and let cool for 5 minutes before proceeding to the next step (to prevent accidentally cooking the eggs).",
        "Mix in the vanilla extract and add in the eggs, one at a time, being sure to fully incorporate each egg before adding the next.",
        "Once all the eggs are incorporated, transfer it to a piping bag with a small star tip.",
        "Invert a muffin tin and spray thoroughly with nonstick cooking spray. Pipe the dough around the inverted cups in spirals to form the bowls. Immediately transfer the tray to the freezer and freeze until solid (about 3 hours or overnight).",
        "Heat oil in a deep pot to 350˚F (175˚C). Remove the muffin tin from the freezer and flex it to release the churro bowls (you may need to also use a butter knife under the bottom edge to initially release them). Return any extras to the freezer while you wait to fry.",
        "Fry them in batches, until nicely browned, no more than 3 minutes at a time. Be sure to carefully turn them so they fry evenly.",
        "Once desired color is reached, remove them from the oil to a paper towel-lined plate. Dab off any excess oil then roll them in cinnamon sugar.",
        "Fill with your favorite ice cream and toppings.",
        "Enjoy!"
    ]
}