{
    "id": "double-chocolate-stuffed-mini-churros-mini-churros-rellenos-de-chocolate",
    "link": "https://tasty.co/recipe/double-chocolate-stuffed-mini-churros-mini-churros-rellenos-de-chocolate",
    "name": "Double Chocolate-Stuffed Mini Churros (Mini Churros Rellenos De Chocolate) Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/42574d30e0ce4e78bef11a5e163401e0/Double_Chocolate_Stuffed_Mini_Churros_FB_FINAL_2.jpg",
    "description": "Here's what you need: butter, brown sugar, water, salt, flour, egg, vanilla extract, rum, mini chocolate chips, oil, granulated sugar, ground cinnamon",
    "recipeCategory": "Desserts",
    "recipeCuisine": "Mexican",
    "recipeIngredient": [
        "125 grams butter, cubed",
        "85 grams sugar",
        "230 milliliters water",
        "1 teaspoon salt",
        "250 grams flour",
        "3 eggs",
        "1 tablespoon vanilla extract",
        "1 tablespoon rum",
        "Mini chocolate chips",
        "½ liter of oil",
        "100 grams sugar",
        "1 tablespoon ground cinnamon"
    ],
    "recipeInstructionSteps": [
        "In a saucepan over a medium heat, combine the butter, sugar, water, and salt ,and bring to a boil.",
        "Reduce the heat to medium-low, and mix in the flour with a wooden spoon until the dough comes together to form a soft ball.",
        "Take the saucepan off the heat and cool for 5 minutes, to prevent the eggs from curdling.",
        "Gradually mix in the eggs one by one.",
        "Add in the vanilla extract and rum, and mix until creamy.",
        "Spoon the mixture into a piping bag with a star nozzle.",
        "Pipe mini churros onto a baking tray, about the length of your index finger, and top with mini chocolate chips.",
        "Pipe another churro on top, so that no chocolate shows.",
        "Freeze for 20 minutes, until set.",
        "In a large saucepan, heat up the oil until it reaches 375˚F (190˚C).",
        "Fry the churros in the oil for a few minutes, until slightly golden in color.",
        "Transfer to a paper towel-lined plate or a clean kitchen towel to drain.",
        "Combine the remaining sugar with the cinnamon.",
        "Coat each churro in the cinnamon sugar, then serve.",
        "Enjoy!"
    ]
}