{
    "id": "molten-churro-bombs",
    "link": "https://tasty.co/recipe/molten-churro-bombs",
    "name": "Molten Churro Bombs Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/164176.jpg",
    "description": "Here's what you need: water, unsalted butter, sugar, salt, all-purpose flour, large egg, vanilla extract, milk chocolate truffle, oil, sugar, cinnamon, piping bag",
    "recipeCategory": "Desserts",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 cup water",
        "4 tablespoons (½ stick) unsalted butter",
        "½ cup plus 2 tablespoons sugar, divided",
        "½ teaspoon salt",
        "1 cup all-purpose flour",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "18 milk chocolate truffles",
        "Oil, for frying",
        "½ cup sugar",
        "2 tablespoons cinnamon",
        "1 piping bag with a small closed star tip"
    ],
    "recipeInstructionSteps": [
        "In a medium saucepan over medium-high heat, combine the water, butter, 2 tablespoons sugar, and the salt, and bring to a boil.",
        "As soon as the mixture begins to boil, reduce the heat to medium-low and add the flour. Using a wooden spoon, stir until the dough comes together to form a ball, about 1 minute.",
        "Remove the pan from the heat and let cool for 5 minutes before proceeding to avoid accidentally cooking the eggs.",
        "Mix in the eggs, 1 at a time, fully incorporating each egg before adding the next. Then add the vanilla.",
        "Line a baking sheet with parchment paper.",
        "Transfer the dough to a piping bag fitted with a closed star tip.",
        "Pipe 18 1½-inch (3 cm) spiral rounds onto the baking sheet. Top each with a milk chocolate truffle. Pipe the dough in a spiral to cover the truffles, being careful to completely seal the chocolate. Immediately transfer the tray to the freezer and freeze for 1 hour, until solid.",
        "Heat the oil in a deep pot until it reaches 350˚F (180˚C).",
        "Fry in batches of 4 until nicely browned, about 3 minutes, turning so they fry evenly. Drain on a cooling rack, or paper towel-lined plate and dab off any excess oil.",
        "Combine the remaining ½ cup sugar (100 G) and the cinnamon in a small bowl. Roll the warm churro bombs in the mixture to coat.",
        "Enjoy!"
    ]
}