{
    "id": "brownie-ice-cream-sandwiches",
    "link": "https://tasty.co/recipe/brownie-ice-cream-sandwiches",
    "name": "Brownie Ice Cream Sandwiches Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/bc89db0f38f6495784120a331b11ca26/FB_1.jpg",
    "description": "Here's what you need: chocolate fudge brownie mix, ice cream",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 box chocolate fudge brownie mix",
        "1½ quarts ice cream"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350˚F (180˚C).",
        "Prepare the brownie mix as directed for “fudgy” brownies. Replace the directed amount of water with dark, freshly brewed, coffee.",
        "Take 1 cup (235 ml) of the batter and transfer it to a 9 x 9in (23 x 23 cm) brownie tray that has been lined with parchment paper.",
        "Using a spatula, spread the batter evenly over the bottom of the pan to make a thin layer.",
        "Once the batter is spread out, take another piece of parchment paper and layer it on top of the batter. Using your hands, smooth out the brownie mix to create a flat, even layer in the pan with no air bubbles between the batter and the paper.",
        "Repeat steps 3 and 4 so that you have 2 thin brownie layers.",
        "Bake for 14 minutes.",
        "Once baked, remove the top layer of parchment paper form the brownie. Then remove the thin brownie form one pan and transfer it to a cooling rack.",
        "NOTE: You will have one on the cooling rack and another still in the baking tray with the top layer of parchment paper removed.",
        "Take the ice cream out of the freezer and give it 5-10 minutes to soften.",
        "Once soft, spread the ice cream over the top of the brownie in the baking tray.",
        "Use a spatula to even out the layer of ice cream before taking the first brownie layer from the cooling rack and placing it on top.",
        "Lightly press the top brownie down into the ice cream then transfer the entire baking tray to the freezer to freeze completely.",
        "Once frozen, use the remaining layer of parchment paper to lift the contents out of the baking tray and transfer them to a cutting board.",
        "Quickly trim away the excess ice cream.",
        "Cut the large layered brownie square into 8 2x4-inch (5x10-cm) sandwiches.",
        "Either serve immediately or wrap the sandwiches in foil and transfer them back to the freezer for a later time.",
        "Enjoy!"
    ]
}