{
    "id": "homemade-chocolate-covered-ice-cream-cones",
    "link": "https://tasty.co/recipe/homemade-chocolate-covered-ice-cream-cones",
    "name": "Homemade Chocolate-Covered Ice Cream Cones Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/163909.jpg",
    "description": "Here's what you need: semisweet chocolate chips, heavy cream, coconut oil, ice cream sugar cones, vanilla ice cream, chopped peanut",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "2½ cups semisweet chocolate chips, divided",
        "½ cup heavy cream",
        "½ cup coconut oil",
        "6 ice cream sugar cones",
        "1 gallon vanilla ice cream, softened",
        "1 cup chopped peanuts"
    ],
    "recipeInstructionSteps": [
        "In a small bowl, combine ½ cup (85 G) chocolate chips and the heavy cream. Microwave in 30-second intervals, stirring in between, until melted and smooth, about 1 minute total. Cover with plastic wrap and refrigerate until set, about 20 minutes.",
        "In a large bowl, combine the remaining chocolate chips and coconut oil. Microwave in 30-second intervals, stirring in between, until melted and smooth, about 1 minute total.",
        "Wrap a 9x5-inch (22x12 cm) loaf pan in foil, keeping the foil taut across the top. Set nearby.",
        "Spoon about 2 tablespoons of the melted chocolate-coconut oil mixture into a cone, flip upside-down, and spin to coat the inside, letting excess chocolate drip back into the bowl. Poke the cone through the foil to prop upright, and repeat with the remaining cones. Chill in fridge until set, about 2 minutes.",
        "Once set, spoon some of the softened ice cream into the cones to fill, and smooth the tops. Place the cones in the freezer for 10 minutes, or until set.",
        "Scoop about a teaspoon of the ganache onto a spoon. Fill an ice cream scooper with the ice cream and create a hole in the middle with the end of a spoon. Place the ganache in the hole and place on top of a cone. Repeat with remaining cones.",
        "Set the cones on a baking sheet and freeze again for 30 minutes, or until solid.",
        "Using the remaining melted chocolate, dip the cones, turning to coat the ice cream.",
        "While the chocolate is still wet, quickly dip the cones in the chopped peanuts to coat.",
        "Enjoy!"
    ]
}