{
    "id": "ice-cream-sandwich-swirl-cake",
    "link": "https://tasty.co/recipe/ice-cream-sandwich-swirl-cake",
    "name": "Ice Cream Sandwich Swirl Cake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/165112.jpg",
    "description": "Here's what you need: sandwich bread, unsalted butter, chocolate  hazelnut spread, vanilla ice cream",
    "recipeCategory": "Desserts",
    "recipeCuisine": "",
    "recipeIngredient": [
        "18 slices of sandwich bread, crusts removed",
        "¼ cup (½ stick) unsalted butter, melted",
        "1 cup hazelnut spread, divided",
        "3 cups vanilla ice cream, softened"
    ],
    "recipeInstructionSteps": [
        "On a large cutting board, lay out 9 slices of bread in a 3x3 grid. Brush the melted butter where the bread slices will touch, then overlap the bread pieces until you have one large square of bread.",
        "Cover with another cutting board and a heavy pan to weigh it down and let sit for 10 minutes.",
        "Remove the pan and cutting board and roll the square with a rolling pin to flatten.",
        "Pour half of the hazelnut spread on the sheet of bread and spread evenly, leaving a 1-inch (1 cm) gap around the edges.",
        "Starting at the bottom, carefully roll up the bread to form a log and wrap in plastic wrap.",
        "Using the remaining 9 slices of bread and remaining hazelnut spread, make another log.",
        "Freeze for 20 minutes.",
        "Slice the chilled logs into ½-inch (1 cm) thick rounds. There will be about 18 slices per log.",
        "Place the rolls from 1 log in a parchment-lined 10-inch (25-cm) springform pan. Slice any extra rolls into smaller pieces to fill in the gaps between the whole rolls.",
        "Place a sheet of parchment on top of the rolls and use a smaller cake pan to press the rolls together, creating a compressed layer. Remove the cake pan and parchment and freeze until solid, about 1 hour.",
        "Scoop softened ice cream on top of the rolls and spread evenly. Freeze until solid, about 1 hour.",
        "Add another layer of rolls from the second log on top of the ice cream layer, filling the gaps with smaller pieces of rolls again. Place a sheet of parchment paper on top and use the smaller cake pan to compress the rolls. Remove the pan and parchment and freeze for another hour.",
        "Remove from the springform pan, slice, and serve.",
        "Enjoy!"
    ]
}