{
    "id": "bacon-chicken-alfredo-lasagna-roll",
    "link": "https://tasty.co/recipe/bacon-chicken-alfredo-lasagna-roll",
    "name": "Bacon Chicken Alfredo Lasagna Roll Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/123789.jpg",
    "description": "Here's what you need: bacon, butter, garlic, heavy cream, grated parmesan cheese, fresh parsley, salt, black pepper, rotisserie chicken, lasagna noodle, mozzarella cheese, spinach",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "16 slices bacon, thick-cut",
        "1 tablespoon butter",
        "4 cloves garlic, minced",
        "2 cups heavy cream",
        "½ cup grated Parmesan cheese",
        "¼ cup parsley, finely chopped",
        "1 teaspoon salt",
        "½ teaspoon black pepper",
        "½ rotisserie chicken or 2 cooked chicken breasts, shredded",
        "5-6 lasagna noodles, cooked",
        "6 slices mozzarella cheese",
        "1 cup spinach"
    ],
    "recipeInstructionSteps": [
        "Over a long sheet of saran wrap, lay 8 of the bacon strips down back to back. Lifting up every other strip, fold about 1-inch (2 cm) the bacon back on itself. Lay another slice of bacon perpendicular to the strips and fold the flaps back over the horizontal strip of bacon. Repeat with the rest of the bacon until a tight weave has formed. Set aside in the fridge.",
        "In a medium saucepan, add the butter and garlic over medium heat, cooking until aromatic, about 30 seconds.",
        "Add the cream, and bring to a boil.",
        "Add in the Parmesan, parsley, salt, and pepper, stirring constantly until the cheese has melted and there are no lumps remaining.",
        "Pour half of the mixture over the shredded chicken, reserving the other half to use a sauce in the end.",
        "Mix the chicken with the sauce until thoroughly combined.",
        "On a separate sheet of saran wrap, lay down the lasagna noodles, overlapping them slightly.",
        "Spread the chicken mixture over the noodles, making sure that you leave about a 1-cm (½ inch) gap at the bottom so the noodles have room to roll on themselves.",
        "Preheat oven to 400°F (200°C).",
        "Place the cheese slices evenly across the chicken, then press the spinach into a row centered between the cheese slices.",
        "While one hand keeps the spinach flat, use the other hand to lift the saran wrap up and over, causing the noodles to roll on themselves. Make sure to roll tightly until the entire thing has come together into a neat rolled bundle.",
        "Transfer the lasagna roll to the bottom of the bacon weave, and repeat the saran wrap rolling process until the bacon has tightly and completely wrapped the lasagna roll.",
        "Unwrap and transfer to a baking tray.",
        "Bake for about 25 minutes until the bacon is starting to get crispy but not too dark.",
        "Cool for about 15 minutes, then transfer the roll to a cutting board.",
        "Slice generous 1-inch (2 cm) thick portions, then serve with the remaining alfredo sauce.",
        "Enjoy!"
    ]
}