{
    "id": "lasagna-stuffed-peppers",
    "link": "https://tasty.co/recipe/lasagna-stuffed-peppers",
    "name": "Lasagna-Stuffed Peppers Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/c58e5e4f002a483e922317925ef332ce/fbthumbbbbb.jpg",
    "description": "Here's what you need: bell pepper, onion, garlic, ground beef, sweet italian sausage, salt, pepper, diced tomato, tomato sauce, whole milk ricotta cheese, grated parmesan cheese, fresh basil, egg, lasagna noodle, shredded mozzarella cheese, oil",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "4 bell peppers, various colors",
        "1 onion, chopped",
        "4 cloves garlic, chopped",
        "½ pound ground beef",
        "½ pound sweet Italian sausage",
        "1 teaspoon salt",
        "1 teaspoon pepper",
        "1 28-ounce can diced tomatoes",
        "1 28-ounce can tomato sauce",
        "15 ounces whole milk ricotta",
        "1 cup grated parmesan cheese",
        "½ cup fresh basil, chopped",
        "1 egg",
        "4-5 cooked lasagna noodles, quartered",
        "1 cup shredded mozzarella cheese",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350˚F (180˚C).",
        "Cut the top off of each pepper and remove the seeds. Transfer to a square baking dish. Bake for 20 minutes, to soften.",
        "Heat 2 tablespoons of oil in a large pot, or dutch oven, over medium high heat. Add the onion and garlic, cook until softened.",
        "Add the ground beef, sausage, salt, and pepper. Cook until the meat has browned on all sides.",
        "Add the diced tomatoes and tomato sauce. Bring the mixture to a light simmer. Simmer for 5-10 minutes, remove from heat and set aside.",
        "In a small bowl, combine ricotta, parmesan, basil, and egg. Mix together with a fork, set aside.",
        "Remove the peppers from the oven, drain any excess water that accumulated inside.",
        "Cut the lasagna noodles into quarters and set aside.",
        "Assemble the lasagna in each pepper. Alternate 2 tablespoons of sauce, 1 lasagna noodle, 2 tablespoons ricotta mixture, and 1 lasagna noodle until the peppers are full. Top with mozzarella cheese.",
        "Bake in preheated oven for 20-25 minutes, until the cheese is melted and slightly browned.",
        "Rest for 10 minutes before serving.",
        "Enjoy!"
    ]
}