{
    "id": "lasagna-party-ring",
    "link": "https://tasty.co/recipe/lasagna-party-ring",
    "name": "Lasagna Party Ring Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/f9816551126c4cc9bb676dabab748b03/BFV25417_LasagnaPartyRing-ThumbC1080.jpg",
    "description": "Here's what you need: lasagna noodles, canola oil, onion, garlic, 80% lean  ground beef, ground sweet italian sausage, salt, black pepper, crushed tomato, ricotta cheese, shredded parmesan cheese, fresh basil, egg, shredded mozzarella cheese, marinara sauce, nonstick cooking spray",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "18-20 cooked lasagna noodles",
        "3 tablespoons canola oil",
        "½ onion, diced",
        "4 cloves garlic, minced",
        "¾ pound ground beef, 80:20 ratio of lean to fat",
        "¾ pound ground sweet Italian sausage",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "28 ounces tomato sauce",
        "15 ounces ricotta",
        "½ cup shredded Parmesan",
        "¼ cup basil,chopped",
        "1 egg",
        "2 cups shredded mozzarella",
        "n/a",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "Boil the lasagna noodles in a large pot of salted water until al dente, or 2 minutes shy of the package directions. Drain and lay the cooked noodles on an oiled baking sheet, oiling any overlapping noodles to prevent sticking.",
        "Preheat the oven to 375°F (190°C).",
        "In a large pot over high heat, add the canola oil, onion, and garlic, and cook until they begin to brown, stirring occasionally, 2-3 minutes. Add the beef, sausage, salt, and pepper and cook, breaking up the meat as you stir, until all of the moisture has evaporated and the meat is starting to brown on the edges, 4-5 minutes. Add the tomato sauce, then reduce the heat to low, and simmer until the sauce becomes extremely thick, almost paste-like, stirring occasionally, 10-15 minutes. Remove from the heat.",
        "In a medium bowl, combine the ricotta, Parmesan, basil, and egg and mix until smooth. Set aside.",
        "Slice 6 of the lasagna noodles in half. These will serve as the layers in between the meat and the cheese mixture.",
        "Spray a bundt pan with nonstick cooking spray, then lay 12 noodles into the bottom of the pan, fanning them out in an overlapping pattern. One end of the noodles should run up the center of the pan, and the other end of the noodles should hang over the sides.",
        "Sprinkle half of the mozzarella into the bottom of the pan on top of the noodles. This will help bind the noodles together when cooked. Spread half of the meat mixture evenly in a ring over the top of the mozzarella, then lay half of the cut noodle pieces over the top to create a noodle layer. Spread all of the ricotta mixture over the noodles in an even ring, then layer with the rest of the noodles and the rest of the meat sauce.",
        "Fold the edges of the lasagna noodles hanging over the sides of the pan back towards the center, creating another overlapping pattern. Sprinkle the rest of the mozzarella evenly on top.",
        "Bake for about 45 minutes, or until the cheese is a deep golden brown.",
        "Cool for about an hour, then carefully invert the ring onto a cutting board. Slice the ring, then top with any extra Parmesan and basil. Place a small bowl filled with marinara in the center of the ring for dipping, and serve.",
        "Enjoy!"
    ]
}