{
    "id": "lasagna-poppers",
    "link": "https://tasty.co/recipe/lasagna-poppers",
    "name": "Lasagna Poppers Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/6bbc7c715ded4f07902f41c4ecdf75e1/BFV8327_Lasagna_Poppers-FB1080.jpg",
    "description": "Here's what you need: garlic, onion, ground beef, marinara sauce, shredded mozzarella cheese, salt, pepper, flour, panko breadcrumbs, egg, canola oil, lasagna noodle",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 Tbsp. garlic, minced",
        "1/2 cup onion, chopped",
        "1 lb. ground beef",
        "1 1/2 cup marinara saucse",
        "8 oz. shredded mozzarella cheese",
        "n/a",
        "n/a",
        "1 1/2 cup flour",
        "2 cups panko bread crumbs",
        "4 eggs",
        "3 to 4 cups of canola oil for frying — depending on size of pot used",
        "8 to 10 lasagna noodles — depending on amount of filling in each"
    ],
    "recipeInstructionSteps": [
        "Coat a 10-inch (25 cm) frying pan with olive oil. Add minced garlic and chopped onion, stirring consistently until lightly browned.",
        "Add ground beef, and stir to mix with onion and garlic.",
        "Once beef has begun to brown and water has been released drain water and fat then continue cooking until beef begins to brown and become tender and crispy.",
        "Add marinara sauce and mix together. Sprinkle salt and pepper to taste, remove heat.",
        "Add mozzarella. Stir until mozzarella binds to mixture.",
        "While mixture cools boil four cups of water in medium pot and add lasagna noodles, lay them in across each other in a star formation so they do not bind together, stir regularly.",
        "After eight to 10 minutes drain pasta and allow to cool for five minutes.",
        "Cut noodles down to 3- to 4-inch (8-10cm) slices and place mixture inside and roll.",
        "Place poppers in freezer for 12 minutes.",
        "Dip poppers in egg wash, flour, and bread crumbs, then once more in the egg wash and bread crumbs.",
        "Freeze for additional 12 minutes.",
        "Heat 3–4 inches (8-10cm) of canola oil at medium heat in a pot for 15 minutes — test by splashing drops of water into oil (it should sizzle).",
        "Place poppers in oil three or four at a time until they are golden brown on all sides, allow them to cool for 10–12 minutes and serve with marinara sauce as dip.",
        "Enjoy!"
    ]
}