{
    "id": "meatball-lasagna-bombs",
    "link": "https://tasty.co/recipe/meatball-lasagna-bombs",
    "name": "Meatball Lasagna Bombs Presented By Palmolive® Ultra Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/170561.jpg",
    "description": "Here's what you need: olive oil, yellow onion, garlic, crushed tomato, salt, pepper, fresh basil, bread crumbs, milk, egg, grated parmesan cheese, salt, pepper, ground beef, onion, lasagna noodle, ricotta cheese, mozzarella cheese, fresh parsley",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 tablespoon olive oil",
        "1 yellow onion, chopped",
        "3 cloves garlic, minced",
        "2 28-oz cans crushed tomatoes",
        "1 ½ tablespoons salt",
        "1 teaspoon pepper",
        "2 sprigs basil",
        "½ cup breadcrumbs",
        "½ cup milk",
        "1 egg",
        "½ cup grated parmesan",
        "2 teaspoons salt",
        "½ teaspoon pepper",
        "1 lb ground beef",
        "½ cup minced onions",
        "24 lasagna noodles, cooked 2 minutes less than package instructions",
        "16 oz ricotta cheese",
        "12 mozzarella slices, sliced in half",
        "Minced parsley, for garnish"
    ],
    "recipeInstructionSteps": [
        "Marinara sauce: In a large saucepan, heat the olive oil. Add onion and garlic and saute for 5 minutes, until translucent.",
        "Stir in tomatoes, salt, pepper, and basil. Simmer for 15 minutes, stirring occasionally. Remove basil sprigs and set sauce aside.",
        "In a small bowl, stir together breadcrumbs and milk and set aside. In a large bowl, whisk together egg, parmesan, salt and pepper.",
        "Stir in ground beef, onions, and wet breadcrumbs. Combine well, but do not over-mix.",
        "With oiled hands, roll the meat into golf-sized balls.",
        "Heat a skillet with a drizzle of olive oil. Brown meatballs on all sides, then remove from pan.",
        "Preheat oven to 350ºF (180º C).",
        "Lay out a lasagna noodle horizontally on a cutting board. Spread a tablespoon of ricotta onto the noodle. Lay a mozzarella slice on one end of the noodle and place a meatball on top of the cheese.",
        "Roll up the noodle with the meatball and cheese inside. Place meatball bomb into the baking dish, with the meatball showing. Repeat with the rest of the meatballs and noodles.",
        "Ladle approximately ⅔rds of the marinara sauce into a 9x13-inch (23x33-cm) baking dish. Place the meatball rolls on top of the marinara sauce.",
        "Bake dish for 25 minutes, until top is lightly browned and meatballs are cooked through completely.",
        "Remove from oven, garnish with parsley and serve with reserved marinara on the side.",
        "Enjoy!"
    ]
}