{
    "id": "pull-apart-broccoli-chicken-alfredo-lasagna-rolls",
    "link": "https://tasty.co/recipe/pull-apart-broccoli-chicken-alfredo-lasagna-rolls",
    "name": "Pull-Apart Broccoli Chicken Alfredo Lasagna Rolls Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/143312.jpg",
    "description": "Here's what you need: nonstick cooking spray, shredded chicken, broccoli, shredded mozzarella cheese, shredded parmesan cheese, salt, pepper, garlic powder, alfredo sauce, wide lasagna noodle, fresh parsley",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "Nonstick cooking spray",
        "2 cups shredded cooked chicken",
        "2 cups finely chopped broccoli",
        "2 cups shredded mozzarella, divided",
        "½ cup shredded Parmesan cheese",
        "1 teaspoon salt",
        "½ teaspoon pepper",
        "1 teaspoon garlic powder",
        "2 cups alfredo sauce, divided",
        "12 wide lasagna noodles, cooked",
        "1 tablespoon chopped parsley, for garnish"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350˚F (180˚C). Grease a 9-inch (23-cm) springform pan with nonstick spray.",
        "In a large bowl, add the chicken, broccoli, half of mozzarella, the  Parmesan, salt, pepper, garlic powder, and half of alfredo sauce. Mix thoroughly.",
        "Place one of the lasagna noodles vertically on a cutting board. Scoop a spoonful of the chicken mixture onto the noodle and spread.",
        "Starting with the end closest to you, roll up the noodle, being careful not to squeeze any of the filling out of the sides. Cut the rolled noodle in half crosswise. Repeat with the rest of the noodles and filling.",
        "Place the rolls wavy side up in a greased 9-inch (23-cm) springform pan. Sprinkle with the rest of the mozzarella cheese.",
        "Bake for 20 minutes, until the cheese starts to brown.",
        "Release the pan and garnish the rolls with parsley. Serve immediately, with warm alfredo sauce alongside for dipping.",
        "Enjoy!"
    ]
}