{
    "id": "edible-sizzling-rice-bowl",
    "link": "https://tasty.co/recipe/edible-sizzling-rice-bowl",
    "name": "Edible Sizzling Rice Bowl Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/bffef32436c84129b3f94e98db1dbbdb/thumb2.jpg",
    "description": "Here's what you need: canola oil, ginger, shrimp, carrot, onion, shiitake mushrooms, bok choy, water, chicken stock, sake, soy sauce, oyster sauce, cornstarch, water, oil, short grain rice",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "1 tablespoon canola oil",
        "1 teaspoon ginger",
        "8-9 shrimp, deveined and shelled",
        "½  carrot, cut into rounds",
        "¼ onion, sliced",
        "1 shiitake mushroom",
        "1 bok choy, cut into stem and leaves",
        "½ cup water",
        "¼ cup chicken stock",
        "2 tablespoons sake",
        "1 tablespoon soy sauce",
        "1 teaspoon oyster sauce",
        "1 tablespoon slurry (½ tablespoon starch and ½ water)",
        "n/a",
        "Oil for frying",
        "1 cup cooked short grain rice"
    ],
    "recipeInstructionSteps": [
        "To make the soup. Add canola oil and heat the pan over medium heat. Add ginger and cook until fragrant.",
        "Toss in shrimp and sauté both side until shrimp start to turn pink, but are not fully cooked.",
        "Add the carrot, onion, and bok choy stems, and sauté lightly. Add shiitake mushroom and stir. Add all the broth ingredients except slurry and bring it to a boil.",
        "Add bok choy leaves and slurry and bring to boil. Set aside.",
        "Make an edible rice bowl. Place a cup of rice onto a large piece of parchment paper and spread the rice.",
        "Put another piece of parchment paper on top and roll with a rolling pin.",
        "Once it is flat, remove the parchment paper on top and heat it with microwave for 3 minutes in order to dry it. Place it on a cooling rack to cool to touch.",
        "Once the rice sheet is cooled, put it in a mesh colander and shape it like a bowl. Fry the rice sheet in the mesh colander until golden brown.",
        "Pour warmed soup over the edible bowl while it is still hot.",
        "Enjoy!"
    ]
}