{
    "id": "hainanese-chicken-rice",
    "link": "https://tasty.co/recipe/hainanese-chicken-rice",
    "name": "Hainanese Chicken Rice Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/154660.jpg",
    "description": "Here's what you need: whole chicken, kosher salt, fresh ginger, fresh scallion, cold water, sesame oil, sesame oil, chicken fat, garlic, fresh ginger, kosher salt, long grain rice, reserved chicken poaching broth, sambal,  sriracha, sugar, garlic, fresh ginger, lime juice, reserved chicken poaching broth, fresh ginger, garlic, kosher salt, peanut oil, rice vinegar, reserved fried garlic and ginger, oyster sauce, dark sweet soy sauce, light soy sauce, reserved chicken poaching broth, cucumber, fresh cilantro",
    "recipeCategory": "Dinner",
    "recipeCuisine": "",
    "recipeIngredient": [
        "1 whole 3-5 pound chicken, giblets removed",
        "¼ cup kosher salt, divided",
        "1 4-inch piece fresh ginger, peeled and cut into ¼-inch slices",
        "1 bunch of green onions",
        "1 gallon of cold water, plus more as needed",
        "2 tablespoons sesame oil",
        "¼ cup sesame oil",
        "2 tablespoons chopped chicken fat",
        "2 cloves garlic, minced",
        "1 tablespoon minced fresh ginger",
        "1 teaspoon kosher salt",
        "2 cups long-grain rice, rinsed and drained",
        "2 cups reserved chicken poaching broth",
        "2 tablespoons sambal",
        "2 tablespoons Sriracha",
        "2 teaspoons sugar",
        "1 tablespoon minced garlic",
        "1 tablespoon minced fresh ginger",
        "1 tablespoon lime juice",
        "2 tablespoons reserved chicken poaching broth",
        "2 tablespoon grated fresh ginger",
        "2 tablespoons garlic, finely minced",
        "Kosher salt, to taste",
        "3 tablespoons peanut oil",
        "1 tablespoon rice vinegar",
        "Reserved fried garlic and ginger",
        "1 tablespoon oyster sauce",
        "3 tablespoons dark sweet soy sauce",
        "1 tablespoon light soy sauce",
        "2 tablespoons reserved chicken poaching broth",
        "2 cucumbers, thinly sliced, for serving",
        "1 bunch fresh cilantro, for serving"
    ],
    "recipeInstructionSteps": [
        "To clean the chicken, rub all over with a handful of kosher salt, getting rid of any loose skin. Rinse the chicken well inside and out. Pat dry with paper towels.",
        "Remove any excess fat from the chicken and set aside for later.",
        "Season the chicken generously with salt. Stuff the chicken cavity with the ginger slices and scallions.",
        "Place the chicken in a large stock pot, cover with cold water by 1 inch (2 cm), and season with salt to taste.",
        "Bring to a boil over high heat, then immediately reduce the heat to low to maintain a simmer. Cover and cook for about 30 minutes, or until the internal temperature of the chicken reaches 165°F (75°C). Remove the pot from the heat.",
        "Remove the chicken from the pot, reserving the poaching liquid for later, and transfer to an ice bath for 5 minutes to stop the cooking process and to keep the chicken skin springy. Discard the ginger and green onion.",
        "After it’s cooled, pat the chicken dry with paper towels and rub all over with sesame oil. This will help prevent the chicken from drying out.",
        "In a large wok or skillet, heat ¼ cup (60 ml) of sesame oil over medium-high heat. Add 2 tablespoons of reserved chopped chicken fat, the garlic, ginger, and salt, and fry until aromatic, about 10 minutes.",
        "Reserve ¼ of the fried garlic mixture, then add the rice to the remaining fried garlic and stir to coat. Cook for 3 minutes.",
        "Transfer the rice to a rice cooker and add 2 cups (480 ml) of reserved poaching broth. Steam the rice for 60 minutes, or until tender.",
        "While the rice is cooking, carve the chicken for serving.",
        "Make the chili sauce: combine the sambal, Sriracha, sugar, garlic, ginger, lime juice, and chicken broth in a small bowl and stir to incorporate.",
        "Make the ginger garlic sauce: in a small bowl, combine the ginger, garlic, salt, peanut oil, and rice vinegar, and stir to incorporate.",
        "Make the soy sauce: in a small bowl, combine the reserved fried garlic and ginger with the oyster sauce, dark soy sauce, light soy sauce, and chicken broth, and stir to incorporate.",
        "Serve the sliced chicken with the rice, dipping sauces, sliced cucumbers, and fresh cilantro. ",
        "Enjoy!"
    ]
}