{
    "id": "mushroom-risotto-by-marcel-vigneron",
    "link": "https://tasty.co/recipe/mushroom-risotto-by-marcel-vigneron",
    "name": "Mushroom Risotto By Marcel Vigneron Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/726048ceec474a4f95305af4ddcb3804/BFV18974_MushroomRisottoTastyStory_ThumbFB.jpg",
    "description": "Here's what you need: dried shiitake mushroom, filtered water, grapeseed oil, oyster mushroom, fresh thyme, garlic, butter, salt, olive oil, shallot, butter, sushi rice, bay leaf, garlic, dry white wine, mushroom stock, frozen peas, salt, butter, white truffle oil, rayu oil, pine nuts, grated parmesan cheese, pine nuts, wood sorrel, grated parmesan cheese, olive oil",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Italian",
    "recipeIngredient": [
        "2 cups dried shiitake mushrooms",
        "2 quarts filtered water",
        "1 tablespoon grapeseed oil",
        "8 ounces oyster mushrooms, torn into pieces",
        "1 sprig thyme",
        "1 clove garlic (skin on, smashed)",
        "1 tablespoon butter",
        "Salt, to taste",
        "2 tablespoons olive oil",
        "1½ cups shallots, minced",
        "¼ cup butter",
        "1½ cup sushi rice",
        "1 bay leaf",
        "1 clove garlic",
        "⅔ cup dry white wine",
        "8 cups mushroom stock",
        "1 cup frozen peas",
        "Salt, to taste",
        "¼ cup butter",
        "1 drop white truffle oil",
        "1 teaspoon rayu oil (Korean garlic chili oil)",
        "¼ cup pine nuts",
        "⅔ cup parmesan, grated (use vegetarian parmesan to make the dish vegetarian)",
        "Pine nuts",
        "Wood sorrel",
        "Parmesan",
        "Olive oil"
    ],
    "recipeInstructionSteps": [
        "Blend dried shiitake in blender until it becomes a fine powder.",
        "Pour into a pot filled with filtered water, bring to a boil, then lower the heat and simmer for 20 minutes. Keep broth warm while preparing the risotto.",
        "Sauté oyster mushrooms in grapeseed oil until brown edges have formed.",
        "Add thyme, garlic, and 1 tablespoon of butter to help caramelize. Once they have caramelized, salt, to taste, and reserve.",
        "Sweat the shallots in olive oil until tender, about 5 minutes, then add butter and sushi rice. Toast rice while stirring frequently.",
        "Add bay leaf, garlic clove, and pour white wine over toasted rice and cook until the wine has been absorbed, then continue stirring.",
        "Over medium heat, add 2 cups (470 ml) of warm mushroom stock at a time, stirring occasionally and adding more stock as it gets absorbed by the rice. The rice should absorb 6-8 cups (1.4-1.9 liters) of stock. Taste the rice throughout to make sure it cooks just until it is tender, or al dente.",
        "Add frozen peas and stir. Salt the risotto, to taste, and remove the garlic clove and bay leaf.",
        "Add ¼ cup (60g) butter, truffle oil, rayu oil, sautéed mushrooms (optional: save some for garnish), pine nuts, and Parmesan. Stir until well incorporated.",
        "Garnish with reserved mushrooms, pine nuts, wood sorrel, Parmesan, and drizzle with olive oil.",
        "Enjoy!"
    ]
}