{
    "id": "vietnamese-shaking-beef",
    "link": "https://tasty.co/recipe/vietnamese-shaking-beef",
    "name": "Vietnamese Shaking Beef Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/150402.jpg",
    "description": "Here's what you need: thick rib eye steak, garlic, brown sugar, soy sauce, oyster sauce, fish sauce, freshly ground black pepper, granulated sugar, white vinegar, water, red onion, watercress, roma tomato, vegetable oil, fresh cilantro, white rice",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Vietnamese",
    "recipeIngredient": [
        "2 pounds boneless beef rib eye, cut into 1-inch cubes",
        "10 cloves garlic, minced,",
        "3 tablespoons brown sugar",
        "5 tablespoons soy sauce, divided",
        "2 tablespoons oyster sauce",
        "1 tablespoon fish sauce",
        "Freshly ground black pepper, to taste",
        "1 tablespoon granulated sugar",
        "2 tablespoons white vinegar",
        "2 tablespoons water",
        "1 red onion, sliced into rings",
        "2 bunches watercress",
        "3 roma tomatoes, sliced",
        "2 tablespoons vegetable oil",
        "Fresh cilantro, for garnish",
        "Cooked white rice, for serving"
    ],
    "recipeInstructionSteps": [
        "In a large bowl, combine the beef, garlic, brown sugar, 3 tablespoons of soy sauce, oyster sauce, fish sauce, and black pepper. Toss to combine. Let marinate at room temperature for 30 minutes.",
        "In small bowl, combine the granulated sugar, remaining 2 tablespoons of soy sauce, white vinegar, and water. Add the red onion slices and coat the red onions in the dressing thoroughly. Set aside to soak.",
        "On a platter, arrange the watercress and tomato slices.",
        "Preheat a large wok or skillet over high heat, then add the vegetable oil. When the oil is shimmering, swirl the oil around in the pan. Add half of the beef cubes and sear on all sides, shaking the pan, until the meat is slightly charred and medium rare, 3-5 minutes. Set the meat aside and repeat with remaining beef.",
        "Arrange the beef on the bed of watercress and tomatoes. Top with the dressed red onions and fresh cilantro.",
        "Serve with domed white rice. For a full meal, serve alongside Vietnamese crepes, spring rolls, and banh mi sandwiches.",
        "Enjoy!"
    ]
}