{
    "id": "giant-bbq-rib-sandwich-to-feed-a-crowd",
    "link": "https://tasty.co/recipe/giant-bbq-rib-sandwich-to-feed-a-crowd",
    "name": "Giant BBQ Rib Sandwich (To Feed A Crowd) Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/9638bcbb8dc3465aa5d9e060588086ac/BFV21737_GiantRibSandwich-ThumbA1080.jpg",
    "description": "Here's what you need: baby back ribs, paprika, pepper, brown sugar, salt, garlic powder, onion powder, cumin, chili powder, barbecue sauce, honey, bread, butter, sesame seed, large onion, Chopped fresh parsley",
    "recipeCategory": "Lunch",
    "recipeCuisine": "BBQ",
    "recipeIngredient": [
        "1 rack baby back ribs, membrane removed (this is essential for de-boning)",
        "2 tablespoons paprika",
        "1 tablespoon pepper",
        "2 tablespoons brown sugar",
        "2 teaspoons salt",
        "1 teaspoons garlic powder",
        "1 teaspoons onion powder",
        "1 teaspoons cumin",
        "1 teaspoons chili powder",
        "1 cup barbecue sauce",
        "¼ cup honey",
        "1 large loaf bread",
        "¼ cup melted butter",
        "1 tablespoon sesame seeds",
        "2 large onions, sautéed or caramelized",
        "2 tablespoons parsley, chopped"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 300°F (150°C).",
        "Lay the ribs on a long sheet of aluminum foil. Combine the paprika, pepper, brown sugar, salt, garlic powder, onion powder, cumin, and chili powder in a small bowl, then cover the ribs evenly on both sides, pressing the rub into any cracks and smoothing out any large lumps. Wrap the foil around the ribs, making sure they’re completely sealed. It’s important that the juices of the ribs stay inside the foil to keep the ribs moist during cooking. Use more sheets of foil if necessary.",
        "Bake the ribs for 3-3½ hours, until tender. Unwrap the ribs carefully, then wiggle the bones out slowly. If you’re having trouble removing the bones, use a knife to make small cuts in the meat to aid their removal. Preheat the broiler on your oven.",
        "Combine the barbecue sauce and honey in a small bowl and brush both sides of the deboned slab of ribs generously, being sure to carefully handle the ribs since the meat will be super tender.",
        "Broil the ribs for about 5 minutes until the glaze is bubbling and starting to brown.",
        "Slice the bread loaf in half lengthwise, then butter both sides of the bread. Sprinkle sesame seeds on the outside of the bread, then toast under the broiler for a few minutes. Keep a careful eye on it as they will burn extremely quickly.",
        "With two long spatulas or knives, carefully transfer the glazed ribs to the bottom bread half, then top with the caramelized onions, parsley, and the top half of bread. Cut into about 8 2-inch (5-cm) sandwiches, and serve.",
        "Enjoy!"
    ]
}