{
    "id": "grilled-shrimp-tacos-with-creamy-cilantro-sauce",
    "link": "https://tasty.co/recipe/grilled-shrimp-tacos-with-creamy-cilantro-sauce",
    "name": "Grilled Shrimp Tacos With Creamy Cilantro Sauce Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/f30976f0190e4ec29002624244282e37/BFV10815_GrilledShrimpTacosWithCreamyCilantroSauce_ThumbA.jpg",
    "description": "Here's what you need: shrimp, paprika, garlic powder, dried oregano, cumin, red pepper flakes, salt, skewers, olive oil, corn tortilla, sour cream, fresh cilantro, lime zest, salt, lime juice, green cabbage, red cabbage, jalapeño, lime wedge, fresh cilantro",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "2 pounds shrimp, deveined &amp; tails removed",
        "1 teaspoon paprika",
        "1 teaspoon garlic powder",
        "½ teaspoon dried oregano",
        "1 teaspoon cumin",
        "½ teaspoon red pepper flakes",
        "½ teaspoon salt",
        "24 bamboo or metal skewers",
        "4 tablespoons olive oil",
        "24 corn tortillas",
        "1 cup sour cream",
        "3 tablespoons cilantro, minced",
        "1 teaspoon lime zest",
        "¼ teaspoon salt",
        "2 tablespoons lime juice",
        "1 ½ cups green cabbage",
        "1 ½  cups red cabbage",
        "1 tablespoon jalapeño, minced",
        "Lime wedges",
        "Cilantro"
    ],
    "recipeInstructionSteps": [
        "In a large bowl, season shrimp with paprika, garlic powder, oregano, cumin, red pepper flakes, and salt. Toss gently to combine.",
        "Using 2 bamboo or metal skewers, poke through the top and bottom of the shrimp and push down to the bottom of the skewer.",
        "Add 3 more shrimp to the same skewer and repeat until all of the shrimp are used.",
        "Right before you put the shrimp on the grill, brush each skewer with a generous amount of olive oil, to prevent sticking.",
        "Grill over high heat for 3 minutes, brush the top side with more olive oil, flip, and let cook for an additional 3 minutes.",
        "Remove from skewers &amp; set aside for taco assembly.",
        "In a bowl, combine all creamy cilantro sauce ingredients. Stir well to combine.",
        "In a large bowl, combine green cabbage, red cabbage, and minced jalapeño. Pour half of the sour cream mixture over the cabbage, saving the other half for extra sauce to put on the tacos.",
        "Assemble the tacos on corn tortillas. Add the cabbage mixture, followed by the shrimp. Top with the creamy cilantro sauce, cilantro, and a squeeze of lime juice.",
        "Enjoy!"
    ]
}