{
    "id": "baked-falafel-and-tzatziki-sauce",
    "link": "https://tasty.co/recipe/baked-falafel-and-tzatziki-sauce",
    "name": "Baked Falafel And Tzatziki Sauce Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/974297a311bb4f6eb04020524ad2c193/BFV37212_FalafelTwoWays_TastyVeg_v4_1.jpg",
    "description": "Here's what you need: dried chickpea, water, fresh parsley, fresh cilantro, fresh mint, garlic, onion, paprika, cumin, ground coriander, baking soda, toasted sesame seed, salt, pepper, olive oil, cucumber, greek yogurt, fresh mint, garlic, olive oil, lemon juice",
    "recipeCategory": "Snacks",
    "recipeCuisine": "Middle Eastern",
    "recipeIngredient": [
        "2 ½ cups dried chickpeas",
        "8 cups water",
        "½ bunch parsley",
        "¼ bunch cilantro",
        "¼ bunch mint",
        "5 cloves garlic , halved, divided",
        "1 onion, roughly chopped",
        "1 teaspoon paprika",
        "2¼ teaspoons cumin, divided",
        "2 teaspoons coriander, ground",
        "1 teaspoon baking soda",
        "1 tablespoon toasted sesame seeds",
        "Salt, to taste",
        "Pepper, to taste",
        "Olive oil, to brown falafel",
        "1 cucumber, peeled",
        "1 ¼ cups Greek yogurt",
        "2 tablespoons mint",
        "2-3 cloves garlic, minced",
        "1 tablespoon olive oil",
        "1 tablespoon lemon juice"
    ],
    "recipeInstructionSteps": [
        "Soak the chickpeas in the water for at least one night, ensuring that the chickpeas are fully submerged.",
        "Drain the chickpeas in a colander. Line a baking sheet with paper towels and add the chickpeas. Cover with more paper towels and let dry for at least 2 hours.",
        "Preheat oven to 350°F (180 °C).",
        "Add the dried chickpeas, parsley, cilantro, coriander, mint, 5 cloves of garlic, onion, paprika, 2 teaspoons of cumin, ground coriander, baking soda, toasted sesame seeds, salt and pepper, in a blender and blend until smooth.",
        "Use your hands to form falafel the size of a ping pong ball.",
        "Place them on a parchment paper-lined baking sheet.",
        "Brush the falafel with olive oil.",
        "Bake for about 25-30 minutes.",
        "To prepare the tzatziki, cut a cucumber in fourths and remove the seeds.",
        "Use a box grater to grate the cucumber into a bowl.",
        "Salt the grated cucumber and let sit for 5 minutes.",
        "Place the salted cucumber into a sieve and press down with a spatula to remove excess liquid.",
        "Mix the grated cucumber with Greek yogurt, 2 tablespoons of mint, the minced garlic cloves, 1 tablespoon of olive oil, lemon juice, salt and pepper.",
        "Serve the falafel with the tzatziki.",
        "Enjoy!"
    ]
}