{
    "id": "classic-falafel-and-tahini-sauce",
    "link": "https://tasty.co/recipe/classic-falafel-and-tahini-sauce",
    "name": "Classic Falafel And Tahini Sauce Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/5937e1569b514f058d91ace7cc976140/BFV37212_FalafelTwoWays_TastyVeg_v4_1.jpg",
    "description": "Here's what you need: dried chickpea, water, fresh parsley, fresh cilantro, fresh mint, garlic, onion, paprika, cumin, ground coriander, baking soda, sesame seed, salt, pepper, oil, sesame seed, sesame oil, olive oil, lemon juice",
    "recipeCategory": "Snacks",
    "recipeCuisine": "Middle Eastern",
    "recipeIngredient": [
        "2 ½ cups dried chickpeas",
        "8 cups water",
        "½ bunch parsley",
        "¼ bunch cilantro",
        "¼ bunch mint",
        "7 cloves garlic , halved, divided",
        "1 onion, roughly chopped",
        "1 teaspoon paprika",
        "2¼ teaspoons cumin, divided",
        "2 teaspoons coriander, ground",
        "1 teaspoon baking soda",
        "1 tablespoon sesame seeds,  toasted",
        "Salt, to taste",
        "Pepper, to taste",
        "Oil, to fry",
        "5 tablespoons sesame seeds",
        "1 teaspoon sesame oil",
        "1 ½ tablespoon olive oil",
        "1 teaspoon lemon juice"
    ],
    "recipeInstructionSteps": [
        "Soak the chickpeas in the water for at least one night, ensuring that the chickpeas are fully submerged.",
        "Drain the chickpeas in a colander. Line a baking sheet with paper towels and add the chickpeas. Cover with more paper towels and let dry for at least 2 hours.",
        "Add the dried chickpeas, parsley, cilantro, coriander, mint, 5 cloves of garlic, onion, paprika, 2 teaspoons of cumin, ground coriander, baking soda, toasted sesame seeds, salt, and pepper, in a blender and blend until smooth.",
        "Use your hands to form falafel the size of a ping pong ball.",
        "Heat oil to 320°F (160°C) in a large pot.",
        "Add the falafel in batches, and fry until golden brown, about 2 minutes.",
        "To make tahini sauce, heat the sesame seeds in a frying pan over medium heat until the seeds brown slightly.",
        "Let cool for about 5 minutes and pour into a small blender or coffee grinder.",
        "Add the sesame oil and half of the olive oil and blend. Add the rest of the olive oil and blend again until you get a smooth mixture.",
        "Add ¼ teaspoon of cumin, 2 garlic cloves and lemon juice and blend.",
        "Serve the tahini sauce with falafel.",
        "Enjoy!"
    ]
}