{
    "id": "falafel-sliders",
    "link": "https://tasty.co/recipe/falafel-sliders",
    "name": "Falafel Sliders Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/125473.jpg",
    "description": "Here's what you need: chickpeas, red onion, fresh parsley, all-purpose flour, garlic, lemon juice, cumin, coriander, salt, pepper, olive oil, chickpeas, avocado, olive oil, garlic, lemon juice, salt, pepper, tahini, water, garlic, lemon juice, salt, slider bun, tomato",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Middle Eastern",
    "recipeIngredient": [
        "2 15-ounce cans, drained and rinsed",
        "1 cup red onion, diced",
        "½ cup parsley",
        "1 cup all-purpose flour",
        "4 cloves garlic",
        "1 tablespoon lemon juice",
        "2 teaspoons cumin",
        "2 teaspoons coriander",
        "1 teaspoon salt",
        "½ teaspoon pepper",
        "Olive oil, for greasing",
        "⅔ cup chickpeas",
        "2 avocados",
        "¼ cup olive oil",
        "2 cloves garlic",
        "2 tablespoons lemon juice",
        "¾ teaspoon salt",
        "¼ teaspoon pepper",
        "½ cup tahini",
        "⅓ cup water",
        "1 clove garlic, minced",
        "1 tablespoon lemon juice",
        "½ teaspoon salt",
        "12 slider buns",
        "12 tomato slices"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 425°F (220°C).",
        "Add chickpeas, red onion, parsley, flour, garlic, lemon juice, cumin, coriander, salt and pepper to food processor and blend until smooth.",
        "Grease a 18x13-inch (46x33-cm) baking sheet with olive oil. Use a spatula to transfer falafel mixture to the pan.",
        "Using spatula and your hands, form the falafel mixture into a rectangle that is roughly the size of the slider buns.",
        "Bake falafel for 20-25 minutes or until crispy, flipping halfway through.",
        "For the avocado hummus, add avocados, chickpeas, garlic, olive oil, lemon juice, salt and pepper to food processor and blend until chunky.",
        "For the tahini sauce, whisk together tahini, water, garlic, lemon juice, salt and pepper in small mixing bowl.",
        "Keeping slider buns attached, cut them in half lengthwise with a serrated knife. Remove top half and set aside.",
        "When falafel is done baking, remove from oven and place on top of bottom half of slider buns.",
        "Top falafel with one layer of avocado hummus, followed by one layer of tomatoes. Drizzle with tahini sauce.",
        "Cover with top half of slider buns and cut into 12 sliders.",
        "Enjoy!"
    ]
}