{
    "id": "homemade-falafel",
    "link": "https://tasty.co/recipe/homemade-falafel",
    "name": "Homemade Falafel Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/files/1497694775/FB_2.jpeg",
    "description": "Whether you’re trying to cut back on meat or just looking for something different to make for dinner, homemade falafel is the solution. This classic Middle Eastern dish is actually surprisingly easy to make at home. You can even prepare the chickpea mixture ahead of time, refrigerate it overnight, and then cook the falafel balls when you’re ready to eat. Toss them in pita bread or on top of salad for a feel-good meal you’ll want to make over and over again.",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Middle Eastern",
    "recipeIngredient": [
        "2 cans chickpeas, drained and rinsed",
        "n/a",
        "¼ cup parsley",
        "4 cloves garlic, peeled",
        "1 tablespoon lemon juice",
        "2 teaspoon cumin",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "½ teaspoon red pepper flakes",
        "1 cup bread crumbs",
        "Oil, for frying",
        "Pita bread",
        "n/a",
        "Tomatoes",
        "Cucumber",
        "Tahini sauce"
    ],
    "recipeInstructionSteps": [
        "To the bowl of a 2-quart food processor, add the chickpeas, onion, parsley, garlic, lemon juice, and spices. Pulse the ingredients together until just incorporated and they form a wet paste. Be careful not to overblend.",
        "Transfer the chickpea mixture to a large bowl and add the bread crumbs, mixing until just incorporated. Cover with plastic wrap and refrigerate for 1-2 hours, or overnight.",
        "Remove the chilled falafel mixture from the refrigerator and shape into 1-inch balls. The mixture should yield 18-20 balls.",
        "In a large frying pan with high sides, heat about 1 inch of oil to 350˚F (180˚C). Fry the falafel balls in batches of 6 for 3 minutes, flipping halfway. Once they are golden brown and crispy, transfer them to a paper towel-lined plate and sprinkle with salt.",
        "Serve the falafel as desired, either as a sandwich, salad topping, or over a bed of greens with a side of tahini sauce.",
        "Enjoy!"
    ]
}