{
    "id": "hearty-roasted-veggie-salad",
    "link": "https://tasty.co/recipe/hearty-roasted-veggie-salad",
    "name": "Hearty Roasted Veggie Salad Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/130123.jpg",
    "description": "Here's what you need: beet, olive oil, salt, red onion, carrot, parsnip, sweet potato, pepper, balsamic vinegar, lemon juice, dijon mustard, garlic powder, fresh parsley, mixed greens, walnuts, crumbled feta cheese",
    "recipeCategory": "Lunch",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "3 beets",
        "1 cup olive oil, divided",
        "1½ teaspoon salt divided",
        "1 red onion, cut into wedges",
        "4 carrots, peeled and chopped",
        "2 parsnips, peeled and chopped",
        "1 sweet potato, peeled and chopped",
        "¾ teaspoon pepper, divided",
        "2 tablespoons balsamic vinegar",
        "1 tablespoon lemon juice",
        "1 tablespoon Dijon mustard",
        "½ teaspoon garlic powder",
        "3 tablespoons parsley, chopped",
        "6 cups mixed greens",
        "1 cup walnuts, chopped",
        "½ cup feta, crumbled"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 425˚F (220˚C).",
        "On a cutting board, cut the root end of the beet so it lays flat on the surface. Place the beet on a piece of aluminum foil. Drizzle with 1 tablespoon of olive oil and season with ¼ teaspoon salt. Wrap the foil around the beet and pinch the top of the foil together until the beet is sealed in. Repeat with the other 2 beets.",
        "On a sheet pan, place the onions, carrots, parsnips, and sweet potato.",
        "Drizzle with 3 tablespoons olive oil and season with ½ teaspoon pepper and ½ teaspoon salt. Toss the the vegetables until coated and spread them evenly in the pan.",
        "Create 3 circular spaces for the beets. Place the 3 beets on the pan.",
        "Bake for 1 hour until with vegetables begin to crisp and caramelize.",
        "In a large bowl, add ½ cup (120 ml) of olive oil, balsamic vinegar, lemon juice,",
        "Dijon mustard, and garlic powder, and whisk until emulsified. Add the parsley and season with salt and pepper, stirring to combine.",
        "Add the mixed greens, roasted vegetables, and the beets to the bowl with the vinaigrette and toss until evenly incorporated.",
        "Serve with walnuts and feta.",
        "Enjoy!"
    ]
}