{
    "id": "chocolate-peanut-butter-mousse-box-cake",
    "link": "https://tasty.co/recipe/chocolate-peanut-butter-mousse-box-cake",
    "name": "Chocolate Peanut Butter Mousse &#x27;Box&#x27; Cake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/143342.jpg",
    "description": "Here's what you need: brownie mix, large egg, vegetable oil, water, gelatin, water, smooth peanut butter, powdered sugar, whipped cream, gelatin, water, chocolate chips, heavy cream, whipped cream, peanut butter cup",
    "recipeCategory": "Desserts",
    "recipeCuisine": "",
    "recipeIngredient": [
        "1 18-ounce package brownie mix",
        "2 large eggs",
        "½ cup vegetable oil",
        "3 tablespoons water",
        "½ teaspoon gelatin",
        "1 tablespoon water",
        "1 cup smooth peanut butter",
        "½ cup powdered sugar",
        "1½ cups whipped cream",
        "½ teaspoon gelatin",
        "1 tablespoon water",
        "1½ cups chocolate chips",
        "1½ cups heavy cream",
        "1½ cups whipped cream",
        "6 chocolate peanut butter cups (for serving)"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 325°F (160°C).",
        "Make the brownie layer: in a large bowl, combine the brownie mix, eggs, vegetable oil, and water. Stir until the batter is smooth and thick.",
        "Pour the batter into an 8-inch (20-cm) springform pan and smooth the top with a spatula or knife.",
        "Bake for 25 minutes. Remove from oven and use a spatula to press down the top. Let cool to room temperature.",
        "Make the peanut butter mousse: in a small bowl combine the gelatin and water, and set aside.",
        "In a large bowl, mix the peanut butter and powdered sugar until smooth and shiny.",
        "Microwave the gelatin mix for 10 seconds, then mix into the peanut butter until thick and  lumpy. Gently fold in half the whipped cream. Once incorporated, fold in the remaining whipped cream.",
        "Pour into the springform pan over the brownie base and smooth the top with a spatula or knife. Freeze for 20 minutes.",
        "Make the chocolate mousse: in a small bowl, combine the gelatin and water, and set aside.",
        "In a large bowl, combine the chocolate chips and heavy cream. Microwave in 20-second increments, stirring between each, until melted.",
        "Microwave the gelatin for 10 seconds, then add to chocolate mixture. Gently fold in half of the whipped cream. Once incorporated, fold in the remaining whipped cream.",
        "Pour the batter into the springform pan over the peanut butter layer and smooth with a spatula or knife. Freeze overnight.",
        "Remove cake from the freezer and release the springform. Cut the chocolate peanut butter cups into sixths and evenly place around the rim of the cake, or decorate as desired!",
        "Let the cake thaw for 15 minutes, then serve.",
        "Enjoy!"
    ]
}