{
    "id": "chocolate-fudge-ice-cream-cake",
    "link": "https://tasty.co/recipe/chocolate-fudge-ice-cream-cake",
    "name": "Chocolate Fudge Ice Cream Cake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/3b148797225d4712914c754ba53d42ef/BFV12450_ChocolateFudgeIceCreamCake-ThumbTextless1080.jpg",
    "description": "Here's what you need: brownie mix, heavy whipping cream, dark chocolate, egg yolk, egg white, granulated sugar, white chocolate, toothpick",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "½ package of brownie mix",
        "1 cup heavy whipping cream",
        "2 bars dark chocolate, broken into small pieces (we used 72%)",
        "3 egg yolks",
        "3 beaten egg whites",
        "¼ cup granulated sugar",
        "½ bar of white chocolate",
        "toothpick"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C).",
        "In a large bowl, combine brownie mix, egg, oil, and water until creamy.",
        "Pour the brownie batter into a parchment-lined springform pan.",
        "Bake for 25-30 minutes, until center no longer wobbles.",
        "Leave the brownie base in the pan to cool completely.",
        "Whip the heavy cream until it makes soft peaks. Set aside.",
        "Pour water into a saucepan about half-full, and bring to a gentle simmer. Place a heat-safe bowl over the pot.",
        "NOTE: The bowl should be bigger than the saucepan so that the bottom of the bowl doesn’t come in contact with the simmering water.",
        "Add the chocolate pieces to the bowl and stir frequently until smooth. Set aside. (Be careful – the bowl may be hot.)",
        "NOTE: make sure the water isn’t boiling, or you can burn the chocolate.",
        "Separate the eggs and beat the egg whites until blended.",
        "In a second heat-safe bowl, whisk the egg yolks until blended.",
        "Just like with the chocolate, place the bowl with the egg mixture on top of the gently simmering water, whisking heavily for about 2 minutes until it has a lighter color and a creamy texture. Set aside.",
        "Whisk granulated sugar into the egg mixture. Slowly stir in the melted chocolate.",
        "Carefully fold in the egg whites and the whipped cream until blended.",
        "Spread the chocolate mousse over the cooled brownie base in the springform pan.",
        "In a glass bowl, microwave the white chocolate in 15-second increments and stir until melted.",
        "Pour the white chocolate into a plastic bag. Cut off the tip of one of the bag&#x27;s corners.",
        "Drizzle white chocolate all over the cake.",
        "Using a toothpick or skewer, swirl white chocolate into the mousse in small circular motions to make a marbled pattern.",
        "Freeze overnight, or at least 6-8 hours.",
        "Enjoy!"
    ]
}