{
    "id": "dairy-free-chocolate-coconut-cream-pie",
    "link": "https://tasty.co/recipe/dairy-free-chocolate-coconut-cream-pie",
    "name": "Dairy-free Chocolate Coconut Cream Pie Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/319c107cbc8548c682bf0fe769c6e11c/BFV34451_Dairy-FreeChocolateCoconutCreamPie-FB.jpg",
    "description": "Here's what you need: rolled oats, almond, unsweetened shredded coconut, salt, maple syrup, coconut oil, ripe avocado, coconut cream, cocoa powder, coconut milk, maple syrup, salt, coconut milk, maple syrup, vanilla extract, toasted coconut flakes",
    "recipeCategory": "Desserts",
    "recipeCuisine": "",
    "recipeIngredient": [
        "⅔ cup rolled oats",
        "⅔ cup almonds",
        "1 cup unsweetened shredded coconut",
        "¼ teaspoon salt",
        "2 tablespoons maple syrup",
        "¼ cup coconut oil, melted",
        "2 ripe avocados",
        "1 can (13.66 ounces) coconut cream",
        "¾ cup cocoa powder",
        "¾ cup coconut milk",
        "⅓ cup maple syrup",
        "Pinch of salt",
        "1 can (13.66 ounces) full-fat coconut milk, chilled and divided",
        "2 tablespoons maple syrup",
        "½ teaspoon vanilla extract",
        "Toasted coconut flakes, to serve"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350°F (180°C).",
        "In a food processor, pulse rolled oats until finely ground.",
        "Add almonds and blend until finely chopped. Add unsweetened coconut flakes and salt. Pulse a few times.",
        "Add melted coconut oil and maple syrup until combined.",
        "Pour pie mixture into a greased 9x9-inch (23x23-cm) pie dish, spreading it evenly on the bottom and sides.",
        "Poke the crust with a fork several times. Bake for 20 minutes.",
        "For the filling, add the avocados, coconut cream, cocoa powder,coconut milk, maple syrup, and salt to a blender and blend until smooth.",
        "Pour mixture into the cooled crust and spread an even layer.",
        "Place in the refrigerator for 4 hours or overnight.",
        "For the coconut whipped cream, add the thick part of the coconut milk to a bowl. Using an electric mixer, beat the coconut milk until fluffy.",
        "Add vanilla extract and maple syrup and beat until well combined. Chill until ready to serve.",
        "Top with toasted coconut flakes.",
        "Enjoy!"
    ]
}