{
    "id": "double-chocolate-mousse-tart",
    "link": "https://tasty.co/recipe/double-chocolate-mousse-tart",
    "name": "Double Chocolate Mousse Tart Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/8a0fb97eea9d495aab5d09b8a31fc27f/BFV42255_EasyDessertsForGirlsNight_FB1080SQ.jpg",
    "description": "Here's what you need: graham cracker, unsalted butter, dark chocolate chip, whipped cream, milk chocolate chips, whipped cream, thick chocolate bar, cocoa powder",
    "recipeCategory": "Desserts",
    "recipeCuisine": "",
    "recipeIngredient": [
        "8 graham crackers, crushed",
        "3 tablespoons unsalted butter, melted",
        "2 cups dark chocolate chips, melted",
        "1½ cups whipped cream",
        "1½ cups milk chocolate chips, melted",
        "2 cups whipped cream",
        "1 thick chocolate bar",
        "2 tablespoons cocoa powder"
    ],
    "recipeInstructionSteps": [
        "Make the crust: In a medium bowl, use a fork to combine the graham cracker crumbs and the butter until they are the texture of wet sand.",
        "Transfer the crust to an 8-inch (20 cm) springform pan and use the bottom of a wine glass or other flat instrument to press against the bottom.",
        "Make the dark chocolate mousse: In a medium bowl, let the melted dark chocolate chips cool to room temperature, then use a spatula to gently fold in whipped cream.",
        "Pour the dark chocolate mousse over the crust and smooth out the top as much as possible, then freeze for 15 minutes.",
        "Make the milk chocolate mousse: In a medium bowl, let the melted milk chocolate chips cool to room temperature, then use a spatula to gently fold in whipped cream.",
        "Pour the milk chocolate mousse over the dark chocolate layer and smooth the top with a spatula.",
        "Freeze for 2 hours, or until the mousse is set.",
        "Take a vegetable peeler and press it down along the edge of the chocolate bar to create mini chocolate spirals.  Make at least 2 tablespoons worth.",
        "Remove from the cake from the freezer and gently take the cake out of the springform pan.",
        "Sift the cocoa powder over the top of the cake, then sprinkle with the chocolate shavings.",
        "Pairs well with Cabernet Sauvignon.",
        "Enjoy!"
    ]
}