{
    "id": "berry-stuffed-french-toast-for-two",
    "link": "https://tasty.co/recipe/berry-stuffed-french-toast-for-two",
    "name": "Berry-Stuffed French Toast For Two Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/162573.jpg",
    "description": "Here's what you need: raspberry, blackberry, maple syrup, black raspberry liqueur, cream cheese, brioche bread, whole milk, large egg, black raspberry liqueur, salt, butter, heavy cream, maple syrup",
    "recipeCategory": "Breakfast",
    "recipeCuisine": "French",
    "recipeIngredient": [
        "1 cup raspberries",
        "1 cup blackberries",
        "2 tablespoons maple syrup, divided",
        "1 tablespoon black raspberry liqueur",
        "4 ounces cream cheese, softened",
        "4 slices of brioche bread",
        "½ cup whole milk",
        "1 large egg, beaten",
        "2 tablespoons black raspberry liqueur",
        "½ teaspoon salt",
        "2 tablespoons butter",
        "½ cup heavy cream",
        "1 tablespoon maple syrup"
    ],
    "recipeInstructionSteps": [
        "Make the filling: Add the raspberries, blackberries, black raspberry liqueur, and 1 tablespoon of maple syrup to a large bowl. Stir and let sit for 10 minutes for the berries to macerate.",
        "In a medium bowl, mix together the cream cheese and remaining tablespoon of maple syrup until smooth.",
        "Spread the filling evenly over the 4 slices of bread. Arrange some of the berries on 2 slices of the bread and top with the other slices of bread. Press to seal the pieces together.",
        "In a shallow dish, whisk together the milk, egg, black raspberry liqueur, and salt.",
        "Melt the butter on a griddle or in a large skillet over medium heat. Quickly dip both sides of the bread pockets in the milk mixture, then transfer to the pan and fry on each side for about 3 minutes, until golden brown.",
        "In a large bowl, beat the heavy cream until soft peaks form. Add the maple syrup and continue beating until the cream holds medium peaks.",
        "Serve the stuffed French toast with a dollop of maple whipped cream and a scoop of macerated berries with their soaking liquid.",
        "Enjoy!"
    ]
}