{
    "id": "french-toast-honey-toast",
    "link": "https://tasty.co/recipe/french-toast-honey-toast",
    "name": "French Toast Honey Toast Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/167233.jpg",
    "description": "Here's what you need: brioche bread, large egg, cinnamon, heavy cream, honey, cinnamon crunch cereal, whipped cream, fresh blueberry, fresh blackberry, fresh strawberry , fresh raspberry",
    "recipeCategory": "Breakfast",
    "recipeCuisine": "Japanese",
    "recipeIngredient": [
        "1 unsliced loaf of sandwich or brioche bread",
        "5 large eggs",
        "1 tablespoon cinnamon",
        "½ cup heavy cream",
        "¼ cup honey, plus more for serving",
        "1 cup cinnamon crunch cereal",
        "2 cups whipped cream",
        "Fresh blueberries, for serving",
        "Fresh blackberries, for serving",
        "Sliced fresh strawberries, for serving",
        "Fresh raspberries, for serving"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C). Line a baking sheet with parchment paper.",
        "Cut the loaf of bread in half crosswise. Flip one of the halves cut side up, and cut out the middle of the loaf, leaving about a ¼-inch (6 mm) border around the edge. From the outside of the loaf, about ½ -1 inch (1-2 cm) up from the bottom of one of the 4 sides, make a cut straight through to remove the center of the loaf.",
        "Cut the center of the loaf in half and slice into approximately 1x3-inch (2x7-cm) cm sticks . Repeat with the second half of the loaf.",
        "In a large bowl, whisk the eggs with the cinnamon, cream, and honey.",
        "Place the hollowed-out loaf on the prepared baking sheet and brush all over with the egg mixture.",
        "In a medium bowl, crush the cinnamon crunch cereal into coarse crumbs.",
        "Dip the sliced toast sticks in the egg mixture, then dredge in the crushed cereal. Add to the baking sheet in a single layer.",
        "Bake for 20 minutes, until golden brown.",
        "To assemble, filling the toasted, hollowed loaves with French toast sticks and berries. Top with whipped cream and a drizzle of honey.",
        "Enjoy!"
    ]
}