{
    "id": "baked-butternut-squash-risotto",
    "link": "https://tasty.co/recipe/baked-butternut-squash-risotto",
    "name": "Baked Butternut Squash “Risotto” Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/183572.jpg",
    "description": "Here's what you need: olive oil, large yellow onion, garlic, fresh rosemary, short-grain brown rice, vegetable broth, butternut squash, salt, pepper, fresh sage, freshly grated parmesan cheese, unsalted butter",
    "recipeCategory": "Dinner",
    "recipeCuisine": "",
    "recipeIngredient": [
        "Olive oil, to taste",
        "½ large yellow onion, diced",
        "3 cloves garlic, minced",
        "½ tablespoon fresh rosemary, minced",
        "1½ cups short-grain brown rice",
        "5½ cups vegetable broth, divided",
        "2 cups diced butternut squash",
        "Salt, to taste",
        "Pepper, to taste",
        "1 bunch fresh sage leaves, optional",
        "¾ cup Parmesan cheese, freshly grated",
        "2 tablespoons unsalted butter"
    ],
    "recipeInstructionSteps": [
        "Place an oven rack at the bottom of the oven and another at the top. Preheat the oven to 375°F (190°C). Line a baking sheet with parchment paper.",
        "Heat the olive oil in a Dutch oven or large oven-safe pot over medium heat.  Add the onion and cook for about 5 minutes, until starting to brown. ",
        "Add the garlic and rosemary, and cook for 2 minutes, until fragrant.",
        "Add the rice and 4 cups (960 ml) of vegetable broth, and stir to combine. Bring to a boil, then cover.",
        "Place the risotto on the bottom rack of the oven. Bake for 70 minutes, until all of the liquid has been absorbed by the rice. (It will appear dry, but you’ll be adding moisture back later in the recipe.)",
        "Add the butternut squash to the prepared baking sheet. Drizzle with olive oil, then season with salt and pepper. Toss to coat.",
        "Place the squash on the top rack of the oven, above the risotto. Bake for 45 minutes, or until the edges of the squash begin to brown and caramelize.",
        "Make the fried sage garnish, if using: In a small pot or pan over medium-high heat, add enough olive oil for the sage leaves to sit in. Once hot, carefully place a few leaves into the oil with tongs. Fry for 10-20 seconds, until the leaves are crispy but not browned. ",
        "Carefully remove from the oil and drain on a paper towel-lined plate. Sprinkle with salt and set aside.",
        "Remove the risotto from the oven. Add the remaining vegetable broth, the Parmesan, and butter. Stir until creamy. (The liquid will absorb into the rice as you stir).",
        "Add the butternut squash and stir to incorporate.",
        "Serve immediately with fried sage for garnish.",
        "Enjoy!"
    ]
}