{
    "id": "one-pot-bacon-and-wild-mushroom-risotto",
    "link": "https://tasty.co/recipe/one-pot-bacon-and-wild-mushroom-risotto",
    "name": "One-Pot Bacon And Wild Mushroom Risotto Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/e503144861424360808336aeb999125e/BF_THUMB_Square.jpg",
    "description": "Here's what you need: olive oil, medium onion, bacon, wild mushrooms, arborio rice, dry white wine, chicken broth, parmesan cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "3 tablespoons olive oil",
        "1 medium onion, sliced",
        "n/a",
        "8 ounces sliced wild mushrooms, such as porcini or shiitake",
        "1½ cups arborio rice",
        "½ cup dry white wine, such as Sauvignon Blanc",
        "5 cups chicken broth",
        "½ cup parmesan cheese, plus more for garnish"
    ],
    "recipeInstructionSteps": [
        "In a 5-quart Dutch oven, heat the olive oil over medium heat.",
        "Add the onion and cook 3-4 minutes until soft and slightly transparent.",
        "Add the bacon and stir constantly until it starts to crisp.",
        "Add the mushrooms and cook for an additional 2 minutes.",
        "Add the arborio rice and cook for one minute, stirring constantly so the oil coats the grains.",
        "Stir in the white wine and simmer 2-3 minutes, stirring occasionally.",
        "Add one cup (235ml) of the chicken stock and simmer over medium heat for about 5 minutes, stirring occasionally.",
        "Once the rice absorbs most of the liquid, continue to add 1-2 cups (235-470ml) of stock at a time until the liquid is absorbed and the rice is cooked through, about 25-30 minutes total.",
        "NOTE: The risotto should be al dente and fall back in on itself when you run the spoon along the bottom of the pot.",
        "Stir in the Parmesan cheese and remove from the heat.",
        "Serve and garnish with extra Parmesan cheese.",
        "Enjoy!"
    ]
}