{
    "id": "wolfgang-pucks-tomato-risotto-with-shrimp",
    "link": "https://tasty.co/recipe/wolfgang-pucks-tomato-risotto-with-shrimp",
    "name": "Wolfgang Puck’s Tomato Risotto With Shrimp Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/145979.jpg",
    "description": "Here's what you need: olive oil, garlic, shallot, arborio rice, dry white wine, chicken stock, tomato soup, unsalted butter, parmesan cheese, kosher salt, white pepper, large shrimp, green peas, fresh parsley leaf",
    "recipeCategory": "Lunch",
    "recipeCuisine": "",
    "recipeIngredient": [
        "6 tablespoons olive oil, divided",
        "2 teaspoons minced garlic, divided",
        "1 tablespoon minced shallots",
        "1 cup arborio rice",
        "¼ cup dry white wine",
        "2-2½ cups chicken stock, boiling",
        "1 14.5-ounce can tomato basil bisque or creamy tomato soup",
        "6 tablespoons (¾ stick) unsalted butter, cubed",
        "¼ cup freshly grated Parmesan cheese",
        "Kosher salt, to taste",
        "Freshly ground white pepper, to taste",
        "8 large shrimp, peeled, deveined, tails on, and butterflied",
        "¼ cup green peas",
        "Minced fresh parsley leaves, for garnish"
    ],
    "recipeInstructionSteps": [
        "In a medium skillet, heat 3 tablespoons olive oil over medium heat. Add the shallots and 1 teaspoon minced garlic, and sauté until soft, but not brown.",
        "Add the rice and sauté until well-coated with the oil. Deglaze the pan with the wine and reduce until the pan is almost dry.",
        "Using a 4-ounce (115 g) ladle, add one ladle of boiling stock to the rice. Stir the rice until the stock is absorbed and the rice is almost dry. Continue adding stock 1 ladle at a time until the rice is tender, but still firm. It should be moist and creamy, but not runny.",
        "Add the tomato basil bisque and stir to combine.",
        "Remove the risotto from the heat, and stir in the butter and the Parmesan cheese.  Season with salt and pepper.",
        "Heat the remaining 3 tablespoons of olive oil in a medium skillet over medium heat. Add the remaining teaspoon of minced garlic and the shrimp. Season with salt and white pepper. Add the peas and cook until the shrimp is pink and opaque, 4-5 minutes.",
        "Remove the shrimp from the heat and sprinkle with parsley. Divide the risotto between 2 warm serving plates. Top each with half the shrimp and peas. Serve immediately.",
        "Enjoy"
    ]
}