{
    "id": "chocolate-peanut-butter-cake-in-a-jar",
    "link": "https://tasty.co/recipe/chocolate-peanut-butter-cake-in-a-jar",
    "name": "Chocolate Peanut Butter Cake In A Jar Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/ade7bc6ec8fb429fac5dba865f1ef7d5/BFV44252PantryPrepCakeInAJar4WaysFBFinalupdated.jpg",
    "description": "Here's what you need: angel food cake mix, chocolate cake mix, peanut butter chips, milk chocolate chips, water, whipped cream, chocolate syrup, jar, cupcake liner",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "2 tablespoons angel food cake mix",
        "2 tablespoons chocolate cake mix",
        "2 teaspoons peanut butter chips, plus more for serving (optional)",
        "1 teaspoon milk chocolate chips",
        "2 tablespoons plus 1 teaspoon water",
        "Whipped cream, for serving (optional)",
        "Chocolate syrup, for serving (optional)",
        "1 8-ounce microwave- and oven-safe jar",
        "1 cupcake liner"
    ],
    "recipeInstructionSteps": [
        "Add the angel food cake mix and chocolate cake mix to a jar. Place a cupcake liner over the cake mix and add the peanut butter chips and chocolate chips. Cover with the lid.",
        "Store in the pantry for up to 3 months.",
        "When ready to eat, remove the lid and cupcake liner with the chips from the jar. Pour the water into the dry cake mix. Mix thoroughly, making sure to scrape the dry mix from the bottom of the jar.",
        "Microwave for 20 seconds.",
        "Pour the peanut butter and chocolate chips into the jar. Stir the chips into the cake gently, being careful not to push them to the bottom because they will naturally sink into the cake while cooking.",
        "Microwave for another 40 seconds, until cooked through.",
        "Top with whipped cream, chocolate syrup, and peanut butter chips, if desired.",
        "Serve immediately.",
        "Enjoy!"
    ]
}