{
    "id": "cookies-cream-cheesecake-bundt-cake",
    "link": "https://tasty.co/recipe/cookies-cream-cheesecake-bundt-cake",
    "name": "Cookies &amp; Cream Cheesecake Bundt &#x27;Box&#x27; Cake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/ed9d0f35b3224f14a768721cfa324988/BFV23341_OreoCheesecakeBundtCake-Thumb.jpg",
    "description": "Here's what you need: cream cheese, powdered sugar, vanilla extract, chocolate cake mix, chocolate sandwich cookie, high quality chocolate, heavy cream",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "16 ounces cream cheese, softened",
        "½ cup powdered sugar",
        "1 teaspoon vanilla extract",
        "1 box chocolate cake mix, prepared accordingly to box instructions",
        "10 chocolate sandwich cookies",
        "8 ounces high quality chocolate, chopped finely (60% cocoa content or higher)",
        "2 cups heavy cream"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C).",
        "In a medium bowl, whisk together the cream cheese, powdered sugar, and vanilla extract, stirring until smooth.",
        "Pour half of the cake batter into the bottom of a greased bundt cake pan, smoothing it with a spatula.",
        "With an ice cream scoop, scoop the cream cheese mixture evenly onto the cake batter, making sure that it does not touch the sides of the cake pan.",
        "Place a chocolate sandwich cookie on top of the cream cheese scoops, making a circle around the ring of the pan.",
        "Pour the rest of the cake batter on top of the cookies, smoothing it evenly.",
        "Bake for 45 minutes, then cool completely.",
        "Invert the cake onto a wire rack set on top of a baking tray.",
        "To make the glaze, microwave the chocolate and the cream together in 30-second intervals, stirring in between, until the glaze is smooth and glossy.",
        "Pour the glaze over the cake, letting the excess drip off the wire rack and onto the baking tray.",
        "Once the glaze has set, slice the cake, and serve,",
        "Enjoy!"
    ]
}