{
    "id": "flourless-dark-chocolate-orange-cake",
    "link": "https://tasty.co/recipe/flourless-dark-chocolate-orange-cake",
    "name": "Flourless Dark Chocolate Orange Cake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/0bd784b249424f6cbd9c15e08551069a/FB_Flourless_Dark_Chocolate_Orange_Cake_B.jpg",
    "description": "Here's what you need: dark chocolate, unsalted butter, egg yolk, orange zest, egg white, sugar, heavy cream, orange extract, powdered sugar",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "8 ounces dark chocolate, cut into chunks",
        "6 tablespoons unsalted butter, cubed",
        "6 egg yolks",
        "2 tablespoons orange zest",
        "6 egg whites",
        "½ cup sugar",
        "1 cup heavy cream",
        "1 teaspoon orange extract",
        "2 tablespoons powdered sugar"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 275°F (135°C) and grease a 9-inch (23 cm) springform pan.",
        "In a large mixing bowl, add the chocolate and butter. Melt in the microwave at 15-second intervals. Stir often and make sure the chocolate doesn&#x27;t burn, then set aside to cool for a few minutes",
        "Add the egg yolks and the orange zest to the chocolate mixture and stir to combine.",
        "In a separate mixing bowl, beat the egg whites on high speed with an electric mixer until very white and foamy. Gradually add the sugar. Continue beating on high speed until soft peaks form.",
        "Gently fold ¼ of the egg white mixture to the chocolate mixture. Gently fold in the remaining egg white mixture. Be careful not to deflate the eggs. Stir until fully combined. Some streaks are fine.",
        "Pour into prepared pan.",
        "Bake in the oven for 45-50 minutes or until the sides of the cake gently pull away from the pan.",
        "For the orange whipped cream, beat together heavy cream, orange extract, and sugar.",
        "Top with whipped cream and garnish with orange zest.",
        "Enjoy!"
    ]
}