{
    "id": "ice-cream-box-cake-pops",
    "link": "https://tasty.co/recipe/ice-cream-box-cake-pops",
    "name": "Ice Cream &#x27;Box&#x27; Cake Pops Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/162447.jpg",
    "description": "Here's what you need: yellow cake mix, vanilla frosting, vanilla ice cream, chocolate cookie, chocolate ice cream, white chocolate, whipped cream, sprinkles, ice pop stick, foam board",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 15-ounce box of yellow cake mix, prepared according to package instructions, cooled",
        "½ cup vanilla frosting",
        "1 cup vanilla ice cream, softened",
        "1 cup crushed chocolate cookies",
        "1 cup chocolate ice cream, softened",
        "2 cups plus 2 tablespoons melted white chocolate, divided",
        "Whipped cream, for decorating (optional)",
        "Sprinkles, for decorating (optional)",
        "24 ice pop sticks",
        "Foam board (optional)"
    ],
    "recipeInstructionSteps": [
        "In a large bowl, crumble the cake into fine uniform crumbs. Add the vanilla frosting and mix thoroughly.",
        "Press 1 tablespoon of the cake mixture into each of the divots of an ice cube tray.",
        "Spread 1 tablespoon of vanilla ice cream over the cake. Sprinkle with 1 teaspoon of crushed cookies.",
        "Spread 1 tablespoon of chocolate ice cream on top (the ice cream might melt and mix slightly).",
        "Freeze for 30 minutes.",
        "Dip the ice pop sticks into 2 tablespoons of melted white chocolate and press them into the centers of the ice cream cake pops. Freeze for at least 8 hours, until solid.",
        "To make the cake pop holder, cut 3 2-foot by 5-inch (½ meter by 13 cm) strips of foam board. Place tape in between each layer, one on top of the other, so you have 3 layers of foam board. Carefully create 24  ½-inch (1 cm) slits 2 inches (2 cm) apart with a precision knife. Cut deep enough so you puncture the second layer of foam board. Each cake pop should easily push into the board and stand upright.",
        "Use a butter knife or offset spatula to loosen the ice cream cake pops from the ice cube tray.",
        "Add the remaining melted white chocolate to a tall drinking glass. Working 1 at a time, pull each cake pop from the ice cube mold and dip into the melted white chocolate. Place the cake pops in the cake pop holder or on a plate and keep in the freezer until ready to serve.",
        "Decorate the cake pops with whipped cream and sprinkles, if desired.",
        "Serve immediately.",
        "Enjoy!"
    ]
}