{
    "id": "build-your-own-french-bread-pizzas",
    "link": "https://tasty.co/recipe/build-your-own-french-bread-pizzas",
    "name": "Build-Your-Own French Bread Pizzas Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/6256bc05e33b4777a4dd0a652b3734fe/BFV46558EasyWeeknightMealstoMakeWithYourKidsFBV2.jpg",
    "description": "Here's what you need: baguette, tomato, shredded mozzarella cheese, cherry tomato, mozzarella ball, fresh basil, red pepper, BBQ sauce, rotisserie chicken, shredded mozzarella cheese, medium red onion, scallion",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 baguette, sliced in half crosswise and lengthwise (4 pieces total)",
        "1 cup tomato sauce",
        "¾ cup shredded mozzarella",
        "Halved cherry tomatoes",
        "Mozzarella balls",
        "1 tablespoon chopped fresh basil (optional)",
        "½ teaspoon red pepper flakes (optional)",
        "1 cup BBQ sauce",
        "1 cup shredded rotisserie chicken",
        "¾ cup shredded mozzarella",
        "½ medium red onion, thinly sliced",
        "2 tablespoons sliced green onions (optional)"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C) and line 2 baking sheets with parchment paper.",
        "Arrange the baguette pieces on the baking sheets, cut-side up.",
        "To make the margherita pizzas, spread 2 baguette pieces with the tomato sauce and top with the shredded mozzarella, cherry tomatoes, mozzarella balls, and basil.",
        "To make the BBQ chicken pizzas, spread 2 baguette pieces with the BBQ sauce and top with the shredded chicken, shredded mozzarella, and red onion.",
        "Bake until the cheese is browned and bubbling, about 10 minutes.",
        "If using, garnish the margherita pizzas with chopped basil and red pepper flakes and the BBQ chicken pizzas with green onions.",
        "Note: This recipe makes 2 margherita pizzas and 2 BBQ chicken pizzas but feel free to mix, match, and set out ingredients your family loves to customize them to everyone’s tastes.",
        "*Vegan/Vegetarian Substitution: Omit the chicken and replace the shredded mozzarella with your favorite vegan cheese alternative.",
        "Enjoy!"
    ]
}