{
    "id": "rainbow-veggie-cauliflower-pizza",
    "link": "https://tasty.co/recipe/rainbow-veggie-cauliflower-pizza",
    "name": "Rainbow Cauliflower Pizza Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/3a8789cdbff94866a16b12d3a07481d4/Thumb_1.jpg",
    "description": "Here's what you need: cauliflower, dried oregano, dried basil, garlic powder, red pepper flakes, sea salt, parmesan cheese, large egg, pizza sauce, low-fat mozzarella, sun-dried tomato, orange bell pepper, yellow bell pepper, baby spinach, red onion",
    "recipeCategory": "Dinner",
    "recipeCuisine": "",
    "recipeIngredient": [
        "1 head cauliflower, trimmed, cut into pieces",
        "½ teaspoon oregano",
        "½ teaspoon basil",
        "½ teaspoon garlic powder",
        "¼ teaspoon red pepper flakes",
        "½ teaspoon sea salt",
        "¼ cup parmesan",
        "1 large egg",
        "Pizza sauce",
        "Low-fat mozzarella cheese, shredded",
        "Sun-dried tomatoes",
        "1 orange bell pepper, sliced",
        "1 yellow bell pepper, sliced",
        "3 ounces prewashed baby spinach, chopped",
        "¼ red onion"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 450˚F (240˚C). Line a baking sheet with parchment paper.",
        "Place cauliflower pieces in the bowl of food processor and pulse for 30 seconds, or until cauliflower is broken down to rice-size pieces.",
        "Transfer the cauliflower to a microwave-safe bowl and microwave on high for 3 minutes. Let cool slightly.",
        "Transfer the cooked cauliflower to a clean dish towel and wring out the excess water.",
        "Place cauliflower in a large bowl. Add the oregano, basil, garlic powder, sea salt, red pepper flakes, Parmesan, and egg. Mix thoroughly to combine.",
        "Transfer the cauliflower mixture to the baking sheet and pat out into a round disk, about ½ inch thick and 10 inches in diameter.",
        "Bake for 25-30 minutes. Remove from oven.",
        "Spread the pizza sauce over the crust. Sprinkle with mozzarella cheese and top with the sun-dried tomatoes, bell peppers, and spinach.",
        "Bake for 8-10 minutes, or until the spinach is wilted and the cheese is melted.",
        "Top with more Parmesan cheese, then slice and serve.",
        "Enjoy!"
    ]
}