{
    "id": "pineapple-fried-rice",
    "link": "https://tasty.co/recipe/pineapple-fried-rice",
    "name": "Pineapple Fried Rice Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/38cd7c62738447f48ba08679044ea0bf/FB.jpg",
    "description": "Here's what you need: pineapple, vegetable oil, egg, king prawn, garlic, red chili, onion, rice, mixed vegetable, fish sauce, lime, spring onion",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Thai",
    "recipeIngredient": [
        "1 pineapple",
        "8 tablespoons vegetable oil, divided",
        "2 eggs, beaten",
        "200 grams king prawns",
        "3 cloves garlic, minced",
        "1 red chili, finely diced",
        "1 onion, finely chopped",
        "400 grams cooked rice",
        "150 grams mixed vegetables",
        "1 tablespoon fish sauce",
        "Juice of 1 lime",
        "2 spring onions, finely chopped"
    ],
    "recipeInstructionSteps": [
        "Using a sharp knife carefully cut the pineapple in half lengthways.",
        "Using the tip of a knife, cut around the edge of the pineapple being careful not to cut through the skin.",
        "Slice down and across the pineapple flesh then scoop out the pineapple cubes with a spoon. Discard the core and set the flesh aside.",
        "In a large wok, heat 2 tablespoons of oil over a medium heat. Fry the beaten eggs in a hot wok.",
        "Once cooked, push the eggs to a side and add in the prawns to the other side.",
        "Fry until the prawns are just cooked. Remove eggs and prawns from the wok and set aside.",
        "Heat the wok until smoking hot and pour in 6 tablespoons of oil.",
        "Add the garlic, chilli, and onion and stir until fragrant.",
        "Add in the rice and vegetables, and fry until rice turns slightly brown and the veggies are thoroughly cooked.",
        "Add the cooked eggs and prawns, add in the fish sauce and the prepared pineapple flesh and stir until everything is well mixed together.",
        "Serve in the empty pineapple halves, along with some lime juice and spring onions.",
        "Enjoy!"
    ]
}