{
    "id": "decadent-dairy-free-carrot-cake",
    "link": "https://tasty.co/recipe/decadent-dairy-free-carrot-cake",
    "name": "Decadent Dairy-Free Carrot Cake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/150729.jpg",
    "description": "Here's what you need: raw cashew, hot water, full-fat coconut milk, powdered sugar, maple syrup, coconut oil, lemon juice, vanilla extract, apple cider vinegar, salt, flour, brown sugar, baking soda, baking powder, cinnamon, nutmeg, salt, almond milk, coconut oil, unsweetened applesauce, maple syrup, vanilla extract, apple cider vinegar, carrot, raisin, carrot, walnuts",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "",
    "recipeIngredient": [
        "4 cups raw cashews",
        "n/a",
        "Cream from the top of 1 15-ounce can of full-fat coconut milk",
        "½ cup powdered sugar",
        "1 cup maple syrup",
        "¾ cup coconut oil, melted",
        "3 tablespoons lemon juice",
        "1 tablespoon vanilla extract",
        "½ tablespoon apple cider vinegar",
        "1 pinch salt",
        "3½ cups flour of choice (we used whole wheat)",
        "1 cup brown sugar",
        "1 tablespoon baking soda",
        "1½ tablespoons baking powder",
        "1 tablespoon cinnamon",
        "2 teaspoons nutmeg",
        "1 pinch of salt",
        "3 cups almond milk",
        "¾ cup melted coconut oil",
        "1 cup unsweetened applesauce",
        "¾ cup maple syrup",
        "1 tablespoon vanilla extract",
        "1 tablespoon apple cider vinegar",
        "2 cups finely grated carrots",
        "1 cup raisins, optional",
        "1 carrot, for garnish",
        "½ cup chopped walnuts, for garnish"
    ],
    "recipeInstructionSteps": [
        "In a large bowl, add the cashews and enough hot water to cover them. Let soak for at least 1 hour.",
        "Rinse and drain the cashews, then add them to a food processor or blender. Add the coconut cream, powdered sugar, maple syrup, coconut oil, lemon juice, vanilla extract, apple cider vinegar, and salt. Blend until completely smooth, scraping down the sides as necessary.",
        "Transfer the cashew frosting to a bowl and refrigerate while you bake the cake.",
        "Preheat the oven to 350°F (180°C). Grease 3 separate 8-inch (20 cm) round cake pans and set aside.",
        "In a large bowl, add the flour, brown sugar, baking soda, baking powder, cinnamon, nutmeg, and salt. Whisk to combine.",
        "In a separate large bowl, add the almond milk, coconut oil, applesauce, maple syrup, vanilla extract, and apple cider vinegar. Whisk to combine.",
        "In two batches, add the dry mixture to the wet mixture, folding with a spatula until combined. Some clumps are okay.",
        "Add the grated carrots and raisins and fold them in.",
        "Divide the batter evenly between the 3 pre-greased cake pans and bake for 35 minutes, or until a toothpick comes out clean. Cool completely.",
        "Remove the cashew frosting from the fridge and mix it up well.",
        "Choose which cake will be your bottom layer and cover evenly with about ⅓ of the cashew frosting. Top with the second layer, frosting evenly again. Add the final layer and frost the top of the cake generously",
        "Grate a carrot over the top of the frosting and sprinkle with chopped walnuts for garnish.",
        "Refrigerate until ready to serve.",
        "Enjoy!"
    ]
}