{
    "id": "healthy-carrot-cake-muffins",
    "link": "https://tasty.co/recipe/healthy-carrot-cake-muffins",
    "name": "Healthy Carrot Cake Muffins Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/89cdb0abf6c540889ac968531874a83e/BFV18033_HealthyCarrotCupcakesThumb.jpg",
    "description": "Here's what you need: egg, greek yogurt, maple syrup, milk, vanilla extract, carrot, whole wheat flour, baking powder, ground cinnamon, light cream cheese, maple syrup, vanilla extract",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "3 eggs",
        "½ cup Greek yogurt",
        "½ cup maple syrup",
        "¼ cup milk",
        "1 teaspoon vanilla extract",
        "2 carrots, shredded",
        "1½ cups whole wheat flour",
        "1¾ teaspoons baking powder",
        "1½ teaspoons ground cinnamon",
        "8 ounces light cream cheese, softened",
        "¼ cup maple syrup",
        "1 teaspoon vanilla extract"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350°F (175°C).",
        "In a large bowl, whisk the eggs until light and fluffy.",
        "Add in the Greek yogurt and whisk again until the mixture is smooth and fluffy.",
        "Pour in the maple syrup, milk, and vanilla extract. Beat the mixture again until smooth.",
        "Add the shredded carrots, whole wheat flour, baking powder, and cinnamon over the wet  ingredients. Using a rubber spatula, fold the wet and dry ingredients together just until combined.",
        "Using a medium ice cream scoop, portion the batter into a greased 12-cup muffin tin.",
        "Bake for 20 minutes, until the muffins have risen and set.",
        "For the frosting, beat the cream cheese in a small bowl until smooth.",
        "Add in the maple syrup and vanilla and beat again until the mixture is well combined.",
        "Once the muffins have cooled, use a small ice cream scoop to spoon a bit of the frosting on top of the muffins. Gently tap the muffins on the counter to smooth out the layer of frosting on top.",
        "Enjoy!"
    ]
}