{
    "id": "protein-packed-breakfast-bars",
    "link": "https://tasty.co/recipe/protein-packed-breakfast-bars",
    "name": "Protein-Packed Breakfast Bars Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/159415.jpg",
    "description": "Here's what you need: flax meal, water, rolled oats, quinoa, baking powder, salt, maple syrup, refined coconut oil, vanilla extract, ripe banana, peanut butter chocolate candy, peanut butter, mini chocolate chips, gala apple, walnuts, cinnamon, nutmeg, carrot, cinnamon, nutmeg, almond butter, almond butter, strawberry, raspberry, blueberry, nonstick cooking spray",
    "recipeCategory": "Breakfast",
    "recipeCuisine": "",
    "recipeIngredient": [
        "¼ cup flax meal",
        "¾ cup water",
        "6 cups rolled oats",
        "6 cups cooked quinoa",
        "4 teaspoons baking powder",
        "1 teaspoon salt",
        "1 cup maple syrup",
        "½ cup melted refined coconut oil",
        "2 teaspoon vanilla extract",
        "4 ripe mashed bananas",
        "Peanut Butter Chocolate Chip",
        "6 tablespoons peanut butter",
        "5 tablespoons mini chocolate chips",
        "¾ cup diced gala apple",
        "6 tablespoons walnuts, chopped",
        "1½ tablespoons cinnamon",
        "¼ teaspoon nutmeg",
        "¾ cup grated carrots",
        "3 teaspoons cinnamon",
        "¼ teaspoon nutmeg",
        "3 tablespoons almond butter",
        "3 tablespoons almond butter",
        "⅓ cup diced strawberries",
        "⅓ cup raspberries",
        "⅓ cup blueberries",
        "Nonstick cooking spray"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 375°F (190°C).",
        "To make the flax eggs, combine the flax meal and water in a small bowl and mix well. Set aside for 10 minutes to thicken.",
        "In a large bowl, combine the oats, quinoa, baking powder, salt, maple syrup, coconut oil, vanilla, flax eggs, and bananas, and mix until well-combined.",
        "Divide the base dough equally between 4 medium bowls.",
        "Add the peanut butter and chocolate chips to a bowl and mix until combined.",
        "Add the apple, walnuts, cinnamon, and nutmeg to another bowl and mix until combined.",
        "Add the carrots, cinnamon, nutmeg, and almond butter to another bowl and mix until combined.",
        "Add the almond butter, strawberries, raspberries, and blueberries to the last bowl and mix until combined.",
        "Grease 2, 9x13-inch (23x33-cm) baking pans with nonstick spray. Transfer the bar mixtures to the pans, packing each mixture into half of a pan with a spoon or spatula.",
        "Bake for 25-30 minutes, until the edges are slightly golden brown.",
        "Remove the pans from the oven and let the bars cool for 20 minutes, then refrigerate for at least 30 minutes or up to 5 days. Gently cut each flavor into 6 bars, then remove from the pans with a spatula.",
        "Enjoy!"
    ]
}