{
    "id": "salmon-meal-prep-two-ways",
    "link": "https://tasty.co/recipe/salmon-meal-prep-two-ways",
    "name": "Salmon Meal Prep for Two Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/31c9bfba5b68400e87c90dd57ac89c30/BFV21677_Salmon_Meal_Prep_Two_Ways_FB_THUMB.jpg",
    "description": "Here's what you need: soy sauce, balsamic vinegar, olive oil, garlic, salmon, paprika, garlic powder, onion powder, salt, pepper, salmon, large carrot, green beans, asparagus, medium yellow squash, olive oil, salt, pepper",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "½ cup soy sauce",
        "½ cup balsamic vinegar",
        "¼ cup olive oil",
        "2 garlic cloves, minced",
        "2 6-ounce salmon filets",
        "1 teaspoon paprika",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1 teaspoon salt",
        "½ teaspoon pepper",
        "2 6-ounce salmon filets",
        "1 large carrot, thinly sliced on the bias",
        "5 ounces green beans, ends trimmed",
        "5 ounces asparagus, ends trimmed and chopped",
        "1 medium yellow squash, chopped",
        "Olive oil, to taste",
        "Salt, to taste",
        "Pepper, to taste"
    ],
    "recipeInstructionSteps": [
        "In a square baking dish, combine the soy sauce, balsamic vinegar, oil, and garlic, and whisk to combine.",
        "Put 2 of the salmon fillets in the soy and balsamic mixture, making sure all sides are coated.",
        "Transfer to the refrigerator, marinading for 30 minutes to 2 hours.",
        "Preheat oven to 450˚F (230˚C).",
        "In a small bowl, mix together the paprika, garlic powder, onion powder, salt, and pepper.",
        "Evenly coat the remaining 2 salmon filets with the spice rub.",
        "Place the salmon and vegetables on a parchment paper-lined baking tray.",
        "Drizzle olive oil and sprinkle salt and pepper to taste over the vegetables.",
        "Bake for 11 minutes per inch (2 cm) of salmon thickness.",
        "Divide the salmon and vegetables into 4 containers, mix and matching the vegetables to your liking.",
        "Refrigerate for up to 3 days.",
        "Enjoy!"
    ]
}