{
    "id": "sartu-di-riso-as-made-by-antoni-porowski",
    "link": "https://tasty.co/recipe/sartu-di-riso-as-made-by-antoni-porowski",
    "name": "Sartù Di Riso By Antoni Porowski Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/155059.jpg",
    "description": "Here's what you need: olive oil, onion, carrot, celery, garlic, salt, bay leaf, tomato paste, canned whole peeled tomato, parmesan rind, fresh basil, arborio rice, low-sodium chicken broth, large egg, grated parmesan cheese, unsalted butter, italian breadcrumb, fresh mozzarella cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Italian",
    "recipeIngredient": [
        "1 tablespoon olive oil, plus more as needed",
        "n/a",
        "1 cup diced carrot",
        "½ cup diced celery",
        "2 cloves garlic, minced",
        "Salt, to taste",
        "4 bay leaves, divided",
        "1 tablespoon tomato paste",
        "2 28-ounce cans whole peeled tomatoes",
        "1 Parmesan rind",
        "1 bunch basil, plus more for garnish",
        "4 cups arborio rice",
        "5 cups low-sodium chicken or vegetable stock",
        "2 large eggs",
        "1 cup grated Parmesan,, plus more for garnish",
        "2 tablespoons unsalted butter",
        "1 cup Italian seasoned bread crumbs",
        "1 ball fresh mozzarella cheese"
    ],
    "recipeInstructionSteps": [
        "Heat the olive oil in a large pot over medium-high heat. Add the onion, carrot, and celery, stirring occasionally, until the onions are translucent, 3-5 minutes.",
        "Add a bit more oil, if needed, then add the garlic, a pinch of salt, 2 bay leaves, and the tomato paste. Stir until the tomato paste begins to caramelize on the bottom of the pan, 1-2 minutes.",
        "Add the canned tomatoes and break them apart with tongs or the back of a wooden spoon.",
        "Add the Parmesan rind and basil, burying them into the sauce.",
        "Reduce the heat to low and simmer for 30 minutes until the sauce has thickened and the flavors have developed. Remove and discard the Parmesan rind, bay leaves, and basil. Set the sauce aside to cool.",
        "Prepare the rice. In a large pot over medium-high heat, add the rice and stock and stir to combine.",
        "Add the 2 remaining  bay leaves and a pinch of salt.",
        "Bring to a boil, then immediately cover and reduce down to a simmer.",
        "Simmer for 15 minutes without removing the lid.",
        "After 15 minutes remove from the rice from the heat, stir, and transfer to a large bowl to cool for 5-10 minutes.",
        "Preheat the oven to 400˚F (200˚C)",
        "Once the rice has cooled, taste to check if it needs more salt, then add the eggs and grated Parmesan cheese. Mix thoroughly with your hands.",
        "Generously coat the inside of a bundt pan with butter.",
        "Add the breadcrumbs and tilt the pan around to coat. Once well-coated, tap out excess crumbs into a bowl and reserve.",
        "Using your hands, line the bundt pan with an even layer of the rice, bringing it up to about ½ an inch (1 cm) from the top of the pan.",
        "Tear apart the mozzarella and layer it over the rice.",
        "Cover with a layer of tomato sauce.",
        "Top with a layer of rice mixture and smooth with the back of a spoon to seal in the sauce completely.",
        "Top with reserved bread crumbs and brush with oil or spray with cooking spray to ensure a nice crust forms.",
        "Bake for 30-35 minutes, until golden brown and edges have crisped up..",
        "Remove from the oven and cool for about 10 minutes before flipping out of the pan.",
        "Fill the cavity with any remaining tomato sauce and garnish with basil, Parmesan, and a drizzle of olive oil.",
        "Slice and serve.",
        "Enjoy!"
    ]
}