{
    "id": "easy-homemade-potato-gnocchi",
    "link": "https://tasty.co/recipe/easy-homemade-potato-gnocchi",
    "name": "Easy Homemade Potato Gnocchi Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/926dbe7dcb454e079331930ced3b4e5c/FB_Thumb.jpg",
    "description": "Here's what you need: medium russet potato, salt, pepper, egg, all-purpose flour, butter, sage leaves",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "3-4 small or medium russet potatoes",
        "1 teaspoon salt",
        "1 teaspoon pepper",
        "1 egg",
        "1-1½  cups flour",
        "2 tablespoons of butter (for pan frying)",
        "Sage (for pan frying)"
    ],
    "recipeInstructionSteps": [
        "Add the potatoes to a large pot of cool salted water. Bring the water to a boil and cook for 20-25 minutes, or until a fork can easily pierce a potato. Drain the potatoes and set aside until cool enough to handle but still warm.",
        "Using a peeler or your fingers, remove the skin from the potatoes. In a medium bowl, mash the potatoes until all lumps are gone. Add the salt and pepper and mix well. Make a well in the center of the potatoes and crack an egg into it. Whisk the eggs briefly. Then, using your hands, gently mix it into the potatoes until evenly distributed.",
        "Put 1 cups of flour onto a clean surface and turn out the potato dough onto it, keeping the remaining ½ cup close by in case you need it. Working quickly and carefully, knead the dough, only incorporating as much flour as you need along the way until the dough loses stickiness and becomes more solid. Slice the dough into 4 parts. Roll out 1 part into a long rope, about 1 inch wide, cutting in half and working with 1 half at a time if the rope is becoming too long. Slice the rope into ½-inch squares and set aside on a lightly floured surface. Repeat with the remaining dough.",
        "If desired, place a fork on your work surface and slide each gnocchi square from the base of the fork prongs to the top so they make a decorative shape.",
        "Bring a large pot of salted water to a boil and add the gnocchi in batches, stirring gently once or twice to ensure they are not sticking. Boil until they float to the surface; after another 15-30 seconds in the water, remove.",
        "In a pan over medium heat, melt butter and add the sage. Add the gnocchi and toss until lightly golden.",
        "Enjoy!"
    ]
}