{
    "id": "creme-brulee-french-toast",
    "link": "https://tasty.co/recipe/creme-brulee-french-toast",
    "name": "Crème Brûlée French Toast Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/158669.jpg",
    "description": "Here's what you need: heavy cream, sugar, cinnamon, large egg yolk, vanilla extract, brioche bread, strawberry, whipped cream",
    "recipeCategory": "Breakfast",
    "recipeCuisine": "",
    "recipeIngredient": [
        "4 cups heavy cream",
        "1¼ cups sugar, divided",
        "1 tablespoon cinnamon",
        "6 large egg yolks",
        "2 teaspoons vanilla extract",
        "18 slices brioche bread",
        "½ pound strawberries",
        "1 cup whipped cream"
    ],
    "recipeInstructionSteps": [
        "Pour the heavy cream into a 9x13-inch (23x33 cm) baking dish.",
        "Mix 1 cup of sugar (200 g) and the cinnamon in a small bowl and add to the cream, followed by the egg yolks and vanilla. Whisk well to combine.",
        "Dip each slice of bread into the cream mixture, coating both sides well. Place the dipped bread on the wire rack set over the baking sheet. Bake for 15 minutes, flip the bread over, then bake for another 15 minutes, until slightly crispy.",
        "Slice the strawberries into decorative shapes of your choosing. For a strawberry rose, place a strawberry stem side down and carefully make thin slices around the outer edge of the strawberry, making sure not to cut all the way through. Continue cutting and rotating the strawberry until you get to the center. Fan out the “petals”.",
        "Preheat the oven to 350˚F (180˚C). Line a baking sheet with parchment paper and set a wire rack on top.",
        "For a strawberry fan, lay a strawberry on its flattest side. Tilt the knife at a 45˚ angle and make thin, angled slices through the strawberry, keeping the top of the strawberry connected and slicing all the way through the bottom of the berry. Fan out the slices.",
        "Sprinkle the remaining sugar on top of the bread and broil on high for 3 minutes, until the sugar has melted and browned, or carefully use a kitchen torch to brûlée the sugar.",
        "Top with whipped cream and strawberries and serve.",
        "Enjoy!"
    ]
}