{
    "id": "creme-brulee-cookies",
    "link": "https://tasty.co/recipe/creme-brulee-cookies",
    "name": "Crème Brûlée Cookies Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/144027.jpg",
    "description": "Here's what you need: large egg yolk, sugar, cornstarch, vanilla extract, milk, unsalted butter, large egg, all-purpose flour",
    "recipeCategory": "Snacks",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "3 large egg yolks",
        "2 cups sugar, divided",
        "3 tablespoons cornstarch",
        "1 teaspoon vanilla extract",
        "1½ cups milk",
        "½ cup (1 stick) unsalted butter, softened",
        "1 large egg",
        "3½ cups all-purpose flour"
    ],
    "recipeInstructionSteps": [
        "In a large, microwave-safe bowl, whisk the yolks and  ½ cup (100 g) of sugar until pale in color.",
        "Add the cornstarch and vanilla extract, and whisk well. Add the milk and whisk until fully combined.",
        "Loosely cover the bowl with plastic wrap and microwave for 4-6 minutes, whisking every 1-2 minutes, until the mixture becomes a thick custard.",
        "Re-cover with plastic wrap and chill for about 2 hours.",
        "In a medium bowl, cream the softened butter and ½ cup (100 g) of sugar with a hand mixer until light and fluffy.",
        "Add the egg, and mix until fully incorporated.",
        "Add the flour and mix until the dough is crumbly, but holds together when squeezed.",
        "Wrap the dough in plastic wrap and chill in the fridge for 30 minutes.",
        "Preheat the oven to 350°F (180°C).",
        "Once chilled, roll out the dough between two layers of parchment paper until it is ¼-inch (6 mm) thick.",
        "Cut out 6 2-inch (5 cm) diameter rounds of dough. Remove the excess dough and transfer the rings to a parchment-lined baking sheet.",
        "Re-roll the leftover cookie dough to the ¼-inch (6 mm) thickness. Cut out 6 more 2-inch (5 cm) rounds, then cut a 1½-inch (4 cm) ring inside the 2-inch (5 cm) rounds. Transfer the whole rounds to the baking sheet, then remove the inner circles.",
        "Bake the cookies for 10 minutes, until pale and just barely cooked. Let sit at room temperature to cool for 30 minutes.",
        "Once the cookies are cool, transfer the chilled custard to a piping bag. Pipe the custard onto the circle-shaped cookies completely covering the surface.",
        "Place the ring-shaped cookies on top of the custard-topped cookies and press down gently to adhere.",
        "Add the remaining cup of sugar to a small pan and cook over medium-high heat, stirring occasionally, until the sugar melts and begins to caramelize. Make sure there are no lumps of sugar.",
        "While the caramel is still hot, pour about 2 tablespoons over each cookie to fill the ring on top. Let the cookies cool completely.",
        "Enjoy!"
    ]
}