{
    "id": "baked-fish-chips",
    "link": "https://tasty.co/recipe/baked-fish-chips",
    "name": "Baked Fish &amp; Chips Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/0370d7456e6643d9878e62583cca4732/BFV20365_Baked_Fish__Chips_-_FB_-_1080x1080-2.jpg",
    "description": "Here's what you need: cod fillets, salt, pepper, whole wheat flour, paprika, garlic powder, egg, panko breadcrumbs, russet potato, olive oil, salt, pepper, paprika, garlic powder, greek yogurt, salt, pepper, onion powder, pickle relish, parsley, lemon, baking sheet, parchment paper",
    "recipeCategory": "Lunch",
    "recipeCuisine": "British",
    "recipeIngredient": [
        "4 cod fillets",
        "Salt, to taste",
        "Pepper, to taste",
        "1 cup whole wheat flour",
        "2 tablespoons paprika",
        "2 tablespoons garlic powder",
        "2 eggs",
        "2 cups panko bread crumbs",
        "3 russet potatoes, sliced ¼-inch thick",
        "Olive oil, to taste",
        "Salt, to taste",
        "Pepper, to taste",
        "¼ teaspoon paprika",
        "¼ teaspoon garlic powder",
        "1 cup plain Greek yogurt",
        "Salt, to taste",
        "Pepper, to taste",
        "¼ tablespoon onion powder",
        "2 tablespoon pickle relish",
        "2 tablespoon fresh parsley, chopped",
        "½ lemon, juiced",
        "n/a",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 425°F/220°C.",
        "Cut ends and sides off of potatoes and cut into ¼-inch/6-mm sticks.",
        "Place potatoes into a bowl of cold water and let it soak for 30 minutes.",
        "Dry potatoes thoroughly, then add olive oil, salt, pepper, paprika, and garlic powder.",
        "Bake the fries for 30 minutes. Flip halfway.",
        "For the fish, pat dry with paper towels. Season with salt and pepper.",
        "In a mixing bowl, combine flour, garlic powder, and paprika.",
        "In another bowl, whisk two eggs together.",
        "In another mixing bowl, add panko bread crumbs.",
        "Dip the fish into the flour mixture, then the eggs, then the bread crumbs.",
        "Drizzle olive oil on top of fish for more crispiness.",
        "Grease the pan, then bake fish for 15 minutes.",
        "For the tartar sauce, combine greek yogurt, salt, pepper, onion powder, pickle relish, fresh parsley, and lemon juice. Mix until well combined.",
        "Enjoy!"
    ]
}