{
    "id": "bacon-croque-madame-brunch-ring",
    "link": "https://tasty.co/recipe/bacon-croque-madame-brunch-ring",
    "name": "Bacon Croque Madame Brunch Ring Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/171680.jpg",
    "description": "Here's what you need: salted butter, bacon, all-purpose flour, black pepper, salt, milk, dijon mustard, white bread, ham, shredded mozzarella cheese, fresh chives, egg",
    "recipeCategory": "Breakfast",
    "recipeCuisine": "French",
    "recipeIngredient": [
        "¼ cup (½ stick) salted butter",
        "12 strips of bacon, chopped",
        "¼ cup all-purpose flour",
        "1 teaspoon black pepper",
        "1 teaspoon salt",
        "4 cups milk, warm",
        "1 tablespoon Dijon mustard",
        "15 slices of white bread",
        "17 slices of ham",
        "3 cups shredded mozzarella cheese, divided",
        "1 teaspoon chopped chives for garnish",
        "8 sunny-side up eggs, for serving"
    ],
    "recipeInstructionSteps": [
        "In a medium pan over high heat, cook the bacon until browned, about 12 minutes. Transfer the bacon bits to a paper towel to drain and leave the bacon grease in the pan.",
        "To the pan, add the flour, pepper, and salt and whisk to combine for 5 minutes. Add the milk and Dijon mustard and cook until thickened, about 5 minutes. Remove the béchamel sauce from the heat and cover to keep warm.",
        "Preheat the oven to 350°F (180°C). Grease a bundt pan with the salted butter. Line a baking sheet with parchment paper.",
        "With a rolling pin, roll out the bread to flatten and cut 8 slices in half.",
        "Arrange the 7 whole slices around the outer sides of the bundt pan and 4 half slices around the inner ring. Place 5 slices of ham over the bread. Sprinkle 1 cup (100 g) of mozzarella and ⅓ of the chopped bacon on top of the ham.",
        "Place 6 half slices of bread on top of the bacon layer. Top with 8 slices of ham, another cup of mozzarella, and another ⅓ of the chopped bacon. Top with another 4 slices of ham. Place 6 half slices of bread on top of the ham.",
        "Bake for 25 minutes, or until golden brown.",
        "Invert the ring onto the prepared baking sheet, remove the bundt pan, and brush the top of the ring with béchamel sauce. Sprinkle with the remaining cup of mozzarella and the rest of the bacon.",
        "Broil for 10 minutes, until the cheese is melted and browned.",
        "Sprinkle the ring with parsley. Transfer the rest of the béchamel sauce to a small bowl and place in the middle of the ring.",
        "Slice the ring and serve warm with the sauce and sunny-side up eggs.",
        "Enjoy!"
    ]
}