{
    "id": "strawberry-shortcake-cheesecake-dome-charlotte-royale",
    "link": "https://tasty.co/recipe/strawberry-shortcake-cheesecake-dome-charlotte-royale",
    "name": "Strawberry Shortcake Cheesecake Dome (Charlotte Royale) Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/124104.jpg",
    "description": "Here's what you need: egg, sugar, vanilla extract, flour, baking powder, salt, cream cheese, heavy whipping cream, strawberry jam, fresh strawberry ",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "4 eggs",
        "1 ¼ cups sugar, divided",
        "3 teaspoons vanilla extract, divided",
        "¾ cup flour",
        "1½ teaspoons baking powder",
        "1 teaspoon salt",
        "16 ounces cream cheese, room temperature",
        "½ cup heavy whipping cream, cold",
        "½ cup strawberry jam",
        "2 cups fresh strawberries, sliced"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C).",
        "Whisk together eggs, ¾ cups (150 g) sugar and 1 teaspoon vanilla until pale and fluffy.",
        "Into the mixture sift in flour, baking powder &amp; salt. Mix until just combined.",
        "Pour the sponge cake batter onto a 10x15-inch (25x38 cm) baking sheet lined with parchment paper and bake for 10-12 minutes. Allow to cool.",
        "In a mixing bowl beat together cream cheese, ½ cup sugar (100 g) and 2 teaspoons vanilla extract. Add in heavy cream and beat until light and fluffy. Set aside.",
        "Cutting widthways, cut the cooled cake into 4 equal rectangles.",
        "Spread the jam onto 2 rectangles. Then place the two rectangles together and top with a rectangle without any jam.",
        "Transfer the stack of cake with jam onto a cutting board. Cut in half longways. Then cut widthways into 1 cm (½ inch) thick slices. The cut pieces of cake should be about square in shape.",
        "Arrange the sliced pieces on cake into a medium sized bowl lined with cling film. Alternate the direction the lines are facing to create a checkered like pattern. As you reach the edges of the bowl, you may need to cut the pieces to fit.",
        "Fill the cake with the cheesecake filling. Spreading evenly.",
        "Arrange the strawberries on top making sure they slightly overlap each other.",
        "Cover the cake with slices of the 4th piece of cake. Wrap the exposed cake with cling film and refrigerate for at least 4 hours.",
        "To serve, unwrap the bottom layer of the cake, and place a plate on top. Flip the plate and carefully remove the bowl, and the remaining cling film.",
        "Slice and serve.",
        "Enjoy!"
    ]
}