{
    "id": "chipotle-chili-and-cornbread-dumplings",
    "link": "https://tasty.co/recipe/chipotle-chili-and-cornbread-dumplings",
    "name": "Chipotle Chili And Cornbread Dumplings Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/b78a3842b1bc4e44875c30c4218d37a4/FinalFBforpkg.jpg",
    "description": "Here's what you need: ground beef, kosher salt, black pepper, ground cumin, chilli powder, smoked paprika, cayenne, large onion, red bell pepper, garlic, chipotle pepper in adobo sauce, tomato paste, beef broth, chopped tomato, black beans, red kidney bean, apple cider vinegar, cornmeal, flour, baking powder, salt, egg, honey, buttermilk",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "2 pounds ground beef",
        "2 tablespoons kosher salt",
        "1 tablespoon black pepper",
        "1 tablespoon ground cumin",
        "1 tablespoon chili powder",
        "1 tablespoon ground smoked paprika",
        "1 teaspoon cayenne",
        "1 large onion, chopped",
        "1 red bell pepper, chopped",
        "6 cloves garlic, minced",
        "2 chopped chipotles in adobo",
        "12 ounces tomato paste",
        "2 cup beef broth",
        "1 12 ounce can of chopped tomatoes",
        "1 15 ounce can of black beans",
        "1 15 ounce can of red kidney beans",
        "1 T Apple Cider Vinegar",
        "1 cup cornmeal",
        "1 cup flour",
        "1 teaspoon baking powder",
        "Pinch of salt",
        "2 eggs",
        "¼ cup honey",
        "½ cup buttermilk"
    ],
    "recipeInstructionSteps": [
        "In a large bowl, mix the flour, cornmeal, baking powder, and salt. Mix and make a little well in the center.",
        "Add the milk, eggs, honey into the well, beat the eggs and liquid first, and then combine with the rest of the dry ingredients. Set aside until chili is almost finished.",
        "In a large pot at medium high heat, add the beef, season with salt, pepper, cumin, chili powder, smoked paprika, cayenne, and cook until it is a deep brown color.",
        "Add the onion, red bell peppers garlic, and chopped chipotles, and a pinch of salt. Cook until caramelized and soft, about 10 minutes.",
        "Add the tomato paste and cook until the tomato paste gets dark and starts sticking to the bottom slightly.",
        "Add in the canned diced tomatoes, beef broth, black beans, kidney beans, and apple cider vinegar (optional). Stir until all is well incorporated. Bring to a boil, reduce heat to low to a simmer,",
        "Scoop and shape the cornbread batter into golf ball sized dumplings and place in the simmering chili.",
        "Put a lid on the Chili and steam/simmer the dumplings 20 minutes or until the dumplings are cooked through.",
        "Serve with cheddar cheese, sour cream, and sliced scallions.",
        "Enjoy!"
    ]
}