{
    "id": "frying-pan-soup-dumplings",
    "link": "https://tasty.co/recipe/frying-pan-soup-dumplings",
    "name": "Frying Pan Soup Dumplings Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/bec55e1bfe19480186c173fa76f63494/FB_copy.jpg",
    "description": "Here's what you need: dumpling wrappers, water, hot water, gelatin powder, soy sauce, chicken stock, ground pork, green onion, shiitake mushroom, ginger, garlic, sesame oil, sake",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Japanese",
    "recipeIngredient": [
        "20 dumpling wrappers",
        "n/a",
        "150 milliliters (0.6 cup) hot water",
        "5 grams (0.2 ounces) gelatin powder",
        "1 tablespoon soy sauce",
        "n/a",
        "130 grams (5 ounces) ground pork",
        "1 green onion, ground",
        "2 Japanese mushrooms, ground",
        "½ inch piece ginger, peeled and grated",
        "1 clove garlic, grated",
        "1 teaspoon sesame oil",
        "1 teaspoon sake"
    ],
    "recipeInstructionSteps": [
        "For the soup, add the hot water, gelatin powder, soy sauce, and chicken stock to a medium bowl. Stir to combine. Pour into a shallow dish and chill in the refrigerator for 1 hour, until set.",
        "When set, fluff and break up the jellied soup with a fork.",
        "For the filling, combine the ground pork, green onion, mushrooms, ginger, garlic, sesame oil, and sake in a medium bowl. Mix with your hands until combined.",
        "Scoop a spoonful of filling onto the middle of a dumpling wrapper. Add a spoonful of soup jelly on top.",
        "Fold up the edges of the dumpling and pinch everything in the center. Repeat with the remaining dumpling wrappers and filling.",
        "Put a plate in a medium pan pan, and lay a piece of parchment paper over it.",
        "Set the dumplings on the plate and pour 150 milliliters (⅔ cup) water under the plate. Cover and steam for 5 minutes over medium heat.",
        "Enjoy!"
    ]
}