{
    "id": "vegetable-dumpling-soup",
    "link": "https://tasty.co/recipe/vegetable-dumpling-soup",
    "name": "Vegetable Dumpling Soup Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/ab069c40dac54ef4986616805e1c1604/HealthyAndHeartSoupsThatWillFillYouUpFBFINAL.jpg",
    "description": "Here's what you need: flour, baking powder, salt, olive oil, warm water, onion, carrot, garlic, dried dill, dried sage, dried thyme, pepper, potato, vegetable broth, bay leaf, fresh parsley",
    "recipeCategory": "Lunch",
    "recipeCuisine": "",
    "recipeIngredient": [
        "1 cup flour",
        "1 teaspoon baking powder",
        "½ teaspoon salt",
        "4 tablespoons olive oil, divided",
        "½ cup warm water",
        "1 onion, diced",
        "2 carrots, diced",
        "2 cloves garlic, minced",
        "1 teaspoon dried dill",
        "½ teaspoon dried sage",
        "½ teaspoon dried thyme",
        "½ teaspoon pepper",
        "2 cups potatoes, diced",
        "6 cups vegetable broth",
        "2 bay leaves",
        "Parsley, chopped,  to serve"
    ],
    "recipeInstructionSteps": [
        "In a small mixing bowl, combine flour, baking powder, and salt with a spatula. Form a well in the middle of the dry mixture and add 2 tablespoons olive oil and warm water. Mix until dough forms in to a sticky ball. Cover with a dish towel and set aside.",
        "In large pot or Dutch oven, add the olive oil over medium heat. Once the oil begins to shimmer, add the onion and carrot and cook for about 4-5 minutes, or until the onions are semi-translucent.",
        "Add in the garlic, dill, sage, thyme, and pepper, and cook for 2-3 more minutes until herbs are fragrant.",
        "Stir in potatoes, vegetable broth, and bay leaves, and bring to a boil. 5. Reduce heat to medium-high and simmer about 8 minutes or until potatoes are about 75 percent cooked through.",
        "Carefully drop in dollops of the dumpling dough, about 1 inch (2-cm) in diameter.",
        "Let dumplings simmer for about 10 minutes, or until chewy and cooked through.",
        "To serve, garnish with lots of fresh parsley.",
        "Enjoy!"
    ]
}