{
    "id": "garlic-herb-stuffed-pork-chops",
    "link": "https://tasty.co/recipe/garlic-herb-stuffed-pork-chops",
    "name": "Garlic Herb-stuffed Pork Chops Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/ad4b46292502458bb556047108be4c2d/BFV8521_Garlic_Herb-Stuffed_Pork_Chops-FB1080.jpg",
    "description": "Forget dry pork chops because these pan-fried cutlets are coated in golden panko bread crumbs and stuffed with a creamy garlic and herb cheese filling to keep them juicy.  They’re tender, bursting with flavor, and come together in less than 30 minutes.  If you’ve only ever had dry, sad pork chops before and want to try something different, this is the recipe for you.",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "16 ounces cream cheese, softened",
        "1 teaspoon freshly ground black pepper",
        "1 tablespoons garlic powder",
        "¼ cup chives, chopped",
        "1 cup provolone cheese, shredded",
        "4 strips cooked bacon, crumbled",
        "8 boneless pork chops",
        "Salt",
        "Pepper",
        "2 cups flour",
        "3 eggs, beaten",
        "2 cups Panko breadcrumbs",
        "4 tablespoons canola oil"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350°F (175°C).",
        "In a large bowl, combine cream cheese, pepper, garlic powder, chives, provolone, and bacon, stirring until thoroughly mixed. Set aside.",
        "Season all sides of the pork chops with salt and pepper.",
        "Carefully cut a pocket through the side of the pork chop in order to create a cavity. Stuff the cavity with a generous spoonful of the cream cheese mixture and press around the edges of the pork to seal it in. Repeat with the remaining pork chops.",
        "Dip the stuffed pork chops in the flour, shaking off excess, then the egg, then the breadcrumbs. Repeat with the remaining pork chops.",
        "Heat the oil in a pan over medium heat. Fry the pork chops for about one to two minutes, then flip. Remove from the heat and bake for 15-20 minutes, until cheese is bubbling and starting to brown.",
        "Enjoy!"
    ]
}