{
    "id": "japanese-pork-cutlet-tonkatsu-with-curry",
    "link": "https://tasty.co/recipe/japanese-pork-cutlet-tonkatsu-with-curry",
    "name": "Japanese Pork Cutlet (Tonkatsu) With Curry Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/0e036a2a94f84a15895b7a4e6b759717/BFV14763_TonkatsuCurry-ThumbB1080.jpg",
    "description": "Here's what you need: white rice, boneless pork chop, salt, pepper, shiso leaf, mozzarella cheese, flour, egg, panko breadcrumbs, oil, oil, onion, medium potato, medium carrot, water, japanese curry paste",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Japanese",
    "recipeIngredient": [
        "4 cups cooked white rice",
        "4 pork chops, boneless",
        "Salt, to taste",
        "Pepper, to taste",
        "4 shiso leaves",
        "4 slices mozzarella",
        "½ cup flour",
        "3 eggs",
        "3 cups panko bread crumbs",
        "Oil, for frying",
        "1 tablespoon oil",
        "½ onion, sliced",
        "2 medium potatoes, cubed",
        "1 medium carrots, diced",
        "3 cups water",
        "⅓ cup Japanese curry paste"
    ],
    "recipeInstructionSteps": [
        "Season the pork chops on both sides with salt and pepper.",
        "Cut a large slit through the side of the pork chops.",
        "Place the cheese in the pocket of the pork chop. Place a slice of mozzarella on top of a shiso leaf, then fold it in half.",
        "Repeat with the remaining pork chops.",
        "Dredge the pork in the flour, shaking off excess. Dip the pork in the egg, then roll evenly in the bread crumbs then back into the egg, then back into the bread crumbs.",
        "Repeat with the other pork chops.",
        "Heat oil over medium-high heat until about 360°F (185˚C).",
        "Fry the pork chops one at a time until golden brown, then drain on a paper towel.",
        "Sauté the onions until translucent, then add the potatoes and carrots. Cook for about 1 minute, then add the water, bringing to a boil.",
        "Lower the heat and simmer for about 10 minutes.",
        "Add the curry paste, then stir until dissolved.",
        "Cook for another 10 minutes on low heat, then set aside.",
        "Slice the pork cutlets into ½-inch (1-cm) slices.",
        "To serve, place the pork cutlet slices over the rice, then pour a generous serving of curry on half of the pork.",
        "Enjoy!"
    ]
}