{
    "id": "one-pan-cider-braised-pork-chops",
    "link": "https://tasty.co/recipe/one-pan-cider-braised-pork-chops",
    "name": "One-Pan Cider-Braised Pork Chops Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/186521.jpg",
    "description": "Here's what you need: water, dried bay leaf, garlic, black peppercorn, sea salt, ice, bone-in pork chop, sea salt, pepper, high-heat cooking oil, shallot, turnip, dijon mustard, fresh sage, apple cider, reduced sodium chicken stock, collard green",
    "recipeCategory": "Dinner",
    "recipeCuisine": "",
    "recipeIngredient": [
        "4 cups water",
        "2 bay leaves",
        "4 cloves garlic, crushed",
        "1 tablespoon black peppercorns",
        "⅓ cup sea salt",
        "4 cups ice",
        "2 bone-in pork chops, about 1-inch thick",
        "Sea salt, to taste",
        "Pepper, to taste",
        "1 tablespoon high heat oil of choice, such as vegetable or peanut",
        "2 shallots, diced",
        "3 cups diced turnip",
        "1 tablespoon Dijon mustard",
        "1 tablespoon chopped fresh sage",
        "2 cups apple cider",
        "1 cup reduced-sodium chicken stock",
        "1 bunch collard greens, stemmed and roughly chopped"
    ],
    "recipeInstructionSteps": [
        "Make the brine: Combine the water, bay leaves, garlic, peppercorns, and salt in a medium pot over medium heat and stir until the salt is dissolved.",
        "Remove the brine from heat and stir in the ice cubes.",
        "Once the brine is cooled, add the pork chops to a glass dish and pour the brine over. Chill in the refrigerator for 1-10 hours.",
        "Preheat the oven to 350˚F (180˚C).",
        "Remove the pork chops from the brine and pat dry. Season generously with salt and pepper on both sides.",
        "Heat the oil in a large cast iron or other ovenproof skillet over medium-high heat until nearly smoking. Add the pork chops and sear without disturbing until caramelized and browned on the first side, about 2 minutes, then flip and sear on the other side. Remove the pork chops from the pan and set aside.",
        "Add the shallots to the pan and cook until they begin to soften and caramelize, stirring occasionally, about 2 minutes.",
        "Add the turnips and season with salt, then spread in an even layer and let caramelize, stirring occasionally, about 5 minutes.",
        "Stir in the mustard and sage. Cook for 1 minute more.",
        "Pour in the apple cider and chicken stock. Bring to a boil, then reduce the heat to low-medium and simmer until the liquid is reduced by half, about 7 minutes.",
        "Add the collard greens and stir to incorporate. Nestle the pork chops into the sauce, making sure that they are partly submerged.",
        "Transfer the pan to the oven and cook for about 12 minutes, until the internal temperature of the pork chops reaches 135˚F (57˚C).",
        "Remove from the oven and let rest for 10 minutes as the internal temperature continues to climb to 145˚F (63˚C).",
        "Divide the pork chops, vegetables, and sauce between plates and serve.",
        "Enjoy!",
        "Nutrition, Pork Chops without braising liquid: Calories: 470, Total fat: 27 grams, Sodium: 790 grams, Total carbs: 48 grams, Dietary fiber: 7 grams, Sugars: 6 grams, Protein: 48 gramsBraising Liquid, ¼ cup (60 ml) serving - Calories: 20, Total fat: 0, Sodium: 48 grams, Total carbs: 5 grams, Dietary fiber: 0 grams, Sugars: 4 grams, Protein: 0 grams"
    ]
}