{
    "id": "spring-vegetable-potstickers",
    "link": "https://tasty.co/recipe/spring-vegetable-potstickers",
    "name": "Spring Vegetable Potstickers Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/158875.jpg",
    "description": "Here's what you need: oil, medium yellow onion, ginger, garlic, asparagus, frozen peas, shredded carrot, green cabbage, salt, pepper, fresh spinach, fresh chives, soy sauce, sesame oil, rice vinegar, low sodium soy sauce, garlic, ginger, green onion, sesame oil, crushed red pepper flake, gyoza wrapper, oil, water",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "3 tablespoons oil",
        "1 medium yellow onion, finely chopped",
        "1 tablespoon minced ginger",
        "1 tablespoon minced garlic",
        "1 cup finely chopped asparagus",
        "1 cup frozen peas, thawed",
        "2 cups shredded carrots",
        "2 cups shredded green cabbage",
        "Salt, to taste",
        "Pepper, to taste",
        "3 cups chopped fresh spinach",
        "1 cup finely chopped chives",
        "2 tablespoons soy sauce",
        "2 teaspoons sesame oil",
        "½ cup rice vinegar",
        "½ cup low-sodium soy sauce",
        "1 clove garlic, minced",
        "1 teaspoon minced ginger",
        "⅓ cup thinly sliced green onions",
        "1 teaspoon sesame oil",
        "½ teaspoon crushed red pepper flakes",
        "24 gyoza wrappers",
        "4 tablespoons oil, divided",
        "1 cup water, divided"
    ],
    "recipeInstructionSteps": [
        "Make the dipping sauce: in a medium bowl, add the rice vinegar, soy sauce, garlic, ginger, green onions, sesame oil, and crushed red pepper flakes and whisk to combine.",
        "Heat oil in a large pan or wok over medium heat. When the oil is shimmering, add the onion, ginger, and garlic. Cook until the onion is translucent, stirring occasionally, about 4 minutes.",
        "Add the asparagus, carrots, peas, and cabbage, and stir. Season with salt and pepper, and cook for 3-4 minutes, until the vegetables are softened.",
        "Add the spinach and cook until wilted. Remove the filling from the heat and transfer to a large bowl to cool to room temperature.",
        "Once the filling is cooled, add the chives, soy sauce, and sesame oil, and stir until well combined.",
        "Place 1 tablespoon of the vegetable mixture onto a gyoza wrapper. Dip your finger in water and run it around the edge of the wrapper.",
        "Fold in half and pinch together, pleating the dough as you go.",
        "Heat 1 tablespoon of oil in a large skillet over low heat and add the dumplings. Cook for 3-4 minutes, until a crust starts to form on the bottom. Pour ¼ cup (60 ml) of water in the pan and cover with a lid. Steam for 6-8 minutes, then remove the dumplings from the pan.",
        "Repeat with the remaining dumplings.",
        "Enjoy!"
    ]
}