{
    "id": "unicorn-cheesecake",
    "link": "https://tasty.co/recipe/unicorn-cheesecake",
    "name": "Unicorn Cheesecake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/8eecc8f95e2844eb970d14d526a39544/UNICORN_CHEESECAKE_THUMB.jpg",
    "description": "Here's what you need: cream cheese, sugar, vanilla extract, milk, gelatin, food coloring, graham cracker, unsalted butter, sugar, mini waffle cone, white chocolate, sprinkles, sprinkles, gumballs, swirl lollipop",
    "recipeCategory": "Bakery Goods",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "48 ounces cream cheese",
        "1 cup sugar",
        "2 tablespoons vanilla extract",
        "2 cups warm milk",
        "2 tablespoons gelatin",
        "Purple food coloring",
        "20 graham crackers",
        "4 tablespoons unsalted butter, melted",
        "⅓ cup sugar",
        "9 mini waffle cones",
        "2 cups white chocolate, melted",
        "Pink sprinkles",
        "Sprinkles",
        "Gumballs",
        "Swirl lollipop"
    ],
    "recipeInstructionSteps": [
        "Make the filling: In a large bowl, use an electric hand mixer to combine the cream cheese, sugar, and vanilla. Microwave the milk for 2 minutes and mix with the gelatin. Add to the cream cheese mixture. ",
        "Separate the batter into 3 medium bowls. Add a drop of food coloring to each bowl and stir to combine.",
        "Make the crust: Add the graham crackers to a zip-top plastic bag and use a rolling pie to crush until they resemble coarse sand. Transfer to a medium bowl and add the butter and sugar. Mix until thoroughly combined. Press into a greased 8-inch springform pan and chill.",
        "Pour the blue batter into the graham cracker crust and refrigerate for 30 minutes, or until firm. Add the purple batter, and refrigerate for another 30 minutes. Add the pink batter, and refrigerate for 60 minutes more.",
        "To make the unicorn horns, dip each waffle cone into the white chocolate, top with sprinkles, and chill until firm.",
        "Top the cheesecake with the sprinkles, unicorn horns, gumballs, and the lollipop.",
        "Enjoy!"
    ]
}