{
    "id": "baked-brie-in-a-bread-bowl",
    "link": "https://tasty.co/recipe/baked-brie-in-a-bread-bowl",
    "name": "Baked Brie In A Bread Bowl Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/840ecd310b754a1e8d89f934c2da3441/BFV48872_Break-UpRecipesComp_V3_final.jpg",
    "description": "Here's what you need: sourdough bread bowl, brie cheese, olive oil, white wine, garlic, bacon, pepper, fresh chives, potato chip, mini potato, spaghetti, carrot",
    "recipeCategory": "Sides",
    "recipeCuisine": "",
    "recipeIngredient": [
        "1 sourdough bread boule",
        "1 7-ounce wheel brie cheese",
        "2 tablespoons olive oil",
        "1 tablespoon white wine",
        "4 cloves garlic, minced, divided",
        "2 strips bacon, cooked and chopped",
        "Pepper, to taste",
        "Chopped fresh chives, to taste",
        "Potato chips",
        "Mini potatoes",
        "Spaghetti",
        "Carrots"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C).",
        "Cut off the top of the bread boule so the top surface is flat and without crust. Slice the crusty top into sticks and set aside.",
        "Set the brie wheel on top of the bread and cut out a hole for the brie. Set the brie aside and remove the cut out bread.",
        "In a small bowl, mix the olive oil with 2 cloves of garlic and brush over the bread. Set the boule aside.",
        "Carefully cut the top rind off of the brie wheel. Place the brie, cut-side up, inside the bread and set it on a baking sheet lined with parchment paper.",
        "Scoop out about a tablespoon of the center of the brie and pour the white wine into the divot.",
        "Top the brie with the remaining minced garlic and chopped bacon, and season with pepper. Arrange the bread sticks next to the bread on the baking sheet.",
        "Bake for 15- 20 minutes, until the brie is completely melted.",
        "Sprinkle with chives.",
        "Dip the bread sticks and any other dipping items you’d like in the brie.",
        "To reheat, bake the brie at 250°F (120°C) for about 15 minutes, until melted.",
        "Enjoy!"
    ]
}