{
    "id": "cheesy-garlic-bread-meatball-ring",
    "link": "https://tasty.co/recipe/cheesy-garlic-bread-meatball-ring",
    "name": "Cheesy Garlic Bread Meatball Ring Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/fe5b11a8411f4d4cbf1f3bbe81cdec66/Thumb_c.jpg",
    "description": "Here's what you need: ground beef, egg, bread crumbs, Chopped fresh parsley, salt, pepper, pizza dough, marinara sauce, shredded mozzarella cheese, butter, garlic, grated parmesan cheese",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 pound ground beef",
        "1 egg",
        "¼ cup bread crumbs",
        "2 tablespoons parsley, chopped",
        "½ tablespoon salt",
        "½ tablespoon pepper",
        "1 batch pizza dough",
        "1 cup marinara sauce",
        "1 cup shredded mozzarella cheese",
        "4 tablespoons butter, melted",
        "2 garlic cloves, minced",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "In a medium bowl, combine the ground beef, egg, bread crumbs, 2 tablespoons of parsley, salt, and pepper. Mix well.",
        "Pinch off a ball of the mixture, roll between your hands to make ping pong ball-sized meatball. Repeat with the rest of the meat.",
        "In a large pan, cook the meatballs over medium heat, turning to brown each side. Remove from heat and drain on a paper towel.",
        "Preheat oven to 350°F (180˚C).",
        "Pinch off a portion of pizza dough and, with your hands or a rolling pin, flatten out and top with a tablespoon of marinara sauce and mozzarella cheese. Add a meatball and wrap the dough over, pinching at the seams to close. Repeat with the remaining ingredients.",
        "Arrange the balls in a circle, seam-side down, in a large cast-iron skillet. ",
        "Mix the melted butter with the garlic, remaining 2 tablespoons of parsley, and the Parmesan. Brush the balls with the garlic butter mixture.",
        "Bake for 20 minutes, or until golden brown. Let cool for 5-10 minutes.",
        "Place a bowl of warm marinara sauce in the middle of the skillet, then serve.",
        "Enjoy!"
    ]
}