{
    "id": "chicken-parmesan-bread-bowl",
    "link": "https://tasty.co/recipe/chicken-parmesan-bread-bowl",
    "name": "Chicken Parmesan Bread Bowl Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/124203.jpg",
    "description": "Here's what you need: breadcrumb, fresh parsley, garlic powder, onion powder, dried oregano, salt, pepper, flour, egg, boneless, skinless chicken breast, oil, bread bowl, marinara sauce, mozzarella cheese, shredded parmesan cheese, butter, garlic, fresh parsley, parmesan cheese, fresh basil",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Italian",
    "recipeIngredient": [
        "1 cup bread crumbs",
        "½ teaspoon parsley, chopped",
        "½ teaspoon garlic powder",
        "½ teaspoon onion powder",
        "¼ teaspoon oregano",
        "½ teaspoon salt",
        "¼ teaspoon pepper",
        "1 cup flour",
        "3 eggs, beaten",
        "2 boneless, skinless chicken breast, thinly sliced",
        "Oil, for frying",
        "1 bread boule",
        "1 cup marinara sauce",
        "8 ounces mozzarella",
        "½ cup shredded Parmesan cheese",
        "3 tablespoon butter, melted",
        "3 cloves garlic, minced",
        "1 tablespoon parsley, chopped",
        "1 tablespoon Parmesan cheese, grated",
        "Basil, for serving"
    ],
    "recipeInstructionSteps": [
        "In a medium bowl, combine bread crumbs, parsley garlic powder, onion powder, oregano, salt, and pepper to bread crumbs.",
        "Place flour and eggs in two other medium bowls.",
        "Roll the chicken breast in the flour, dusting off any excess. Dip the chicken into the egg, then place into the breadcrumbs, coating it completely.",
        "Heat the oil in a skillet over medium-high heat.",
        "Once the oil begins to shimmer, fry the breaded chicken strips until both sides are golden brown.",
        "Remove from heat and drain on a paper towel.",
        "Preheat oven to 350°F (180˚C).",
        "Slice the cooked chicken breast into ½-inch (1 cm) thick strips.",
        "Slice the top of the bread bowl off and scoop out the insides. Save the top of the bowl.",
        "Spoon and spread some of the marinara sauce on the bottom of the bowl, then layer on mozzarella, Parmesan cheese, chicken strips, marinara, remaining mozzarella, Parmesan, chicken strips, marinara, and remaining Parmesan.",
        "Place the cap of the bread bowl on top.",
        "Wrap the bread bowl in foil, then weigh it down with a heavy object for 30 minutes.",
        "In a small bowl, mix together butter, garlic, parsley, and Parmesan cheese.",
        "Remove the foil from the bread bowl and brush the garlic butter mixture evenly over it.",
        "Bake for 30 minutes.",
        "Cool for 10 minutes and slice.",
        "Garnish with basil, if desired.",
        "Enjoy!"
    ]
}