{
    "id": "chili-cheese-garlic-bread-rolls",
    "link": "https://tasty.co/recipe/chili-cheese-garlic-bread-rolls",
    "name": "Chili-cheese Garlic Bread Rolls Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/aa7e7e0b9a6c4e22879e497fb12e0595/fb_1.jpg",
    "description": "Here's what you need: onion, garlic, ground beef, salt, pepper, tomato sauce, cumin, dried oregano, chili powder, kidney bean, butter, garlic, fresh parsley, grated parmesan cheese, dinner roll, shredded cheddar cheese, sour cream, green onion",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 onion, diced",
        "3 cloves garlic, minced",
        "1 pound ground beef",
        "1 teaspoon salt",
        "½ teaspoon pepper",
        "1 15-ounce can tomato sauce",
        "1 teaspoon cumin",
        "1 teaspoon dried oregano",
        "1 teaspoon chili powder",
        "1 15 ounce can kidney beans, drained and rinsed",
        "¼ cup butter, melted",
        "2 cloves garlic, minced",
        "1 tablespoon parsley, chopped",
        "1 tablespoon grated Parmesan",
        "12 dinner rolls",
        "½ cup shredded cheddar cheese",
        "Sour Cream, to serve",
        "Green onions, sliced, to serve"
    ],
    "recipeInstructionSteps": [
        "Heat oil in a large pot or Dutch oven over medium heat. Add the onion and cook until translucent.",
        "Add the garlic and cook for two minutes.",
        "Add the ground beef and season with salt and pepper. Break up the beef with a wooden spoon, cooking until browned.",
        "Add in the tomato sauce, cumin, oregano, and chili powder. Stir until combined.",
        "Reduce the heat to low, cover and simmer for 1 hour.",
        "Remove lid and stir in kidney beans.",
        "Preheat the oven to 400°F (200°C).",
        "In a bowl, add the butter, garlic, parsley, and Parmesan. Stir until combined.",
        "Place the dinner rolls in a baking dish. Use a knife to carve a circle in the top of each roll. Press down the bottom of the bun to create a denser bottom layer.",
        "Brush the rolls with the garlic butter and bake for 5 minutes, or until lightly toasted.",
        "Spoon the chilli into the holes of the toasted rolls.",
        "Sprinkle with cheddar cheese and bake for another 5 minutes, or until cheese has melted.",
        "Serve topped with sour cream and green onions.",
        "Enjoy!"
    ]
}