{
    "id": "garlic-bread-meatball-sliders",
    "link": "https://tasty.co/recipe/garlic-bread-meatball-sliders",
    "name": "Garlic Bread Meatball Sliders Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/62df5218864145afbee477d2db8adc30/BFV7161_GarlicBreadMeatballSliders-ThumbB1080.jpg",
    "description": "Here's what you need: ground beef, egg, kosher salt, black pepper, garlic powder, grated parmesan cheese, fresh basil, canola oil, marinara sauce, dinner roll, mozzarella cheese, unsalted butter, garlic, fresh basil, grated parmesan cheese",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 lb ground beef",
        "1 egg",
        "½ Tbsp. kosher salt",
        "½ Tbsp. freshly ground black pepper",
        "1 Tbsp. garlic powder",
        "¼ cup grated parmesan",
        "2 tablespoons chopped basil",
        "1 Tbsp. canola oil",
        "1 cup marinara sauce",
        "1 package dinner rolls, sheet of 12 rolls left intact (not pulled apart)",
        "6 slices mozzarella cheese",
        "4 Tbsp. melted unsalted butter",
        "2 Tbsp. chopped garlic",
        "2 Tbsp. chopped basil",
        "2 Tbsp. grated parmesan"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350° F (180°C).",
        "In a large bowl, combine the ground beef, egg, salt, pepper, garlic powder, parmesan, and chopped basil until thoroughly mixed.",
        "Take a golf ball-sized amount of the beef mixture and roll it into a ball. Repeat with the rest of the beef mixture, setting the meatballs aside on a plate.",
        "Heat oil in a pan over high heat. Sear meatballs on one side for about one to two minutes, then flip. Cook for another one to two minutes, then remove the meatballs from the pan and drain any excess fat.",
        "Pour the marinara sauce into the pan and place the meatballs in the sauce. Cook for about eight to 10 minutes, flipping the meatballs in the sauce until the sauce has reduced to a thick consistency. Remove from heat.",
        "Cut the 4×3 sheet of dinner rolls in half lengthwise. Arrange the bottom half into a 9×13 inch (23x33 cm) baking pan.",
        "Place the meatballs evenly in a 4×3 grid, putting one on each roll. Layer the mozzarella evenly on top. Cover with the top half of the dinner rolls.",
        "In a small bowl, combine the melted butter, garlic, basil, and parmesan, stirring until evenly mixed. Pour the garlic butter mixture over the top of the sliders.",
        "Bake for 20 minutes until the rolls are golden brown and cheese is melted.",
        "Cut into individual sandwiches, and serve.",
        "Enjoy!"
    ]
}