{
    "id": "pan-fried-soup-dumplings",
    "link": "https://tasty.co/recipe/pan-fried-soup-dumplings",
    "name": "Pan-Fried Soup Dumplings Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/2bce8c3067314d9aaf41d732caf79e6b/FB.jpg",
    "description": "Here's what you need: hot water, gelatin powder, soy sauce, chicken stock powder, all-purpose flour, baking powder, hot water, ground pork, green onion, shiitake mushroom, fresh ginger, garlic, sugar, sake, sesame oil, soy sauce, oil, water, sesame oil, white sesame seed, green onion",
    "recipeCategory": "Snacks",
    "recipeCuisine": "Japanese",
    "recipeIngredient": [
        "150 milliliters (½ cup) hot water",
        "5 grams (0.2 ounces) gelatin powder",
        "1 tablespoon soy sauce",
        "1 tablespoon chicken stock",
        "2 cups flour",
        "2 teaspoons baking powder",
        "⅓ cup hot water",
        "150 grams ground pork",
        "1 green onion, thinly sliced",
        "2 shiitake mushrooms, thinly sliced",
        "1 teaspoon ginger, grated",
        "1 teaspoon garlic, grated",
        "1 teaspoon sugar",
        "1 teaspoon sake",
        "1 teaspoon sesame oil",
        "1 tablespoon soy sauce",
        "2 tablespoons oil",
        "150 milliliters water",
        "1 tablespoon sesame oil",
        "White sesame seeds, to serve",
        "Small green onion, thinly sliced, to serve"
    ],
    "recipeInstructionSteps": [
        "In a medium bowl, combine the hot water, gelatin, soy sauce, and chicken stock and mix well. Transfer the soup to a shallow heatproof tray and chill in the refrigerator for 1 hour, or until set.",
        "When set, fluff the soup and break up with a fork.",
        "Add the flour and baking powder to a medium bowl. Pour the hot water over the flour mixture, and mix the dough gently to combine.",
        "Using your hands, knead the dough until it becomes smooth and elastic. Cover the bowl with plastic wrap and rest for at least 30 minutes at room temperature.",
        "For the filling, combine the ground pork, green onion, shiitake mushroom, ginger, garlic, sugar, sake, sesame oil, and soy sauce until well mixed.",
        "Roll the dough into a log. Divide it into 16 pieces.",
        "Take one piece and shape into a ball, then roll into flat round using a rolling pin. Put a spoonful of filling and soup gelatin into the center of the dough. Pinch the top a couple times to close the dumpling.",
        "Repeat with the remaining dough and fillings.",
        "Heat the oil in a medium pan over medium heat. Set the dumplings in a pan, seam side down,  pour in the water, and cover.",
        "Steam the dumplings for 12 minutes.",
        "Add the sesame oil in the pan, increase the heat to high, and cook until the bottoms of the dumplings are crisp.",
        "Serve with sesame seeds and sliced green onion.",
        "Enjoy!"
    ]
}