{
    "id": "rose-dumplings",
    "link": "https://tasty.co/recipe/rose-dumplings",
    "name": "Rose Dumplings Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/145053.jpg",
    "description": "Here's what you need: shrimp, ground pork, sake, salt, soy sauce, grated ginger, garlic, Chinese chives, sugar, dumpling wrappers or gyoza skins, water, sesame oil, rice vinegar, soy sauce, chili oil",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Japanese",
    "recipeIngredient": [
        "100 grams (3.5 ounces) shrimp",
        "100 grams (3.5 ounces) ground pork",
        "2 teaspoons sake",
        "Pinch of salt",
        "2 teaspoons soy sauce",
        "1 teaspoon ginger, grated",
        "1 clove grated garlic",
        "25 grams (1 ounce) Chinese chives, minced",
        "1 teaspoon sugar",
        "32 sheets dumpling wrappers",
        "80 milliliters (⅓ cups) water",
        "1 tablespoon sesame oil",
        "2 tablespoons vinegar",
        "2 tablespoons soy sauce",
        "Chili oil"
    ],
    "recipeInstructionSteps": [
        "In a large bowl, combine the chopped shrimp, ground pork, sake, salt, soy sauce, ginger, garlic, sugar, and Chinese chives and mix until thoroughly combined.",
        "Using your finger, rub the right edge of a dumpling wrapper with water. lay another dumpling wrapper over the edge so that it slightly overlaps, sealing tightly. Repeat with 2 more wrappers.",
        "Scoop a spoonful of filling onto the middle of each dumpling wrapper. Wet the edges of the wrappers and fold each wrapper over from top to bottom, ensuring that the edges are still overlapped, sealing tightly. Gently roll the dumplings from one end to the other, starting from the left side, creating a flower shape. Repeat with the remaining dumpling wrappers and fillings to create 8 rose dumplings in total. ",
        "Heat 1 tablespoon of sesame oil in a medium pan over medium-high heat. Add the dumplings to the pan and cook for 2 minutes, until the bottoms begin to brown. Add a splash of water to the pan and cover with the lid. Steam for 10 minutes. Remove the lid and drizzle with the remaining tablespoon of sesame oil. Cook on low heat for 3 minutes.",
        "Make the sauce: In a small bowl, combine the rice vinegar, soy sauce, and chili oil.",
        "Remove the dumplings from the pan and serve with the sauce on the side. ",
        "Enjoy!"
    ]
}