{
    "id": "chicken-satay-skewers",
    "link": "https://tasty.co/recipe/chicken-satay-skewers",
    "name": "Chicken Satay Skewers Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/924de32718084ed0a56fe3ddfe98354d/FBFinalReview1.jpg",
    "description": "Here's what you need: creamy peanut butter, coconut milk, spring onion, garlic, ginger, fresh Serrano chilies, curry powder, cumin, turmeric, salt, soy sauce, lime, boneless, skinless chicken thighs, peanuts, coconut milk, Bamboo or wooden skewers",
    "recipeCategory": "Lunch",
    "recipeCuisine": "",
    "recipeIngredient": [
        "n/a",
        "150 milliliters coconut milk",
        "4 spring onion, roughly chopped",
        "10 grams garlic cloves, peeled",
        "10 grams ginger, peeled",
        "2 fresh red chillies, roughly chopped",
        "1 teaspoon curry powder",
        "1 teaspoon cumin",
        "1 teaspoon turmeric",
        "1 teaspoon salt",
        "2 tablespoon soy sauce",
        "Juice of 1 lime",
        "8 chicken skinless thigh meat, diced",
        "50 grams peanuts, crushed",
        "100 milliliters coconut milk",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "In a food processor, blend the peanut butter, coconut milk, spring onions, garlic, ginger, chilies, curry powder, cumin, turmeric, salt, soy sauce, and lime juice into a smooth paste; this should make about 2 cups. Reserve half of the marinade and pour the other half over the chicken thighs. Mix and chill for 2 hours or overnight.",
        "Preheat the oven to 425˚F (220˚C). Line a baking tray with parchment paper.",
        "Skewer the marinated chicken onto bamboo skewers, then arrange the skewers so their ends rest on the edges of the baking tray, allowing the chicken to be suspended. Bake the chicken skewers for 15-20 minutes, until slightly dark brown on the edges and cooked through.",
        "With no oil in the pan, toast the chopped peanuts on low to medium heat, stirring constantly until the peanuts turn golden brown, 2-3 minutes. Add in the reserved marinade and the coconut milk. Stir and cook until thick and very aromatic, 5-10 minutes.",
        "Serve the chicken skewers with the sauce on the side.",
        "Enjoy!"
    ]
}