{
    "id": "chicken-tikka-biryani",
    "link": "https://tasty.co/recipe/chicken-tikka-biryani",
    "name": "Chicken Tikka Biryani Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/e0852050640d4474aaf3542d61f2568a/FB.jpg",
    "description": "Here's what you need: chicken breast, natural yogurt, lemon juice, ginger garlic paste, tikka masala sauce, red chili powder, turmeric powder, salt, oil, onion, ginger garlic paste, cumin seed, black peppercorn, clove, red chili powder, coriander powder, garam masala powder, salt, tomato, natural yogurt, water, water, basmati rice, bay leaf, cumin seed, onion, fresh coriander, oil, water",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Indian",
    "recipeIngredient": [
        "600 grams chicken breasts",
        "400 milliliters natural yogurt",
        "1 tablespoon lemon juice",
        "2 tablespoon ginger and garlic paste",
        "2 tablespoon tikka masala",
        "1 tablespoon red chili powder",
        "½ teaspoon turmeric powder",
        "1 teaspoon salt",
        "2 tablespoon oil",
        "1 onion, finely chopped",
        "2 tablespoon ginger and garlic paste",
        "1 teaspoon cumin seeds",
        "2 black peppercorns",
        "2 cloves",
        "1 teaspoon red chili powder",
        "½ teaspoon coriander powder",
        "1 teaspoon garam masala powder",
        "1 teaspoon salt",
        "2 tomato, finely chopped",
        "100 milliliters natural yogurt",
        "100 milliliters water",
        "400 milliliters water",
        "300g basmati rice, soaked for at least 20 minutes",
        "1 bay leaf",
        "½ teaspoon cumin seeds",
        "200 grams caramelised onion",
        "20 grams fresh coriander, finely chopped",
        "1 tablespoon oil",
        "200 milliliters saffron-infused water"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven 220˚C (430˚F).",
        "Combine all the chicken tikka ingredients and marinate in the fridge for at least 1 hour.",
        "Skewer the marinated chicken pieces on bamboo skewers, then place them over a baking tray lined with parchment paper, making sure there is space underneath the chicken to help distribute the heat more evenly.",
        "Reserve the chicken tikka marinade for later use.",
        "Bake the chicken skewers for about 15 minutes, until slightly dark brown on the edges and cooked throughout.",
        "Heat oil in a large pot over medium heat, then sauté the onions with the herbs and spices until just browned.",
        "Add in the chopped tomatoes and fry till soft.",
        "Pour in the yogurt, water, and reserved tikka marinade, and mix it well with the vegetables and spices.",
        "Bring the mixture to a boil, add in the chicken and cook for a further 4-5 minutes. Set aside.",
        "In a large pot, assemble your biryani in the following layers: ⅓ rice, ½ chicken curry, ½ caramelised onion, ½ coriander, ⅓ rice, oil, ½ of the saffron-infused water, ½ chicken curry, ⅓ rice, the rest of the saffron-infused water, ½ caramelised onion, and finally top with the remaining coriander.",
        "Simmer the biryani over a low heat for 10 minutes or until all the water is absorbed and the rice and chicken are heated throughout.",
        "Enjoy!"
    ]
}