{
    "id": "coconut-chicken-curry",
    "link": "https://tasty.co/recipe/coconut-chicken-curry",
    "name": "Coconut Chicken Curry Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/87af163ab7ed4dac9c6bf1c0535fa5b3/BFV39082TrinidadianRotifb2.jpg",
    "description": "Here's what you need: chicken, medium white onion, fresh scallion, garlic, fresh cilantro, curry powder, fresh thyme, fresh parsley, salt, pepper, oil, medium white onion, garlic, curry powder, fresh scallion, coconut milk, pepper, chicken broth, fresh cilantro",
    "recipeCategory": "Lunch",
    "recipeCuisine": "",
    "recipeIngredient": [
        "3 lb chicken, cubed",
        "¼ medium white onion, diced",
        "¼ cup chopped scallions",
        "2 cloves garlic, minced",
        "1 tablespoon chopped cilantro",
        "3 tablespoons curry powder",
        "4 sprigs fresh thyme",
        "2 tablespoons chopped parsley",
        "2 teaspoons salt",
        "½ teaspoon pepper",
        "2 tablespoons oil",
        "½ medium white onion, diced",
        "2 cloves garlic, minced",
        "2 tablespoons curry powder",
        "¼ cup chopped scallions",
        "1 13.5-ounce can coconut milk",
        "Pepper, to taste",
        "1½ cups chicken broth",
        "Cilantro, for garnish"
    ],
    "recipeInstructionSteps": [
        "In a large mixing bowl, combine the chicken with the onion, scallions, garlic, cilantro, curry powder, thyme, parsley, salt, and pepper.  Mix and let marinate for at least 1 hour in the refrigerator.",
        "Heat the oil in a medium skillet over medium heat until shimmering, and add the onion and garlic. Cook for 1-2 minutes, until fragrant.",
        "Add the curry powder and stir well, cooking for 3-4 minutes more.",
        "Add the scallions and coconut milk, increase the heat to medium-high, and cook for 8-10 minutes, until the coconut milk is boiling and begins to thicken.",
        "Add the marinated chicken and stir well. Cook the chicken for 5 minutes, or until starting to brown. Season with pepper.",
        "Add the chicken broth to the pot and stir.",
        "Bring to a rolling boil and cover the pot. Simmer for 30 minutes, until the sauce thickens into a gravy.",
        "Garnish with cilantro.",
        "Enjoy!"
    ]
}