{
    "id": "curry-puffs-2-ways",
    "link": "https://tasty.co/recipe/curry-puffs-2-ways",
    "name": "Curry Puffs 2 Ways Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/171711.jpg",
    "description": "Here's what you need: vegetable oil, medium white onion, chicken breast, salt, black pepper, ground cumin, curry powder, cayenne, medium russet potato, frozen peas, frozen carrot, whole milk, all-purpose flour, puff pastry, egg",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 tablespoon vegetable oil",
        "½ medium white onion, diced",
        "1½ pounds chicken breasts, cubed",
        "2 teaspoon salt",
        "1 teaspoon black pepper",
        "1 teaspoon ground cumin",
        "2 tablespoons curry powder",
        "½ teaspoon cayenne",
        "2 medium russet potatoes, cooked and diced",
        "1 cup frozen peas and carrots, cooked",
        "n/a",
        "2 cups whole milk",
        "All-purpose flour, for dusting",
        "4 sheets of puff pastry, thawed",
        "1 egg, beaten, if baking"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C), or heat a large pot filled halfway with cooking oil to 350°F (180°C). Place a wire rack on top of a baking sheet.",
        "In large pan, add the vegetable oil, onion, chicken, salt, pepper, cumin, curry powder, and cayenne. Cook for 10 minutes, stirring occasionally, until the onion softens.",
        "Add the potatoes, peas and carrots, and milk and stir to combine. Cook for 10 minutes, stirring to break up the potatoes, until the curry thickens to the consistency of mashed potatoes. Remove the pan from the heat and let the curry cool for 30 minutes.",
        "Dust a clean surface with flour and roll out the puff pastry to flatten the seams.",
        "Using a wine glass, cut out 8 circles from each pastry sheet.",
        "Scoop 1 tablespoon of the cooled curry filling in the center of a puff pastry circle. Fold the puff pastry in half, press the edges together, and seal the edges in a folding and rolling motion.",
        "If baking, place the curry puffs on the prepared baking sheet and brush with the egg wash. Bake for 15 minutes, or until golden brown.",
        "If frying, add the curry puffs to the hot oil in batches and fry for 5 minutes, until golden brown.",
        "Let cool for 10 minutes before serving.",
        "Enjoy!"
    ]
}