{
    "id": "ghanaian-jollof-rice-as-made-by-tei-hammond",
    "link": "https://tasty.co/recipe/ghanaian-jollof-rice-as-made-by-tei-hammond",
    "name": "Ghanaian Jollof Rice By Tei Hammond Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/42788e49474248dba75fdfd47114024a/BFV43575_PartyRiceAroundAfrica-FB-V2.jpg",
    "description": "Here's what you need: large yellow onion, vegetable oil, diced tomato, tomato paste, habanero pepper, curry powder, garlic powder, ground ginger, mixed dried herbs, chicken bouillon cube, long grain rice, frozen mixed vegetable, water",
    "recipeCategory": "Dinner",
    "recipeCuisine": "",
    "recipeIngredient": [
        "2 large yellow onions, roughly chopped",
        "⅓ cup plus 2 tablespoons vegetable oil, divided",
        "2 14-ounce cans diced tomatoes",
        "1 6-ounce can tomato paste",
        "1 habanero pepper",
        "2 teaspoons curry powder",
        "1 teaspoon garlic powder",
        "1 teaspoon ground ginger",
        "½ teaspoon mixed dried herbs",
        "3 chicken bouillon cubes, crushed",
        "2½ cups long grain rice, rinsed",
        "1 cup frozen mixed vegetables",
        "1½ cups water"
    ],
    "recipeInstructionSteps": [
        "Add onions and 2 tablespoons of oil to a blender and pulse until smooth. Transfer to a medium bowl.",
        "Add the diced tomatoes, tomato paste, and habanero pepper to the blender, and pulse until smooth. Transfer to a separate medium bowl.",
        "Heat the remaining ⅓ cup (80 ml) of oil in a large, heavy-bottomed pot over medium heat.",
        "Once the oil is shimmering, add the onion puree and cook until the water has cooked out and the puree is starting to brown, about 10 minutes.",
        "Stir in the tomato puree and add the curry powder, garlic powder, ginger, dried herbs,  and crushed bouillon cubes. Cook for 20-30 minutes, stirring occasionally, until the stew has reduced by half and is deep red in color.",
        "Add the rice, mixed vegetables, and water. Bring to a boil, then reduce the heat to low and cover the pot with foil and a lid. Simmer for another 30 minutes, until the rice is cooked through and the liquid is absorbed.",
        "Enjoy!"
    ]
}