{
    "id": "carne-asada-fries",
    "link": "https://tasty.co/recipe/carne-asada-fries",
    "name": "Carne Asada Fries Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/574640258f4842bbb88aba1d029d65c1/carne_asada_fb_thumb_B.jpg",
    "description": "Here's what you need: russet potato, olive oil, salt, garlic powder, paprika, salt, pepper, chili powder, dried oregano, garlic, fresh cilantro, fresh orange juice, fresh lime juice, flank steak, canola oil, shredded Pepper Jack cheese, sour cream, guacamole, diced tomatoes, fresh cilantro leaves, cotija cheese",
    "recipeCategory": "Appetizers",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "2 russet potatoes",
        "2 tablespoon olive oil",
        "1 teaspoon salt",
        "1 teaspoon garlic powder",
        "1 teaspoon paprika",
        "1 teaspoon salt",
        "½ teaspoon pepper",
        "1 teaspoon chili powder",
        "½ teaspoon oregano",
        "2 cloves garlic, minced",
        "2 tablespoons cilantro, minced",
        "½ cup fresh orange juice",
        "¼ cup lime juice",
        "½ pound flank steak",
        "n/a",
        "n/a",
        "n/a",
        "n/a",
        "n/a",
        "n/a",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 450°F (230°C). Line a baking sheet with parchment paper.",
        "Cut the potatoes into wedges. In a large bowl, combine the potatoes, olive oil, salt, garlic powder, and paprika until each fry is fully coated.",
        "Place the fries on the baking sheet and bake for 30-35 minutes, or until the fries are crispy and golden brown.",
        "In a medium bowl, combine the salt, pepper, chili powder, oregano, garlic, cilantro, orange juice, and lime juice. Add the flank steak and marinate for 20 minutes.",
        "Heat a cast-iron skillet with the canola oil over medium heat. Cook the steak for 3 minutes on both sides for medium-cooked steak. Remove the steak and let it rest for 10 minutes. ",
        "After 10 minutes dice the steak.",
        "In an ovenproof skillet, place the baked french fries, Pepper Jack cheese, and diced carne asada, then broil until the cheese is melted.",
        "Before serving, top with sour cream, guacamole, diced tomatoes, cilantro, and grated cotija cheese.",
        "Enjoy!"
    ]
}