{
    "id": "traditional-vietnamese-beef-pho",
    "link": "https://tasty.co/recipe/traditional-vietnamese-beef-pho",
    "name": "Traditional Vietnamese Beef Pho Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/152354.jpg",
    "description": "Here's what you need: mixed beef leg bones, ginger, large garlic, medium yellow onion, cinnamon, whole black peppercorn, whole star anise, beef brisket, kosher salt, fish sauce, boneless sirloin steak, flat rice noodle, fresh mung bean sprouts, small red onion, jalapeño, fresh thai basil, lime, hoisin sauce, siracha",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Vietnamese",
    "recipeIngredient": [
        "10 pounds mixed beef leg bones (shin, knuckle, and marrow bones)",
        "2 large hands of ginger (about 12 ounces), halved lengthwise",
        "1 large head of garlic, halved crosswise",
        "4 medium yellow onions (about 2 pounds), halved lengthwise",
        "8 cinnamon sticks",
        "¼ cup whole black peppercorns",
        "6 whole star anise pods",
        "1 1-pound piece beef brisket",
        "Kosher salt",
        "¼ cup fish sauce, plus more to taste",
        "1 pound boneless sirloin steak",
        "1 pound flat rice noodles, cooked according to package instructions",
        "2-4 cups fresh mung bean sprouts, for serving",
        "1 small red onion, very thinly sliced lengthwise, for serving",
        "1-2 jalapeños, sliced into thin rounds, for serving",
        "1 large bunch Thai basil, for serving",
        "1-2 limes, cut into wedges, for serving",
        "Hoisin sauce, for serving",
        "Sriracha, for serving"
    ],
    "recipeInstructionSteps": [
        "Place the beef bones in a large stock pot, then add enough cold water to cover by 2 inches (5 cm). Bring the mixture to a boil over high heat and cook for 10 minutes to blanch the bones and remove any impurities.",
        "Set a rack in the upper third of the oven and preheat the broiler.",
        "Drain the bones in a colander and rinse under cold running water. Return the blanched bones to the stockpot.",
        "Meanwhile, arrange the ginger, garlic, and onions cut-side up on a rimmed baking sheet and broil on high until the aromatics are deeply charred in spots, 5 minutes. Remove from the oven and add to the stockpot with the bones.",
        "Meanwhile, combine the cinnamon sticks, peppercorns, and star anise in a medium skillet over medium-high heat and toast, shaking the pan occasionally, until the spices are darkened in spots and extremely fragrant, about 5 minutes. Add the toasted spices to the stockpot.",
        "Season the brisket liberally with salt and add it to the stockpot.",
        "Fill the pot with enough cold water to cover everything by 1 inch (2 cm). Bring to a boil over high heat, then reduce the heat to medium to maintain a gentle simmer, skimming off and discarding any fat that floats to the top as needed, until the brisket is fork-tender, 2-3 hours.",
        "Using tongs, transfer the brisket to a plate and let cool completely. Refrigerate the brisket until ready to serve.",
        "Continue to simmer the broth to get as much flavor out of the bones as possible, 3-4 hours more.",
        "Using tongs, remove and discard the bones and aromatics. Slowly strain the broth through a fine mesh strainer set over a large pot. Skim and discard the fat from the broth, then stir in the fish sauce. Taste and add more as desired.",
        "Thinly slice the brisket. Very thinly slice the raw sirloin steak against the grain.",
        "Divide the noodles among 6-8 large bowls, then top with the brisket and raw steak. Ladle the hot broth over the noodles and meat and serve immediately with the bean sprouts, onion, jalapeño, Thai basil, lime wedges, hoisin sauce, and Sriracha alongside.",
        "Enjoy!"
    ]
}