{
    "id": "tiramisu-swiss-roll",
    "link": "https://tasty.co/recipe/tiramisu-swiss-roll",
    "name": "Tiramisu Swiss Roll Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/170430.jpg",
    "description": "Here's what you need: large egg, vanilla cake mix, vegetable oil, water, cocoa powder, heavy cream, espresso powder, mascarpone cheese, sugar, vanilla extract, ladyfinger, espresso, chocolate shaving",
    "recipeCategory": "Desserts",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "6 large eggs",
        "1 16-ounce box of vanilla cake mix",
        "½ cup vegetable oil",
        "½ cup water",
        "½ cup cocoa powder",
        "1 cup heavy cream",
        "1 tablespoon espresso powder",
        "16 ounces mascarpone cheese, whipped",
        "½ cup sugar",
        "1 tablespoon vanilla extract",
        "5 ladyfingers",
        "½ cup espresso, chilled",
        "½ cup chocolate shavings"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C). Line a baking sheet with parchment paper.",
        "In a large bowl, combine the eggs, vanilla cake mix, vegetable oil, and water. Beat with an electric hand mixer to combine.",
        "Pour the cake batter onto the prepared baking sheet and spread with a spatula into an even layer.",
        "Bake for 8 minutes, or until golden brown.",
        "Sift the cocoa powder through a fine-mesh sieve all over a clean kitchen towel.",
        "Flip the cake onto the cocoa powder-dusted towel and remove the parchment paper. Starting with a short end, roll up the cake with the towel.",
        "Refrigerate for 1 hour.",
        "In a medium bowl, whip the heavy cream and espresso powder with an electric hand mixer until fluffy.",
        "Add the mascarpone, sugar, and vanilla to the espresso cream and beat until smooth.",
        "Unroll the cake and spread with the espresso cream in an even layer, leaving 1½ inches (4 cm) from the top empty and reserving 1 cup (225 g) of espresso cream for decoration.",
        "Arrange the ladyfingers on the cake horizontally, 2 inches (5 cm) from the bottom. Brush the ladyfingers with the chilled espresso.",
        "Roll the cake back up, using the towel as a guide but not rolling it inside the cake.",
        "Refrigerate for another hour, then unwrap the cake.",
        "Transfer the remaining espresso cream to a piping bag.",
        "Pipe 6 espresso cream dollops on top of the tiramisu roll. Sprinkle chocolate shavings on top.",
        "Slice and serve.",
        "Enjoy!"
    ]
}