{
    "id": "bacon-guacamole-chicken-bombs",
    "link": "https://tasty.co/recipe/bacon-guacamole-chicken-bombs",
    "name": "Bacon Guacamole Chicken Bombs Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/6a901cbb60244807a74e1d966c97befc/BFV7242_Bacon_Guacamole_Chicken_Bombs-FB1080.jpg",
    "description": "Here's what you need: ripe avocado, white onion, tomato, chopped fresh cilantro, kosher salt, fresh lime juice, boneless, skinless chicken breast, black pepper, bacon, canola oil",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "2 ripe avocados",
        "½ white onion, finely chopped",
        "½ tomato, chopped",
        "2 Tbsp. cilantro, chopped",
        "½ Tbsp. kosher salt",
        "2 Tbsp. freshly squeezed lime juice",
        "4 boneless skinless chicken breasts",
        "Freshly ground black pepper",
        "8 bacon strips",
        "1 Tbsp. canola oil"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 400°F (200°C).",
        "Using a knife, cut around the pit of each avocado, separating the halves from each other. Remove the pits and use a spoon to scoop out the flesh.",
        "In a large bowl, combine the avocado, onion, tomato, cilantro, salt, and lime juice. Mash and stir with a fork until there are no large chunks of avocado left.",
        "Season the chicken breasts with salt and pepper on all sides. Slice chicken breasts in half crosswise.",
        "Cut a slit in the center of each half to make a pocket. Take a heaping spoonful of the guacamole and pack it into the pocket. Pinch the edges closed.",
        "Wrap each chicken breast with 2 strips of bacon, making sure the ends of the bacon all end up on the same side of the chicken.",
        "Heat oil in a large pan over high heat. Sear the bacon-wrapped chicken for 2-3 minutes on each side. Remember to sear the sides of the chicken as well.",
        "Transfer the chicken to a baking dish and bake for 10 minutes, or until cooked through and the internal temperature reaches 165°F (75°C). Serve immediately.",
        "Enjoy!"
    ]
}