{
    "id": "5-layer-cookie-box-brownie-cheesecake",
    "link": "https://tasty.co/recipe/5-layer-cookie-box-brownie-cheesecake",
    "name": "5-Layer Cookie &#x27;Box&#x27; Brownie Cheesecake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/139406.jpg",
    "description": "Here's what you need: chocolate chip cookie dough, brownie mix, cream cheese, sugar, vanilla extract, large egg, double-stuffed chocolate cookie sandwich, whipped cream",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 16-ounce tube chocolate chip cookie dough, room temperature",
        "2 18-ounce boxes brownie mix, batter prepared according to package instructions",
        "24 ounces cream cheese, softened",
        "½ cup sugar",
        "1 teaspoon vanilla extract",
        "1 large egg",
        "40 double-stuffed chocolate sandwich cookies",
        "Whipped cream, for serving"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C).",
        "Line a 10-inch (25-cm) springform pan with 2 layers of plastic wrap long enough to hang over the sides.",
        "Press the cookie dough evenly into a circle along the bottom of the pan, then fold the plastic wrap over the top.",
        "Unclasp the pan and freeze the cookie dough disk.",
        "Re-clasp the pan, then spray the bottom with cooking spray.",
        "Pour in the brownie batter.",
        "Spray the bottom and sides of a 5-inch (12-cm) or deeper, 8-inch (20-cm) wide cake pan, then press the greased cake pan into the brownie mix until the batter reaches halfway up the sides of the springform pan.",
        "Bake for 35 minutes, then cool for about 5 minutes.",
        "Reduce the oven temperature to 300°F (150°C).",
        "In a large bowl, mix together the cream cheese, sugar, vanilla, and egg until there are no lumps and the batter is smooth.",
        "While the brownie is still warm, carefully rotate and press down on the inner cake pan using oven mitts or pads to push the cooked brownie even more up the sides of the springform pan into an even ring. Chill for 30 minutes.",
        "Arrange a single layer of the sandwich cookies, roughly 14-15, on the bottom of the brownie shell as close together as possible.",
        "Pour the cheesecake batter on top of the cookies and spread evenly across the top.",
        "Tap the pan to release any large air bubbles, then bake for about 40 minutes until the cheesecake slightly jiggles in the center. Freeze until the top of the cheesecake is slightly firm, about 30 minutes.",
        "Arrange another layer of cookies on top of the cheesecake layer, then place the frozen cookie dough disk on top.",
        "Tuck in any edges, then bake for 20 minutes.",
        "Chill completely, then release the pan. Slice, and serve with a dollop of whipped cream topped with another cookie!",
        "Enjoy!"
    ]
}