{
    "id": "peppermint-mocha-cannoli",
    "link": "https://tasty.co/recipe/peppermint-mocha-cannoli",
    "name": "Peppermint Mocha Cannoli Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/13359f86be464aceb43b00477a427cc9/BFV4780_PeppermintMochaCannoli-Thumb1080SQ.jpg",
    "description": "Here's what you need: flour, sugar, salt, instant espresso powder, cold butter, egg, vanilla extract, dry white wine, whole milk ricotta cheese, powdered sugar, cocoa powder, instant espresso powder, candy cane, dark chocolate, oil, cannoli forms",
    "recipeCategory": "Desserts",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "2 Cups Flour",
        "1 Tbsp. Sugar",
        "1/4 tsp Salt",
        "1 tsp. Instant Espresso Powder",
        "2 Tbsp. Cold Butter - cubed",
        "1 Egg - Separated",
        "1 tsp Vanilla Extract",
        "1/2 Cup Dry White Wine",
        "2 Cups Whole Milk Ricotta Cheese",
        "1/3 Cup Powdered Sugar",
        "2 Tbsp. Cocoa Powder",
        "3/4 tsp. Instant Espresso Powder",
        "Crushed Candy Canes/peppermints",
        "Dark Chocolate for Melting",
        "Oil for frying",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "Separate egg white and egg yolk into two small bowls. Set aside.",
        "In a large bowl, whisk together flour, sugar, salt, and 1 teaspoon instant espresso powder. Add the butter and work into the flour mixture with your fingertips until it reaches a sandy consistency.",
        "Add the egg yolk, vanilla extract, and white wine. Mix together first with a wooden spoon, then finish by kneading it out on a lightly floured surface with your hands until the dough comes together and becomes smooth. Form into a ball and cover with plastic wrap. Refrigerate dough for 30 minutes to an hour.",
        "Form into a ball and cover with plastic wrap. Refrigerate dough for 30 minutes to an hour.",
        "To make the filling: in a medium bowl whisk together the ricotta cheese, powdered sugar, cocoa powder, and ¾ teaspoon instant espresso powder. Refrigerate until ready to pipe. If the ricotta is especially wet, first remove excess moisture by patting it down with paper towels.",
        "Remove the chilled dough and divide in half. Roll out to as thin as possible on a lightly floured surface. Using a small bowl, cookie cutter, or jar lid, cut into circles (re-rolling the circles and re-cutting if necessary to reach desired thinness). Wrap dough around a lightly greased cannoli form and seal with egg white.",
        "Heat oil to 350˚F (175˚C) and carefully lower the cannoli forms into the hot oil. Fry until golden on all sides. Remove from oil and set on paper towel to drain and cool.",
        "Using a small bowl, cookie cutter, or jar lid, cut into circles (re-rolling the circles and re-cutting if necessary to reach desired thinness).",
        "Remove the cooled pastry and dip ends in melted chocolate and roll in crushed candy canes. Place on wax paper to set.",
        "Wrap dough around a lightly greased cannoli form and seal with egg white.",
        "Before serving, pipe the ricotta mixture into the cannoli. Dust with powdered sugar.",
        "Enjoy!"
    ]
}