{
    "id": "meatless-paella",
    "link": "https://tasty.co/recipe/meatless-paella",
    "name": "Meatless Paella Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/153099.jpg",
    "description": "Here's what you need: olive oil, medium yellow onion, garlic, yellow bell pepper, red bell pepper, green beans, short grain white rice, smoked paprika, sweet paprika, tomato paste, salt, black pepper, diced tomato, vegetable broth, saffron thread, bay leaf, frozen peas, canned artichoke heart, vegan chorizon, fresh flat-leaf parsley, lemon",
    "recipeCategory": "Lunch",
    "recipeCuisine": "",
    "recipeIngredient": [
        "2 tablespoons olive oil",
        "1 medium yellow onion, minced",
        "4 cloves garlic, minced",
        "1 yellow bell pepper, cut into strips",
        "1 red bell pepper, cut into strips",
        "1 cup green beans, halved",
        "1½ cups short grain white rice",
        "½ teaspoon smoked paprika",
        "½ teaspoon sweet paprika",
        "1 tablespoon tomato paste",
        "Salt, to taste",
        "Black pepper, to taste",
        "1 14-ounce can diced tomatoes",
        "3 cups vegetable broth",
        "½ teaspoon saffron threads, crumbled or ½ tablespoon ground turmeric",
        "2 bay leaves",
        "½ cup frozen green peas",
        "½ cup canned artichoke hearts",
        "½ cup vegan chorizo (optional)",
        "½ cup chopped flat-leaf parsley",
        "1 lemon, quartered, for garnish"
    ],
    "recipeInstructionSteps": [
        "Heat the olive oil in a large skillet over medium heat.",
        "Add the onion and cook until translucent, 3-4 minutes.",
        "Add the garlic and cook for about 2 minutes until it is fragrant.",
        "Add the yellow bell peppers, red bell peppers, and green beans. Cook stirring occasionally, for 5 minutes until tender.",
        "Add the rice, smoked paprika, sweet paprika, tomato paste, salt, and pepper. Stir until incorporated. Cook for 1-2 minutes until the rice starts to sizzle.",
        "Add the canned tomatoes. Cook for 5 minutes until the liquid has evaporated slightly.",
        "Add the vegetable broth, saffron threads (crush the saffron threads between your fingertips), and bay leaves. Bring to a boil on high heat. Continue cooking, stirring occasionally, until most of the liquid is absorbed by the rice, about 10 minutes.",
        "Add in the peas, artichokes, and sausage, if using. Cover the pan, reduce the heat to low, and cook for 10 minutes.",
        "Remove the pan from the heat and let sit covered for 10 minutes.",
        "Sprinkle the fresh parsley.",
        "Enjoy!"
    ]
}