{
    "id": "watermelon-poke-bowl",
    "link": "https://tasty.co/recipe/watermelon-poke-bowl",
    "name": "Watermelon &quot;Poke&quot; Bowl Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/178103.jpg",
    "description": "Here's what you need: mini watermelon, soy sauce, rice vinegar, sesame oil, lime, agave nectar, scallion, fresh ginger, white sesame seeds, red chile flakes, medium cucumber, mayonnaise,  sriracha, white rice, avocado, shelled edamame, nori sheets, pickled ginger, fresh cilantro, peanuts, black sesame seeds",
    "recipeCategory": "Dinner",
    "recipeCuisine": "",
    "recipeIngredient": [
        "1 mini watermelon, sliced",
        "6 tablespoons soy sauce",
        "2 teaspoons rice vinegar",
        "1 tablespoon sesame oil",
        "Juice of 1 lime",
        "1 tablespoon agave nectar",
        "2 scallions, minced",
        "2 tablespoons minced fresh ginger",
        "2 tablespoons toasted white sesame seeds",
        "1 teaspoon red chile flakes",
        "1 medium cucumber",
        "6 tablespoons mayonnaise",
        "2 tablespoons Sriracha",
        "Cooked white rice, for serving",
        "Sliced avocado, for serving",
        "Shelled edamame, for serving",
        "Nori sheets, for serving",
        "Pickled ginger, for serving",
        "Fresh cilantro leaves, for serving",
        "Crushed peanuts, for serving",
        "Black sesame seeds, for garnish (optional)"
    ],
    "recipeInstructionSteps": [
        "Using a sharp knife, cut around the watermelon slices rind to remove, then dice into 1-inch (2 cm) cubes.",
        "Transfer 4 cups (600 g) to a medium bowl, reserving the rest for another use.",
        "In a small bowl, combine the soy sauce, rice vinegar, sesame oil, lime juice, agave, scallions, ginger, white sesame seeds, and chile flakes. Mix well.",
        "Pour the marinade over the watermelon cubes and stir. Cover the bowl with plastic wrap and let marinate in the fridge for 1 hour.",
        "Slice the cucumber into thin half moons and set aside.",
        "In a small bowl, combine the mayo and Sriracha.",
        "To assemble the poke bowls, start with rice as a base and top with cucumbers, avocado, edamame, nori, pickled ginger, Sriracha mayo, cilantro, and crushed peanuts.",
        "Add a scoop of the marinated watermelon and use the marinade as a dressing to drizzle over the bowl.",
        "Garnish with black sesame seeds, if desired.",
        "Enjoy!"
    ]
}