{
    "id": "uncle-poohs-shrimp-sausage-and-grits",
    "link": "https://tasty.co/recipe/uncle-poohs-shrimp-sausage-and-grits",
    "name": "Uncle Pooh’s Shrimp, Sausage, And Grits Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/140473.jpg",
    "description": "Here's what you need: whole milk, heavy cream, white corn grit, salt, black pepper, unsalted butter, shredded cheddar cheese, vegetable oil, medium white onion, yellow bell pepper, medium red bell pepper, garlic, andouille sausage, cayenne pepper, chicken stock, large raw shrimp, cayenne pepper, scallion",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "3 cups whole milk",
        "3 cups heavy cream",
        "1 cup white corn grits",
        "2 teaspoons salt, divided",
        "1 teaspoon black pepper, divided",
        "3 tablespoons unsalted butter",
        "½ cup shredded cheddar cheese",
        "2 tablespoons vegetable oil",
        "1 medium white onion, minced",
        "1 yellow bell pepper, diced",
        "1 medium red bell pepper, diced",
        "2 cloves garlic, minced",
        "1 pound andouille sausage, sliced",
        "Pinch of cayenne pepper, plus more to taste",
        "1 cup chicken stock",
        "1 pound large raw shrimp, peeled and deveined",
        "Pinch of cayenne pepper, plus more to taste",
        "Sliced scallions, for serving"
    ],
    "recipeInstructionSteps": [
        "In a medium pot, stir together the milk and heavy cream over medium-high heat.",
        "Bring to a boil.",
        "Slowly whisk the grits into the pot. When mixture begins to bubble, reduce the heat to medium-low. Add 1 teaspoon salt and ½ teaspoon pepper.",
        "Continue whisking the grits frequently for 10-15 minutes until mixture thickened.",
        "Remove the grits from the heat. Add the butter and cheddar cheese, and whisk to incorporate. Set aside.",
        "Heat the vegetable oil in a large skillet on medium-high heat.",
        "Add the onions, peppers, and garlic. Sauté for 2 minutes until onions and peppers have softened.",
        "Add the sausage. Cook until cooked through, about 5-7 minutes.",
        "Slowly add the chicken stock. Stir until well-incorporated.",
        "Add the shrimp. Cook until pink in color, about 3 minutes.",
        "Add the cayenne, remaining teaspoon salt, and remaining ½ teaspoon black pepper. Add additional cayenne pepper, if desired.",
        "Remove from the heat and spoon the sausage and shrimp mixture over the grits.",
        "Sprinkle scallions on top, if desired.",
        "Enjoy!"
    ]
}