{
    "id": "pad-thai-carbonara",
    "link": "https://tasty.co/recipe/pad-thai-carbonara",
    "name": "Pad Thai Carbonara Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/609eae942a304a0e9c2bf46fdc0c2631/BFV33355_HongThaimeeTastyStory-FB.jpg",
    "description": "Here's what you need: wide rice noodle, palm sugar, fish sauce, tamarind paste, pork belly, oil, garlic, shallot, pickled turnip, egg, tofu, green onion, bean sprout, egg yolk, lime, peanuts, red thai chile",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "½ pound wide rice noodles",
        "¼ cup palm sugar",
        "¼ cup fish sauce",
        "¼ cup tamarind paste",
        "6 ounces pork belly, cubed",
        "1 teaspoon oil",
        "2 cloves garlic, minced",
        "2 shallots, minced",
        "1 teaspoon pickled turnip, optional",
        "1 egg",
        "4 ounces tofu, cubed, optional",
        "½ bunch Chinese chives or green onions, sliced, plus more for serving",
        "½ cup bean sprouts, plus more for serving",
        "1 egg yolk",
        "n/a",
        "n/a",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "Soak rice noodles in room temperature water 30 minutes prior to cooking.",
        "In a small saucepan over medium-high heat, whisk together palm sugar, tamarind paste, and fish sauce. Bring to a boil, reduce heat, and reduce for 5 minutes until the sauce thickens and coats the back of a wooden spoon. Remove sauce from heat and set aside.",
        "Heat a cast-iron pan or wok over high heat.",
        "Add pork belly and sear for about 3 minutes.",
        "Add oil, minced garlic, shallots, and turnips, and stir to incorporate.",
        "Move the pork belly to the side of the pan and add the egg. Break the egg up with a spatula or wooden spoon and stir to scramble.",
        "Add soaked rice noodles and stir to evenly incorporate all ingredients, stirring for 1 to 2 minutes.",
        "Add 2 or 3 tablespoons of the reduced sauce and stir.",
        "Add tofu, Chinese chives or green onions, and bean sprouts. Stir to incorporate and remove from heat.",
        "When plating, make a divot in the center of the noodles and add the egg yolk.",
        "Serve immediately with lime, peanuts, more sprouts and chives, and red chiles, if desired.",
        "Enjoy!"
    ]
}