{
    "id": "pad-thai-spaghetti-squash",
    "link": "https://tasty.co/recipe/pad-thai-spaghetti-squash",
    "name": "Pad Thai Spaghetti Squash Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/e093bb6ec56d480badc5bda35b3d4fa3/fb.jpg",
    "description": "Here's what you need: spaghetti squash, olive oil, salt, pepper, diced cucumbers, sliced carrot, diced bell pepper, chopped green onions, diced onion, roasted peanut, fresh cilantro, warm water, soy sauce, sesame oil, honey, fresh lime juice,  sriracha, creamy peanut butter, fresh ginger, garlic",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "1 spaghetti squash",
        "2 tablespoons olive oil",
        "1 teaspoon salt",
        "1 teaspoon pepper",
        "½ large cucumber, peeled and quartered",
        "1 cup carrots, sliced",
        "1 cup bell pepper, diced",
        "½ cup green onions, chopped",
        "½ cup onion, diced",
        "n/a",
        "¼ cup cilantro, chopped",
        "¼ cup water",
        "3 tablespoons soy sauce",
        "1 tablespoon sesame oil",
        "2 tablespoons honey",
        "2 tablespoons fresh lime juice",
        "2 tablespoons Sriracha",
        "½ cup creamy peanut butter",
        "1½  tablespoons peeled and minced fresh ginger",
        "1 tablespoon garlic, minced"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 400ºF (200ºC).",
        "With a sharp knife, slice the squash in half. If the squash is too tough, puncture in several places forming a dotted line around the squash. Microwave for 3-5 minutes to soften. Allow to cool before cutting in half.",
        "Scoop out the seeds, brush with oil, and sprinkle with salt, and pepper. Bake for 40-45 minutes, or until a fork can easily pierce the skin.",
        "Meanwhile, make the peanut sauce: combine the water, soy sauce, sesame oil, honey, lime juice, Sriracha, peanut butter, ginger, and garlic in a liquid measuring cup or medium bowl, stirring to combine.",
        "Remove the squash from the oven and, with a fork, pull at the edges to produce that stringy “spaghetti” quality.",
        "In a large bowl combine the “spaghetti” with the cucumber, carrots, bell pepper, green onion, onions, peanuts, cilantro, and the sauce. Add mixture back to the hollowed out spaghetti squash halves.",
        "Enjoy!"
    ]
}