{
    "id": "thai-style-chicken-and-prawn-fried-noodles-pad-thai",
    "link": "https://tasty.co/recipe/thai-style-chicken-and-prawn-fried-noodles-pad-thai",
    "name": "Thai-Style Chicken And Prawn Fried Noodles (Pad Thai) Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/42429020b12c4849be3948ea1adb16b4/fb_thumb.jpg",
    "description": "Here's what you need: thai fish sauce, tamarind paste, light brown sugar, lime, vegetable oil, egg, chicken breast, raw prawn, spring onion, chilli, fresh coriander, garlic, flat rice noodle, bean sprout, roasted peanut, lime wedge",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Thai",
    "recipeIngredient": [
        "3 tablespoons Thai fish sauce",
        "3 tablespoons tamarind paste",
        "3 tablespoons light brown sugar",
        "½ lime, juiced",
        "4 tablespoons vegetable oil",
        "2 eggs, beaten",
        "2 chicken breasts, finely sliced",
        "200 grams raw prawns, shelled and patted dry",
        "2 spring onions, finely sliced",
        "1 chilli, finely sliced",
        "30 grams coriander, finely chopped",
        "2 grams garlic, crushed",
        "600 grams flat rice noodles, cooked",
        "100 grams bean sprouts",
        "Handful roasted peanuts, roughly chopped",
        "Lime wedges, to serve"
    ],
    "recipeInstructionSteps": [
        "Combine the tamarind, fish sauce, sugar, and lime juice with 1 tbsp water and set aside.",
        "Cook the eggs in 1 tablespoon of oil and set aside.",
        "Add 1 tablespoon of oil to the frying pan. Sear the chicken until golden and cooked through.",
        "Add the prawns to the pan, and cook for about 2 minutes or until they just turn red.",
        "Tip in half of the spring onions, chili, half the coriander, and garlic. Cook for 1 minute until fragrant, then set aside",
        "Heat 1 tablespoon of oil in the wok, then add the noodles and bean sprouts. Stir-fry for 2 minutes until the noodles have separated and everything is heated through.",
        "Add the chicken, prawns, eggs and tamarind sauce. Toss with the noodles until well-coated.",
        "To serve, scatter over the roasted peanuts, remaining spring onions, coriander leaves, and lime wedges.",
        "Enjoy!"
    ]
}