{
    "id": "easy-mosaic-sushi",
    "link": "https://tasty.co/recipe/easy-mosaic-sushi",
    "name": "Easy Mosaic Sushi Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/162224.jpg",
    "description": "Here's what you need: egg, sugar, salt, rice vinegar, sushi rice, nori, english cucumber, sushi-grade salmon, sushi-grade tuna, soy sauce, wasabi, pickled ginger",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "1 egg, beaten",
        "1 tablespoon sugar",
        "1 teaspoon salt",
        "½ cup rice vinegar",
        "1 cup sushi rice, cooked",
        "3 sheets nori",
        "1 English cucumber, quartered lengthwise",
        "4 ounces sushi-grade salmon, sliced into long strips",
        "4 ounces sushi-grade tuna, sliced into long strips",
        "Soy sauce, for serving",
        "Wasabi, for serving",
        "Pickled ginger, for serving"
    ],
    "recipeInstructionSteps": [
        "Heat a medium nonstick pan over medium-high heat. Add the beaten egg to the pan and tilt the pan so the egg covers the bottom in a thin layer. Cook until the egg is firm, 3 minutes. Remove from the pan and let cool, then roll up.",
        "In a liquid measuring cup, mix together the sugar, salt, and rice vinegar and microwave for 2 minutes, or until the solids fully dissolve.",
        "Pour the seasoned sushi vinegar over the cooked rice and gently toss the rice until it comes to room temperature.",
        "Place a sheet of nori on a cutting board. Dip your hands in water and then pick up about half of the seasoned sushi rice and gently arrange it over the nori, spreading evenly all the way to the corners.",
        "Top the rice with another nori sheet, then cut the the sushi crosswise into 4 even strips. Set aside.",
        "Place another sheet of nori on a sushi rolling mat. Place a quartered strip of cucumber on the bottom edge of the nori and another cucumber strip an inch above it. Place 2 of the sushi rice/nori strips on top of the cucumber.",
        "Place a strip of salmon in between the strips of nori. Then, place the rolled omelet on top of the salmon.",
        "Place 2 strips of tuna on either side of the omelet roll. Then, place another piece of salmon on top of the omelette.",
        "Place the last 2 strips of rice and nori over the salmon. Place another strip of cucumber over the top piece of nori and roll the sushi 90 degrees.",
        "Tuck the final piece of cucumber in place and continue to roll the sushi until the nori completely wraps around, making sure to keep the roll as square as possible.",
        "Cut the roll into slices and serve immediately with soy sauce, wasabi, and pickled ginger alongside.",
        "Enjoy!"
    ]
}