{
    "id": "banana-pudding-cheesecake",
    "link": "https://tasty.co/recipe/banana-pudding-cheesecake",
    "name": "Banana Pudding Cheesecake Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/170283.jpg",
    "description": "Here's what you need: nonstick cooking spray, vanilla wafer, unsalted butter, ripe banana, sugar, vegetable oil, large egg, vanilla extract, salt, all-purpose flour, baking powder, whole milk, gelatin powder, banana pudding mix, sugar, vanilla extract, cream cheese, large egg, large banana, whipped cream, vanilla wafer",
    "recipeCategory": "Desserts",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "Nonstick cooking spray",
        "1 11-ounce box of vanilla wafers, divided",
        "1 cup unsalted butter, melted",
        "2 ripe bananas",
        "1 cup sugar",
        "½ cup vegetable oil",
        "1 large egg",
        "1 teaspoon vanilla extract",
        "1 teaspoon salt",
        "1 cup all-purpose flour",
        "1 teaspoon baking powder",
        "2 cups whole milk, hot",
        "2½ teaspoons gelatin powder",
        "2 3-ounce boxes of banana pudding mix",
        "½ cup sugar",
        "1 tablespoon vanilla extract",
        "32 ounces cream cheese",
        "6 large eggs",
        "2 large bananas, sliced, for decoration",
        "Whipped cream, for decoration",
        "7 vanilla wafers, for decoration"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350°F (180°C). Grease a 10-inch (25 cm) springform pan with nonstick spray.",
        "Make the banana bread crust: Set aside 7 vanilla wafers, then add the rest to a zip-top plastic bag and pound with a rolling pin into fine crumbs.",
        "Transfer the crushed wafers to a medium bowl, add the melted butter, and stir to combine.",
        "Pour the crust into the prepared pan and press against the bottom to about ¼ inch (6 mm) thick with a flat-bottomed measuring cup.",
        "In a large bowl, mash the bananas with a fork until smooth. Add the sugar, oil, egg, vanilla, salt, flour, and baking powder. Beat with an electric hand mixer until well-combined.",
        "Pour the banana bread mixture over the crust and spread evenly with a spatula.",
        "Bake for 30 minutes, or until golden brown and a toothpick inserted in the center comes out clean.",
        "Make the cheesecake filling: In a large bowl, combine the milk, gelatin, and banana pudding mix. Beat with an electric hand mixer until thick and smooth.",
        "Add the sugar, vanilla, and cream cheese, and beat again until well-combined.",
        "Add the eggs, 1 at a time, beating well after each addition.",
        "Pour the cheesecake filling over the banana bread crust.",
        "Bake for 1 hour, then turn off the oven and leave the cheesecake in the oven. Prop the oven door open slightly with a kitchen towel to let the hot air slowly escape. After 2 hours, remove the cheesecake from the oven. Refrigerate overnight.",
        "Arrange the sliced bananas on top of the cheesecake. Release the springform, then pipe whipped cream on top of 7 of the bananas. Place the reserved vanilla wafer cookies on top of the whipped cream.",
        "Slice and serve.",
        "Enjoy!"
    ]
}