{
    "id": "freezer-prep-breakfast-burritos",
    "link": "https://tasty.co/recipe/freezer-prep-breakfast-burritos",
    "name": "Freezer-Prep Breakfast Burritos Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/a0666771c1c5434bbe270c433ea72045/fb_thumb.jpg",
    "description": "Here's what you need: tortilla, oil, garlic, tofu, turmeric, paprika, red pepper flakes, nutritional yeast, vegetable stock, hot sauce, onion, fresh spinach, tomato, black beans, bell pepper, mushrooms, plant based meat alternative, pinto bean, potato, sweet potato, corn",
    "recipeCategory": "Breakfast",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "Tortillas",
        "1 tablespoon oil",
        "5 cloves garlic, minced",
        "14 ounces tofu, broken up",
        "1 teaspoon turmeric",
        "1 teaspoon paprika",
        "½ teaspoons red pepper flakes",
        "¼ cup nutritional yeast",
        "¼ cup vegetable stock",
        "Hot sauce, optional",
        "Onions, diced and cooked, optional",
        "Spinach, cooked, optional",
        "Tomatoes, sliced and cooked, optional",
        "Black beans, optional",
        "Peppers, chopped and cooked, optional",
        "Mushrooms, chopped and cooked, optional",
        "Plant-based meat alternatives, cooked, optional",
        "Pinto beans, optional",
        "Potatoes, chopped and cooked, optional",
        "Sweet potatoes, chopped and cooked, optional",
        "Corn, optional"
    ],
    "recipeInstructionSteps": [
        "In a medium pan, add oil and garlic and cook until garlic is lightly browned. Add tofu by pulling pieces off to produce the full “scramble” effect.",
        "Add the turmeric, paprika, red pepper flakes, and nutritional yeast and stir to combine.",
        "Add the vegetable stock and cook until absorbed in the tofu.",
        "Drizzle with hot sauce if you desire.",
        "Spoon some of the scramble in the center of a tortilla and add any fillings you would like.",
        "NOTE: Leave plenty of room on the ends otherwise food will spill out once it&#x27;s folded up.",
        "Fold the left and right sides of the tortilla in toward the center, then roll the bottom (the end nearest you) up towards the top.",
        "Dampen a paper towel and wrap it around the burrito, mimicking the fold of the burrito itself. Do the same with parchment paper.",
        "Place your burritos in a plastic bag and freeze until breakfast.",
        "NOTE: Save for up to 1 month.",
        "When you are ready to eat, take one of the burritos out, remove parchment paper and microwave burrito (still in paper towel) in the microwave for 3 minutes.",
        "Allow to cool for 1 minute.",
        "Enjoy!"
    ]
}