{
    "id": "easy-sushi-sandwiches",
    "link": "https://tasty.co/recipe/easy-sushi-sandwiches",
    "name": "Easy Sushi Sandwiches Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/155344.jpg",
    "description": "Here's what you need: sugar, salt, rice vinegar, short grain rice, nori, shrimp, all-purpose flour, cornstarch, baking powder, salt, egg, ice water, canola oil, salt, avocado, imitation crab, english cucumber, whipped cream cheese, smoked salmon, teriyaki sauce, spicy mayonnaise, soy sauce",
    "recipeCategory": "",
    "recipeCuisine": "",
    "recipeIngredient": [
        "¼ cup sugar",
        "1 tablespoon salt",
        "1 cup rice vinegar",
        "4 cups short grain rice, cooked, hot",
        "8 sheets nori, divided",
        "½ pound shrimp, peeled and deveined",
        "¾ cup all-purpose flour",
        "¼ cup cornstarch",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1 egg",
        "¾ cup ice water",
        "Canola oil, for frying",
        "Salt, to taste",
        "1 avocado, sliced, divided",
        "1 6-ounce can crab, drained",
        "1 English cucumber, thinly sliced, divided",
        "½ cup whipped cream cheese",
        "1 4-ounce package smoked salmon",
        "Teriyaki sauce, to serve",
        "Spicy mayonnaise, to serve",
        "Soy sauce, to serve"
    ],
    "recipeInstructionSteps": [
        "In a bowl, add the sugar, salt, and vinegar, and stir to combine. Microwave for 2 minutes, or until the sugar has dissolved.",
        "Transfer the rice onto a serving bowl and pour the vinegar mixture over the rice.",
        "Using a spatula fold in the vinegar into the rice. Have another person fan the rice while mixing to get it down to room temperature.",
        "Lay 4 sheets of nori onto two sheet pans. Spread half the rice mixture onto the nori on one sheet pan in an even layer. Repeat with the remaining sheet pan.",
        "Refrigerate uncovered for 30 minutes to an hour.",
        "In a bowl, whisk the flour, cornstarch, baking powder, salt, and egg until smooth.",
        "Slowly add the ice water in a steady stream whisking until just mixed.",
        "Dip the shrimp in the batter until fully coated.",
        "Heat a large pot of oil to 350˚F (180˚C).",
        "Add shrimp to the pot and fry until golden brown, about 2 minutes. Transfer the shrimp to a wire rack to drain. Repeat with remaining shrimp.",
        "Once cool, season the shrimp with salt to taste.",
        "Remove the sheet pans with rice from the refrigerator. Place the first sheet of nori and rice onto a cutting board.",
        "Mentally divide the rice sheet into fourths. On one fourth, place a layer of cucumber, a layer of avocado, and top with the crab.",
        "On another fourth, place the sliced avocado and top with the shrimp tempura.",
        "On another fourth, spread a layer of the cream cheese, then top with smoked salmon and a layer of avocado.",
        "On the last fourth add a layer of cucumber and avocado.",
        "Gently invert the other sheet tray with rice onto the sheet tray with toppings, so that the edges are even.",
        "Cut the sushi into 16 even squares.",
        "Serve with teriyaki sauce, spicy mayonnaise, and soy sauce.",
        "Enjoy!"
    ]
}