{
    "id": "how-to-throw-a-sushi-party",
    "link": "https://tasty.co/recipe/how-to-throw-a-sushi-party",
    "name": "How To Throw A Sushi Party Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/ba0c3d060b93495988ddd500e28bfa3c/FB.jpg",
    "description": "Here's what you need: short grain white rice, water, sugar, salt, rice vinegar, sushi-grade tuna, mayonnaise, sriracha sauce, imitation crab, mayonnaise, chicken thighs, teriyaki sauce, cucumber, carrot, avocado, sushi grade nori, soy sauce, wasabi, ginger",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "2 cups short grain white rice",
        "2 cups water",
        "1 tablespoon sugar",
        "1 teaspoon salt",
        "¼ cup rice vinegar",
        "¼ pound tuna",
        "1 tablespoon mayonnaise",
        "1 tablespoon sriracha sauce",
        "4 imitation crab",
        "1 tablespoon mayonnaise",
        "2 chicken thighs",
        "Teriyaki sauce to marinade",
        "1 cucumber",
        "1 carrot",
        "2 avocados",
        "Sushi grade nori (seaweed)",
        "Soy sauce",
        "Wasabi",
        "ginger"
    ],
    "recipeInstructionSteps": [
        "In a bowl wash the rice 3 times with water.",
        "In a pot add rice and water and cover and bring it to boil. Reduce heat and simmer for 10 minutes. Then take off heat and rest for another 15 minutes.",
        "In a microwave safe bowl heat sugar, salt and vinegar for a minute or until the sugar is completely melted.",
        "Transfer the rice onto a serving bowl and pour the vinegar over the rice.",
        "Using a spatula fold in the vinegar and cut into the rice. Have another person fan the rice while mixing to get it down to room temperature.",
        "Prep the fix-ins. Slice tuna and chop until the meat is mashed together. Transfer into a small bowl.",
        "Mix in mayonnaise and sriracha sauce. Set aside",
        "In a medium bowl marinate chicken with your favorite teriyaki sauce. Fully cook chicken and slice and set aside in a bowl.",
        "Cut imitation crab into small pieces. Mix in mayonnaise until fully coated. Set aside.",
        "Cut veggies into thin slices. Cut avocado into bite size pieces as well.",
        "Set up the table: After placing your rice and fix-ins place each sushi rolling station with a bamboo rolling mat. Set out a bowl of water so the rice does not stick to your hands. Have a cutting board close by with a knife. Let’s roll.",
        "On the rolling mat place one sheet of nori. There is a smooth side and a rough side. The rough side will face up.",
        "Wet your hands and grab a handful of rice and place it on your nori. Spread the rice evenly throughout the nori without smushing the rice down. LEAVE SPACE AT THE BOTTOM. (This extra sliver of nori will stick onto the rice when rolling.)",
        "Place the fix-in at the bottom row of the rice.",
        "Grabbing both nori and the mat roll the mat over so the extra space at the bottom touches the other side.",
        "Squeeze down to make a nice tight roll.",
        "Grab the mat and continue rolling over the rice until your roll is complete. Squeeze down along the way to keep the roll from holding its shape.",
        "Transfer your roll onto a cutting board. Have a damp towel close by for your knife. Before you cut give you knife a wipe.",
        "NOTE: This will prevent the rice from sticking to the knife.",
        "Cut your roll into desired sizes.",
        "NOTE: Wrap mat with plastic wrap for inside out rolls.",
        "Repeat steps 13-20 for your veggie roll.",
        "Repeat steps 13-20 for your teriyaki chicken roll.",
        "Repeat steps 13-20 for your California roll.",
        "Enjoy!"
    ]
}