{
    "id": "nobu-style-cup-sushi",
    "link": "https://tasty.co/recipe/nobu-style-cup-sushi",
    "name": "Nobu Style Cup Sushi Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/5ab47955afcc42cf8ad5204ce199aa24/FINAL3.jpg",
    "description": "Here's what you need: sushi rice, water, red vinegar, monk fruit sweetener, salt, mirin, square kombu, soy sauce, sushi-grade tuna, sushi-grade yellowtail, sushi-grade red snapper, sushi-grade salmon, sushi-grade scallops, sushi-grade salmon roe, cooked crab, sushi-grade sea urchin, sushi-grade squid, cooked shrimp, nori, fresh cilantro, jalapeño, caviar, masago",
    "recipeCategory": "",
    "recipeCuisine": "Japanese",
    "recipeIngredient": [
        "5 cups sushi rice",
        "5 cups water",
        "300ml red vinegar (Akazu), divided to 250ml and 50ml",
        "160g monk fruit sweetener",
        "60g salt",
        "20ml mirin",
        "2-inch square kombu",
        "Soy sauce, to taste",
        "Raw tuna, sliced, to taste",
        "Raw yellowtail, sliced, to taste",
        "Red snapper, sliced, to taste",
        "Salmon, sliced, to taste",
        "Scallops, sliced, to taste",
        "Salmon roe, to taste",
        "Crab, to taste",
        "Sea urchin, to taste",
        "Squid, to taste",
        "Shrimp, to taste",
        "Nori, crumbled, to taste",
        "Cilantro, chopped, to taste",
        "Jalapeño, sliced, to taste",
        "Caviar, to taste",
        "Masago, to taste"
    ],
    "recipeInstructionSteps": [
        "Place the rice in a sieve and rinse under water 4-5 times, until the water is clear.",
        "Place the rice and water in a pot and bring to a boil. Once the water is at a rolling boil, put a lid on top and cook for 15 minutes on low heat. Turn off the heat and let it sit for 10 minutes.",
        "In a small saucepan over medium heat, add 250ml (1 cup) red vinegar, monk fruit sweetener, salt, and mirin and Kombu. Once the sweetner and salt are dissolved add 50ml (¼ cup) of the vinegar. Set aside to cool to room temperature.",
        "Place the cooked rice in a wooden tub or a large bowl. Sprinkle 150ml (½ cup) sushi vinegar evenly over the rice while the rice is still hot and mix with a wooden spoon. Cover the rice with a wet tea towel and cool until close to body temperature. Save leftover sushi vinegar for next time.",
        "Place 1-2 tablespoons of rice in a small cup. Spray soy sauce on the rice. Sprinkle some crumbled seaweed on top. Top with thinly sliced fresh seafood or your favorite toppings.",
        "Enjoy!"
    ]
}