{
    "id": "veggie-sushi-4-ways",
    "link": "https://tasty.co/recipe/veggie-sushi-4-ways",
    "name": "Veggie Sushi 4 Ways Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/175796.jpg",
    "description": "Here's what you need: rice vinegar, sugar, salt, sushi rice, black rice, roasted nori, sesame oil, shiitake mushroom, soy sauce, garlic powder, pepper, fresh spinach, cucumber, carrot, vegetable oil, all purpose flour, baking powder, salt, pepper, ice water, medium sweet potato, avocado, avocado, cucumber, mango, teriyaki tofu, red bell pepper, carrot, wasabi, pickled ginger, soy sauce",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Japanese",
    "recipeIngredient": [
        "2½ tablespoons rice vinegar",
        "1 tablespoon sugar",
        "¾ teaspoon salt",
        "3 cups cooked sushi rice",
        "1 cup cooked black rice",
        "4 roasted nori sheets",
        "1 tablespoon sesame oil",
        "1 cup sliced shiitake mushrooms",
        "1 tablespoon soy sauce",
        "¼ teaspoon garlic powder",
        "Pepper, to taste",
        "8 spinach leaves",
        "4-6 cucumber sticks",
        "4-6 carrot sticks",
        "Vegetable oil, for frying",
        "½ cup all-purpose flour",
        "1 teaspoon baking powder",
        "½ teaspoon salt",
        "¼ teaspoon pepper",
        "¾ cup ice water",
        "1 medium sweet potato, cut into sticks",
        "2 slices of avocado",
        "4 slices of avocado",
        "4-6 cucumber sticks",
        "4-6 mango sticks",
        "4-6 baked teriyaki tofu strips",
        "4-6 red bell pepper sticks",
        "4-6 carrot sticks",
        "Wasabi, for serving",
        "Pickled ginger, for serving",
        "Soy sauce, for serving"
    ],
    "recipeInstructionSteps": [
        "In a small pot over medium heat, add the rice vinegar, sugar, and salt and whisk to combine. Bring to a boil and continue whisking until the salt and sugar have dissolved. Remove the pot from the heat.",
        "Add the cooked sushi rice to a large bowl and the cooked black rice to a separate medium bowl. Add ¾ of the rice vinegar mixture to the sushi rice and the remaining ¼ to the forbidden rice. Mix until the vinegar mixture is well distributed.",
        "Make the shiitake veggie roll: Heat the sesame oil in a medium pan over medium heat. Once the oil is simmering, add the shiitake mushrooms, soy sauce, garlic powder, and pepper and cook for 6-8 minutes, until the mushrooms have released their juices and begin to crisp up.",
        "Place 1 sheet of nori over a bamboo sushi mat. Scoop 1 cup (230 g) of sushi rice on top of the nori. Fill a small bowl with water to dip your fingers into--this will prevent them from getting sticky when handling the rice. Using your fingers, spread the rice in an even layer over the nori, leaving a 1-inch (2-cm) border at the top to seal the roll.",
        "Over the bottom quarter of the nori, layer the spinach, cucumber, carrot, and shiitake mushrooms. Use your fingers to hold the vegetables in place while you begin to roll the nori. Squeeze the bamboo mat around the roll as you go to ensure a tight sushi roll. Transfer the sushi roll to a cutting board and cut it in half, then cut each half into quarters for a total of 8 sushi pieces.",
        "Make the sweet potato tempura roll: Heat the vegetable oil in a medium pot until it reaches 375ºF (190ºC).",
        "In a medium bowl, combine the flour, baking powder, salt, and pepper and mix well with a fork. Pour in the ice water and mix until incorporated--some lumps are okay. Drop the sweet potato sticks into the batter and toss with your fingers to ensure they are thoroughly coated.",
        "Transfer a few of the sweet potato sticks at a time to a spider and carefully drop them into the hot oil. Cook for 3-4 minutes, until crispy, then transfer to a paper towel-lined plate.",
        "Place 1 sheet of nori over a bamboo sushi mat. Scoop 1 cup (230 g) of sushi rice on top of the nori. Using your fingers, spread the rice in an even layer over the nori, leaving a 1-inch (2-cm) border at the top to seal the roll.",
        "Over the bottom quarter of the nori, layer the sweet potato tempura and avocado. Use your fingers to hold the vegetables in place while you begin to roll the nori. Squeeze the bamboo mat around the roll as you go to ensure a tight sushi roll. Transfer the sushi roll to a cutting board and cut it in half, then cut each half into quarters for a total of 8 sushi pieces.",
        "Make the avocado cucumber mango roll: Place 1 sheet of nori over a bamboo sushi mat. Scoop the forbidden rice on top of the nori. Using your fingers, spread the rice in an even layer over the nori, leaving a 1-inch (2-cm) border at the top to seal the roll.",
        "Over the bottom quarter of the nori, layer the avocado, cucumber, and mango. Use your fingers to hold the filling in place while you begin to roll the nori. Squeeze the bamboo mat around the roll as you go to ensure a tight sushi roll. Transfer the sushi roll to a cutting board and cut it in half, then cut each half into quarters for a total of 8 sushi pieces.",
        "Make the teriyaki tofu roll: Place 1 sheet of nori over a bamboo sushi mat. Scoop the remaining cup of sushi rice on top of the nori. Using your fingers, spread the rice in an even layer over the nori, leaving a 1-inch (2-cm) border at the top to seal the roll.",
        "Over the bottom quarter of the roll, layer the teriyaki tofu, red bell pepper, and carrot. Use your fingers to hold the filling in place while you begin to roll the nori. Squeeze the bamboo mat around the roll as you go to ensure a tight sushi roll. Transfer the sushi roll to a cutting board and cut it in half, then cut each half into quarters for a total of 8 sushi pieces.",
        "Serve the sushi with wasabi, pickled ginger, and soy sauce.",
        "Enjoy!"
    ]
}