{
    "id": "cape-verde-arroz-de-marisco-as-made-by-kiki-canuto",
    "link": "https://tasty.co/recipe/cape-verde-arroz-de-marisco-as-made-by-kiki-canuto",
    "name": "Cape Verde Arroz De Marisco By Kiki Canuto Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/3b1f93a1eb3140ccac7e7e5e5d068266/BFV43575_PartyRiceAroundAfrica-FB-V2.jpg",
    "description": "Here's what you need: long grain rice, unsalted butter, sea salt, water, extra virgin olive oil, red bell pepper, yellow bell pepper, large yellow onion, garlic, red chili flakes, tomato paste, frozen calamari, medium shrimp, fresh mussel, frozen organic peas, lemon, fresh parsley",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "2 cups long grain white rice, rinsed",
        "4 tablespoons unsalted butter, room temperature, divided",
        "2 teaspoons sea salt, divided",
        "5⅓ cups water, divided",
        "Extra-virgin olive oil, to taste",
        "1 red bell pepper, diced",
        "1 yellow bell pepper, diced",
        "½ large yellow onion, diced",
        "5 cloves garlic, minced",
        "1 teaspoon red chile flakes",
        "1 tablespoon tomato paste",
        "1 8-ounce package frozen calamari, defrosted",
        "1 pound raw medium shrimp, shell on (approximately 35 pieces/pound)",
        "½ pound fresh mussels, shell on",
        "1 cup frozen organic peas, defrosted",
        "Juice of 1 lemon",
        "2 tablespoons chopped fresh parsley leaves, plus whole parsley leaves for garnish"
    ],
    "recipeInstructionSteps": [
        "In an medium pot over high heat, combine the rice, bay leaves, 2 tablespoons of butter, 1 teaspoon of salt, and 4⅓ cups (1 L) of water. Bring to a boil. Cover, reduce the heat to low, and simmer for 20 minutes, or until the rice is cooked and fluffy.",
        "Heat a large sauté pan over medium-high heat. Add a drizzle of olive oil. Toss in the peppers, onion, and garlic. Cook until the onion is slightly translucent, 8-10 minutes.",
        "Add the red pepper flakes, remaining teaspoon of salt, the tomato paste, and remaining cup (240 ml) of water. Stir, cover, and boil for 2-3 minutes.",
        "Add the calamari, shrimp, mussels, and peas. Stir and cover with the lid. Cook until the mussel shells open, 5-6 minutes.",
        "Remove the pan from the heat. Add the lemon juice, remaining 2 tablespoons of butter, and chopped parsley then stir.",
        "Transfer the cooked rice to a large bowl.",
        "Use a slotted spoon to scoop the seafood mixture over the rice. Stir to combine, add ½ cup (120 ml) of the seafood braising liquid, and stir once more.",
        "Garnish with parsley leaves (optional).",
        "Enjoy!"
    ]
}