{
    "id": "cioppino",
    "link": "https://tasty.co/recipe/cioppino",
    "name": "Cioppino (Seafood Tomato Stew) Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/160524.jpg",
    "description": "Here's what you need: unsalted butter, extra virgin olive oil, large carrot, leek, large yellow onion, red bell pepper, small fennel bulb, green bell pepper, celery, garlic, garlic, salt, freshly cracked pepper, tomato paste, dried basil, dried oregano, dried thyme, cayenne, dry white wine, fish stock, crushed italian tomato, bay leaf, sea scallop, shrimp, squid, halibut fillet, manila clam, mussel, sourdough bread, fresh parsley",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "4 tablespoons unsalted butter, divided",
        "1 cup extra-virgin olive oil, divided",
        "2 large carrots, peeled, trimmed, and minced",
        "1 leek, white part only, trimmed, cleaned, and minced",
        "1 large yellow onion, minced",
        "1 red bell pepper, cored, seeded, and minced",
        "1 small fennel bulb, trimmed, and minced",
        "1 green bell pepper, cored, seeded, and minced",
        "2 stalks celery, minced",
        "4 cloves garlic, finely chopped, plus 3 cloves crushed garlic, divided",
        "n/a",
        "Salt, to taste",
        "Freshly cracked black pepper, to taste",
        "6 ounces tomato paste",
        "1 tablespoon dried basil",
        "1 tablespoon dried oregano",
        "1 tablespoon dried thyme",
        "1 teaspoon cayenne",
        "2 cups dry white wine, divided",
        "4 cups fish stock",
        "2 15-ounce cans crushed Italian tomatoes",
        "3 bay leaves",
        "½ pound sea scallops",
        "½ pound shrimp, peeled and deveined",
        "½ pound squid, sliced",
        "½ pound halibut fillet, cut into large pieces",
        "½ pound manila clams, scrubbed",
        "½ pound mussels, scrubbed",
        "Grilled sourdough bread, for serving",
        "½ bunch fresh parsley, chopped, for garnish"
    ],
    "recipeInstructionSteps": [
        "In a large pot over medium heat, melt together 2 tablespoons of butter and 2 tablespoons of olive oil. Add the carrot, leek, onion, red bell pepper, fennel, green bell pepper, celery, and garlic. Season with salt and pepper. Stir and cook until the vegetables are softened, about 15 minutes.",
        "Scoop half of the matignon (sautéed minced vegetables) from the pan and set aside. Stir the tomato paste, basil, oregano, thyme, and cayenne into the remaining vegetables and cook until the tomato paste starts to brown, about 10 minutes.",
        "Next, add half of the white wine to deglaze the pan, stirring to loosen any bits stuck to the bottom of the pot.",
        "Add the fish stock, crushed tomatoes, and bay leaves. Stir together, bring to a boil, then reduce the heat to low, cover, and simmer for 30 minutes.",
        "In a large skillet, heat 2 tablespoons of olive oil over medium-high heat. Season all of the seafood with salt and pepper.",
        "Add the scallops to the pan and sear the first side until golden brown, 3 minutes. Flip and sear on the other side for another 3 minutes. Remove from the pan and set aside. Wipe out the pan if needed.",
        "Add more olive oil as needed, then add the shrimp to the pan and cook for 3 minutes on one side. Flip  and cook on the other side for 3 minutes more. Set aside.",
        "Add more olive oil and the squid to the hot pan and sauté until cooked, 5 minutes.",
        "Add more olive oil and the halibut to the hot pan, along with the crushed garlic and remaining 2 tablespoons of butter. Sear the halibut on one side, then flip and cook on the other side for 3 minutes. Baste the fish with the melted garlic butter as the second side cooks. Remove from the pan and set aside.",
        "Add the clams and mussels to the pan, pour in the remaining cup of white white, then cover the pot and steam for 5 minutes, until the shellfish pop open. Remove the pan from the heat.",
        "Transfer all of the cooked seafood, along with the leftover shellfish steaming liquid and reserved matignon, to the simmering stew; or plate the seafood and reserved matignon artfully in wide bowls and pour the hot stew over the top.",
        "Serve with grilled sourdough bread and garnish with parsley.",
        "Enjoy!"
    ]
}