{
    "id": "mussels-steamed-in-beer",
    "link": "https://tasty.co/recipe/mussels-steamed-in-beer",
    "name": "Mussels Steamed In Beer Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/168679.jpg",
    "description": "Here's what you need: vegetable oil, large white onion, garlic, jalapeño, ground cumin, ground coriander, chili powder, vine-ripe tomato, kosher salt, freshly ground black pepper, light mexican  beer, mussels, fresh cilantro leaves, lime wedge, bolillo bread",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Seafood",
    "recipeIngredient": [
        "3 tablespoons vegetable oil",
        "1 large white onion, finely chopped",
        "4 garlic cloves, finely chopped",
        "1 jalapeño, stemmed, seeded, and finely chopped (optional)",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "teaspoon chili powder",
        "2 vine-ripe tomatoes, cored and roughly chopped",
        "Kosher salt and freshly ground black pepper",
        "n/a",
        "1 (12-ounce) bottle or can light Mexican beer, such as Modelo Especial, Tecate, or Corona",
        "4 pounds mussels, debearded and scrubbed clean",
        "1/4 cup lightly-packed cilantro leaves, roughly chopped, plus additional whole leaves for serving",
        "Lime wedges and toasted bolillo, telera, or Cuban sandwich rolls, for serving",
        "n/a"
    ],
    "recipeInstructionSteps": [
        "Heat the oil in a large pot over high heat and swirl to evenly coat. Add the onion, garlic, and jalapeño. Cook, stirring, until softened, 4 minutes.",
        "Add the cumin, coriander, and chili powder. Cook, stirring, until fragrant, about 30 seconds.",
        "Add the tomatoes, season with salt and pepper. Cook, stirring, until softened and their liquid is almost evaporated, 4 minutes.",
        "Pour in the beer and bring to a boil.",
        "Add the mussels, immediately cover the pot, and cook, occasionally shaking the pot, until all mussels are opened, 6 minutes.",
        "Sprinkle the mussels with the chopped cilantro leaves, then divide among 4 bowls.",
        "Garnish with whole cilantro leaves and serve the mussels while hot with lime wedges for squeezing and bread for soaking up the cooking broth.",
        "Enjoy!"
    ]
}