{
    "id": "french-pepper-steak-steak-au-poivre",
    "link": "https://tasty.co/recipe/french-pepper-steak-steak-au-poivre",
    "name": "French Pepper Steak (Steak Au Poivre) Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/9f9bedec8e364ee799e5b991b9be148b/FB_2.jpg",
    "description": "Here's what you need: new york strip steak, kosher salt, coarsely ground black pepper, vegetable oil, butter, cream, brandy or cognac, dijon mustard",
    "recipeCategory": "Dinner",
    "recipeCuisine": "French",
    "recipeIngredient": [
        "1 14-ounce New York strip steak (or other steak of good quality)",
        "2 teaspoons kosher salt",
        "2 tablespoons coarsely ground black pepper",
        "1 tablespoon vegetable oil",
        "2 tablespoons butter",
        "1 cup cream",
        "⅓ cup brandy or cognac",
        "1 tablespoon dijon mustard"
    ],
    "recipeInstructionSteps": [
        "Liberally season steak with salt and pepper, being sure to coat the entire surface of the meat. Using your hands, press the seasoning into the meat to create an even coating.",
        "Heat the vegetable oil and 1 tablespoon of butter in a large skillet over medium-high heat until just smoking. Add the steak to the pan and sear for 4 minutes. Turn and sear the other side for another 4 minutes, for medium-rare. If steak has a fat-cap on its side, be sure to sear it as well for 30 seconds to 1 minute. Once cooked to desired doneness, transfer the steak to a cutting board to rest.",
        "Reduce the heat to medium and add the brandy to the skillet. Allow the brandy to cook down for about 1 minute while using a whisk to scrape off any browned bits in the bottom of the pan. Once the brandy has reduced by half, add the cream and continue to whisk until combined. Add the Dijon mustard and remaining tablespoon of butter and continue to cook until mixture begins to reduce and thicken, 5-7 minutes. The final pan sauce should have a rich consistency and coat the back of a spoon. Reduce the heat to low.",
        "Slice the steak into ½-inch (1.5cm) pieces. Pour cream sauce over the top and serve.",
        "Enjoy!"
    ]
}