{
    "id": "stuffed-steak-rolls",
    "link": "https://tasty.co/recipe/stuffed-steak-rolls",
    "name": "Stuffed Steak Rolls Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/f0ca1b8062ba402787c91137b3679c0f/bfv7231_Stuffed_Steak_Rolls-fb1080.jpg",
    "description": "Here's what you need: canola oil, garlic, sweet onion, mushrooms, kosher salt, freshly ground black pepper, flank steak, baby spinach, provolone cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "2 tablespoons canola oil, divided",
        "3 tablespoons chopped garlic",
        "2 sweet onions, such as Vidalia, chopped",
        "2 cups mushrooms, thinly sliced",
        "½ tablespoon kosher salt",
        "½ tablespoon freshly ground black pepper",
        "2 pounds flank steak",
        "1 (4-ounce) package baby spinach",
        "9 slices provolone cheese"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350°F (175°C).",
        "Heat one tablespoon of the oil in a pan over medium-high heat. Combine the garlic, onions, mushrooms, salt, and pepper in the pan and cook until almost all of the moisture has evaporated and the onions are caramelizing, 15–20 minutes. Remove from heat and set aside.",
        "Lay the flank steak on a cutting board. Add salt and pepper on both sides, to taste.",
        "Spoon the mushroom and onion mixture on top, spreading it evenly across the steak. Sprinkle the spinach on top, followed by the slices of provolone. Press down lightly to compress the spinach.",
        "Starting at the bottom of the flank steak, roll it up tightly, making sure the grain of the meat is running horizontally. Use six toothpicks to secure the steak roll. Slice the steak roll into six equal rolls.",
        "Heat the remaining oil in a pan over high heat. Sear the steak rolls on one side for one to two minutes, then flip. Sear the second side for about one minute, then bake for 10–15 minutes, until medium rare.",
        "Remove the toothpicks, then serve!",
        "Enjoy!"
    ]
}