{
    "id": "veggie-stuffed-steak-roll",
    "link": "https://tasty.co/recipe/veggie-stuffed-steak-roll",
    "name": "Veggie Stuffed Steak Roll Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/b3f0bb3d6e254e78abbda6084faad83a/BFV16261_VeggieStuffedSteakRollsThumb.jpg",
    "description": "Here's what you need: oil, red bell pepper, yellow bell pepper, white onion, salt, black pepper, garlic, flank steak, spinach, shredded mozzarella cheese, long toothpicks",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "1 tablespoon oil, plus more for searing",
        "½ red bell pepper, thinly sliced",
        "½ yellow bell pepper",
        "½ white onion, thinly sliced",
        "½ teaspoon salt, plus more seasoning",
        "½ teaspoon black pepper, plus more for seasoning",
        "3 cloves garlic, minced",
        "2 pounds flank steak, flattened as much as possible",
        "1½ cups spinach",
        "⅓ cup shredded mozzarella cheese",
        "Long toothpicks or short skewers"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 350°F (180°C).",
        "Heat the oil in an oven-proof skillet.  Toss in the bell peppers, onions, salt, pepper, and garlic, and sauté until the veggies have softened, about 10 minutes.",
        "Season the flank steak on both sides with a good pinch of salt and black pepper.",
        "Sprinkle on the spinach in an even layer and top with the sautéed peppers.",
        "Sprinkle the mozzarella cheese over the veggies and tightly wrap the steak into a roll.",
        "Skewer the steak with toothpicks about 1½ inches (4 cm) apart so that the steak will hold its shape.",
        "Slice between the toothpicks to create individual steak rolls.",
        "Heat a few more tablespoons of oil in the skillet.  When the oil has begun to smoke slightly, sear the steak rolls until browned, about 2 minutes per side.",
        "NOTE: To bake the entire steak roll at one time, simply sear each steak roll in a large skillet and transfer to a parchment-lined baking sheet.  Once each roll has been seared and transferred to the baking sheet, proceed with steps 10-12.",
        "Transfer the skillet to the oven and bake for 10-15 minutes, or until it has reached desired level of doneness.",
        "Let the steak rest for 5 minutes before removing toothpicks.",
        "Enjoy!"
    ]
}