{
    "id": "20-minute-beef-and-broccoli-noodle-stir-fry",
    "link": "https://tasty.co/recipe/20-minute-beef-and-broccoli-noodle-stir-fry",
    "name": "20-Minute Beef And Broccoli Noodle Stir-Fry Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/174425.jpg",
    "description": "Here's what you need: instant ramen, water, garlic, cornstarch, sesame oil, lime, soy sauce, broccoli floret, olive oil, flank steak, medium yellow onion, green onion, fresh cilantro, sesame seeds",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Chinese",
    "recipeIngredient": [
        "3 3-ounce packages instant ramen",
        "8 cups boiling water",
        "1 clove garlic, minced",
        "1 teaspoon cornstarch",
        "2 tablespoons sesame oil",
        "Juice of 1 lime",
        "¼ cup plus 1 tablespoon soy sauce",
        "2 cups broccoli florets",
        "1 tablespoon olive oil, divided",
        "¾ pound flank steak, thinly sliced",
        "½ medium yellow onion, thinly sliced",
        "2 tablespoons sliced green onions",
        "2 tablespoons chopped fresh cilantro",
        "1½ teaspoons toasted sesame seeds"
    ],
    "recipeInstructionSteps": [
        "Place the ramen noodles in a large bowl (discard the seasoning packets or save for another use) and pour the boiling water over them. Let sit for 6 minutes, stirring every now and then to break up the noodle blocks. Drain and rinse under cold water. Set aside.",
        "In a small bowl, combine the garlic, cornstarch, sesame oil, lime juice, and soy sauce. Stir well, then set aside.",
        "Place the broccoli in a large, microwave-safe bowl and microwave for 1½ minutes, until soft. Set aside.",
        "Heat 1 teaspoon of olive oil in a large, nonstick pan over high heat. Add the steak to the pan and toss with 2 tablespoons of the reserved sauce. Cook until browned, about 2 minutes. Remove from the pan and set aside.",
        "Heat another teaspoon of olive oil in the pan, then add the onion. Cook, stirring often, until browned, about 4 minutes.",
        "Add the broccoli and cook until lightly browned, about 2 minutes. Remove from the pan and set aside.",
        "Add the remaining teaspoon of olive oil to the pan, then add the noodles and the remaining sauce. Cook, stirring constantly, until the noodles soak up the sauce. Return the cooked vegetables and steak to the pan and stir to distribute.",
        "Transfer the noodles to a serving dish and garnish with green onions, cilantro, and sesame seeds, if using.",
        "Enjoy!"
    ]
}