{
    "id": "one-pot-chicken-chow-mein",
    "link": "https://tasty.co/recipe/one-pot-chicken-chow-mein",
    "name": "One-pot Chicken Chow Mein Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/2ba582a63752469e87c67b67448a0966/BFV17850_OnePotChickenChowMein_Thumb.jpg",
    "description": "Here's what you need: soy sauce, ginger, garlic, oyster sauce, sesame oil, sugar, red pepper flakes, pepper, chicken breast, onion, celery, carrot, cabbage, ramen noodle, chicken broth, scallion",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Fusion",
    "recipeIngredient": [
        "⅓ cup soy sauce,",
        "1 tablespoon ginger, minced",
        "1 tablespoon garlic, minced",
        "1 tablespoon oyster sauce",
        "1 tablespoon sesame oil",
        "1 tablespoon sugar",
        "¼ teaspoon red pepper flakes",
        "Pepper, to taste",
        "2 chicken breasts, cubed",
        "½ onion, julienned",
        "3 stalks celery, sliced",
        "4 carrots, julienned",
        "3 cups cabbage, shredded",
        "2 packages ramen noodles (without the seasoning packets)",
        "1½ cups chicken broth",
        "Scallions"
    ],
    "recipeInstructionSteps": [
        "In a bowl, mix soy sauce, ginger, garlic, oyster sauce, sesame oil, sugar, red pepper flakes, and pepper.",
        "Place chicken cubes into a re-sealable plastic bag pour half of the marinade into the bag and save the rest for later.",
        "Let the chicken marinate in the refrigerator for at least an hour.",
        "Pour the marinated chicken into a large pot and cook over medium-high heat. Remove chicken from the pot.",
        "Add sesame oil to the bottom of the pot and add the onion, celery, carrots, and cabbage. Sauté until the onions are translucent.",
        "Place both of the ramen noodle bricks into the bottom of the pot.",
        "Pour in chicken broth over the noodles.",
        "Cover the noodles with the vegetables as much as possible. Cover the pot with a lid and simmer for 5-7 minutes or until the noodles are cooked through.",
        "Break up the noodles and add back the chicken, and pour in the rest of the marinade from earlier.",
        "Garnish with scallions.",
        "Enjoy!"
    ]
}