{
    "id": "cheesy-scalloped-potatoes",
    "link": "https://tasty.co/recipe/cheesy-scalloped-potatoes",
    "name": "“Cheesy” Scalloped Potatoes Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/6aa961a0b8ca4645921e0e5961d7a12f/DairyFreeHolidaySidesFBFinal.jpg",
    "description": "Here's what you need: medium yukon gold potato, vegan butter, garlic, all-purpose flour, non-dairy milk, low sodium vegetable broth, salt, pepper, nutritional yeast, medium yellow onion, fresh parsley",
    "recipeCategory": "Sides",
    "recipeCuisine": "",
    "recipeIngredient": [
        "4 medium Yukon Gold potatoes, peeled",
        "2 tablespoons vegan butter",
        "2 cloves garlic, minced",
        "2 tablespoons all-purpose flour",
        "2 cups non-dairy milk",
        "1½ cups low-sodium vegetable broth",
        "1 teaspoon salt",
        "½ teaspoon pepper",
        "⅓ cup nutritional yeast",
        "½ medium yellow onion, sliced into rings",
        "Chopped parsley, to garnish"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 400°F (200°C).",
        "Thinly slice the potatoes into rounds about ⅛-inch (3 mm) thick. Submerge in a large bowl of water to keep from browning and set aside.",
        "In a medium pot over low heat, melt the butter. Once the butter begins to foam, add the garlic and cook for 2-3 minutes, until fragrant. Add the flour and stir until flour and butter resemble the consistency of wet sand, creating a roux.",
        "While stirring continuously, add the non-dairy milk, vegetable broth, salt, and pepper and bring to a boil. Stir in the nutritional yeast and continue to cook for 2-3 minutes, or until the sauce thickens. Remove from the heat.",
        "In a medium baking dish, add 2 layers of the sliced potatoes, followed by a layer of the sliced onions. Pour on half of the cheese sauce and spread with a spatula to coat all of the potatoes and onions. Add another 2 layers of potatoes and pour on the remaining cheese sauce.",
        "Cover with a lid or foil and bake for 1 hour. Then, uncover and bake for 10-15 minutes more, until the top is golden and bubbling and the potatoes are tender.",
        "Garnish with parsley and serve warm.",
        "Enjoy!"
    ]
}