{
    "id": "potato-crusted-pizza",
    "link": "https://tasty.co/recipe/potato-crusted-pizza",
    "name": "Heart-Shaped Scalloped Potato–Crust Pizza Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/134703.jpg",
    "description": "Here's what you need: red potato, sea salt, garlic powder, black pepper, tomato sauce, shredded mozzarella cheese, mozzarella cheese, fresh basil, tomato sauce, shredded mozzarella cheese, shredded cheddar cheese, mozzarella cheese, red onion, barbecue chicken breast, fresh parsley, bacon, tomato sauce, shredded mozzarella cheese, pepperoni, Italian sausage, mushroom, white onion, green pepper, spinach artichoke dip",
    "recipeCategory": "Lunch",
    "recipeCuisine": "Italian",
    "recipeIngredient": [
        "5 red potatoes",
        "1 teaspoon salt",
        "1 teaspoon garlic powder",
        "1 teaspoon black pepper",
        "2 tablespoons tomato sauce",
        "⅓ cup shredded mozzarella",
        "4 ounces mozzarella, sliced, to serve",
        "2 tablespoons basil, roughly torn",
        "2 tablespoons tomato sauce",
        "⅓ cup shredded mozzarella",
        "⅓ cup shredded cheddar",
        "4 ounces mozzarella, sliced, to serve",
        "⅛ red onion, thinly sliced",
        "½ barbecue chicken breast, cooked, sliced",
        "2 tablespoon parsley, finely chopped",
        "1 bacon strip, finely chopped",
        "2 tablespoons tomato sauce",
        "⅓ cup shredded mozzarella",
        "1 pepperoni",
        "1 Italian sausage, diced",
        "1 mushroom, thinly sliced",
        "⅛ white onion, thinly sliced",
        "⅛ green pepper, thinly sliced",
        "¼ cup spinach artichoke dip"
    ],
    "recipeInstructionSteps": [
        "Preheat oven to 400˚F (200˚C).",
        "Thinly slice the potatoes using a mandoline and a hand guard.",
        "Fill the bowl of sliced potatoes with water to rinse off excess starch.",
        "Drain the potatoes through colander and transfer back into the bowl.",
        "Add the salt, garlic powder, and black pepper, and mix thoroughly until fully coated.",
        "Assemble the potato slices in heart shape onto a parchment paper-lined baking sheet.",
        "Place a sheet of parchment paper on top of the potatoes, and add a pan with heavy ovenproof weight, such as a cast-iron pan.",
        "Bake for 50 minutes.",
        "Remove the parchment paper, baking sheet, and weight on top of the potatoes.",
        "For the Classic toppings, add tomato sauce, mozzarella, fresh mozzarella, and basil in the upper left corner of the potato heart.",
        "For Barbeque Chicken toppings, add tomato sauce, mozzarella, cheddar, red onion, BBQ chicken, parsley, and bacon in the lower left corner of the potato heart.",
        "For Supreme Combo toppings, add tomato sauce, mozzarella, pepperoni, Italian sausage, mushroom, white onion, and green pepper in the lower right corner of the potato heart.",
        "For Spinach Artichoke toppings, add the spinach artichoke dip in the upper right corner of the potato heart.",
        "Bake for 10 minutes.",
        "Enjoy!"
    ]
}