{
    "id": "scalloped-potato-crusted-rib-eye",
    "link": "https://tasty.co/recipe/scalloped-potato-crusted-rib-eye",
    "name": "Scalloped Potato–crusted Rib Eye Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/156012.jpg",
    "description": "Here's what you need: medium white onion, crimini mushroom, fresh spinach, garlic, salt, pepper, beef ribeye, canola oil, prosciutto, mayonnaise, dried thyme, lemon juice, large russet potato, grated parmesan cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "",
    "recipeIngredient": [
        "1 medium white onion, finely diced",
        "¾ pound crimini mushrooms, minced",
        "4 cups fresh spinach, chopped",
        "1½ tablespoons minced garlic, divided",
        "Salt, to taste",
        "Pepper, to taste",
        "2-pound beef rib eye",
        "3 tablespoons canola oil, divided",
        "½ pound sliced prosciutto",
        "¼ cup mayonnaise",
        "½ teaspoon dried thyme",
        "1 tablespoon lemon juice",
        "2 large russet potatoes, washed and peeled",
        "2 cups grated Parmesan cheese, divided, plus more for sprinkling"
    ],
    "recipeInstructionSteps": [
        "Preheat the oven to 350˚F (180˚C).",
        "Pour 1 tablespoon of oil into a medium skillet over medium heat and sauté the onion, mushrooms, and spinach for about 5-7 minutes, or until the onions begin to turn translucent. Add 1 tablespoon of garlic, salt, and pepper and cook, stirring occasionally, until all the liquid evaporates and the mixture becomes a thick paste. Remove from the pan and let cool completely.",
        "Generously season the rib eye all over with salt and pepper. Heat the oil in a medium skillet over medium-high heat. Sear the meat for 3-5 minutes on all sides, until a crust has formed all over. Let rest on a wire rack for 10 minutes.",
        "Arrange overlapping sheets of plastic wrap until you have a surface twice the length and width of the rib eye. Lay overlapping strips of prosciutto on the plastic in an even layer, making sure the prosciutto sheet is large enough to cover the rib eye. Spread the cooled mushroom mixture evenly over the prosciutto.",
        "In a small bowl, stir together the mayonnaise, remaining ½ tablespoon minced garlic, ½ teaspoon salt, the thyme, and lemon juice. Generously brush the rib eye with the garlic mayo, then place the rib eye in the center of the prosciutto-mushroom sheet.",
        "Keeping everything even and tight, wrap the rib eye with the prosciutto, using the plastic wrap to help wrap it tightly and to seal the ends. Tuck the ends of the plastic wrap underneath the wrapped rib eye to keep its shape and chill in the refrigerator for 30 minutes.",
        "Using a knife or mandoline, carefully cut the potatoes into slices ⅛-inch (3 mm) thick and lay on paper towels. Sprinkle the potato slices with salt and let sit for 10 minutes to draw out any excess moisture. Pat the potatoes dry.",
        "Evenly sprinkle 1 cup (115 g) of Parmesan cheese over a parchment-lined baking sheet.",
        "Arrange the potato slices in overlapping rows over the Parmesan until the pan is covered. Sprinkle the remaining cup of Parmesan evenly over the potatoes.",
        "Bake for 30 minutes, until slightly golden and the potatoes are still flexible. Remove the potatoes from the oven and increase the heat to 400˚F (200˚C).",
        "Place the chilled, prosciutto-wrapped rib eye in the center of the potato sheet. Fold the potatoes over the rib eye and peel back the parchment. Sprinkle Parmesan under the seam (it will help seal the potato layer) and all over the top.",
        "Loosely cover the pan with foil and bake for 30 minutes. Remove the foil and bake for 20 minutes more, or until the potatoes are golden brown and the internal temperature of the beef is at least 135°F (57°C) for medium-rare. Rest for 10 minutes before slicing.",
        "Enjoy!"
    ]
}