{
    "id": "scalloped-potato-dome",
    "link": "https://tasty.co/recipe/scalloped-potato-dome",
    "name": "Scalloped Potato Dome Recipe by Tasty",
    "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/123833.jpg",
    "description": "Here's what you need: red potato, salt, black pepper, heavy cream, butter, yukon gold potato, cheddar cheese, bacon, chives, puff pastry, onion powder, garlic, grated parmesan cheese",
    "recipeCategory": "Dinner",
    "recipeCuisine": "American",
    "recipeIngredient": [
        "5-7 medium red potatoes",
        "2 teaspoons salt",
        "1 teaspoon black pepper",
        "2 cups heavy cream",
        "2 tablespoons butter, softened",
        "6-8 medium or large Yukon gold potatoes",
        "10 slices cheddar cheese",
        "6 strips bacon, cooked until crispy",
        "¼ cup chives, finely chopped plus more to serve",
        "1 sheet puff pastry, cut into a 9-inch circle",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "¼ cup grated Parmesan cheese"
    ],
    "recipeInstructionSteps": [
        "Using a mandolin, slice the red potatoes to about 3 millimeter-thick slices.",
        "Slice the gold potatoes to about 5-6 millimeters thick.",
        "In a large bowl, combine the red potatoes with the salt, pepper, and heavy cream, and stir until evenly coated.",
        "Preheat oven to 350°F (180°C).",
        "Butter an oven-safe, 8 or 9-inch (20 or 23-cm), stainless steel mixing bowl.",
        "Starting from the center, lay the red potatoes in an overlapping, circular fashion, making sure they make good contact and are sticking to the bowl. Repeat the circular pattern up until roughly ½-inch (1-cm) from the top of the bowl.",
        "Place the sliced gold potatoes into the cream, stirring until fully coated with cream.",
        "Shake off the excess cream, then layer the potato slices at the bottom of the bowl, building in a similar circular fashion.",
        "After 2-3 rotations, place down 2 slices of cheddar. To fill the gaps, you might need to cut 2 more slices into halves and use those strips near the edges.",
        "Layer another 2 rotations of gold potatoes.",
        "Place the strips of bacon in a single layer across the potatoes.",
        "Layer another 2 rotations of gold potatoes.",
        "Sprinkle the chives in an even layer across the potatoes.",
        "Layer another 2 rotations of gold potatoes.",
        "Fan out the rest of the cheddar slices in a circular pattern on top of the potatoes.",
        "Layer another 2 rotations of gold potatoes.",
        "Place the circle of puff pastry on top, pressing it lightly into the potatoes.",
        "Bake, uncovered, for 1 hour and 30 minutes. If the pastry or the edges of potatoes near the top are starting to get too dark, cover the dish with foil and continue baking.",
        "Cool until the bottom of the dish is no longer warm.",
        "While the potatoes bake, prepare the garlic cream sauce by transferring the cream from the soaked potatoes into a medium saucepan or pot.",
        "Add the onion powder, garlic powder, and Parmesan, stirring while bringing to a boil. Set aside and reheat when serving.",
        "Preheat oven to 400°F (200°C).",
        "Run a knife along the sides of the bowl to make sure the potatoes are release, then invert it onto a baking tray.",
        "Bake for another 10 minutes or so, until the slices start to turn golden brown and slightly crispy.",
        "Transfer the dome to a cutting board, then slice into wedges.",
        "Serve with the cream sauce, a sprinkle of chives.",
        "Enjoy!"
    ]
}