{
    "id": "bibimbap-by-chef-esther-choi",
    "link": "https://tasty.co/recipe/bibimbap-by-chef-esther-choi",
    "name": "Bibimbap By Chef Esther Choi Recipe by Tasty",
    "image": "https://img.buzzfeed.com/video-api-prod/assets/870c3f31ac2f4993a121053ce1255840/fb4.jpg",
    "description": "Here's what you need: ribeye steak, green onion, red chili, garlic, soy sauce, sesame oil, sugar, mirin, fresh spinach, sesame oil, salt, bean sprout, yellow squash, zucchini, daikon radish, water, carrot, dried shiitake mushroom, hot water, garlic, gochugaru, sesame seeds, cucumber, purple rice, fried egg, green onions, nori seaweed, kimchi, gochujang",
    "recipeCategory": "Dinner",
    "recipeCuisine": "Korean",
    "recipeIngredient": [
        "8 ounces ribeye steak, thinly sliced",
        "2 green onions, chopped",
        "½ red chile, thinly sliced",
        "1 clove garlic, thinly sliced",
        "2 tablespoons soy sauce",
        "1 tablespoon sesame oil",
        "2 teaspoons sugar",
        "1 teaspoon mirin",
        "1 cup fresh spinach",
        "½ cup plus 1 tablespoons sesame oil, divided",
        "3 tablespoons salt, divided",
        "¼ cup bean sprouts",
        "½ yellow squash, julienned",
        "½ zucchini, julienned",
        "¼ cup daikon radish, julienned",
        "¼ cup water",
        "½ carrot, julienned",
        "¼ cup dried shiitake mushrooms",
        "½ cup hot water",
        "2 cloves garlic, minced, divided",
        "1 tablespoon gochugaru",
        "2 teaspoons sesame seeds, plus more for garnish",
        "1 cucumber, halved lengthwise, seeded, and sliced",
        "4 cups cooked purple rice (equal portions of white, black, and brown rice)",
        "4 fried egg",
        "2 green onions, cut into 2-inch pieces, thinly sliced",
        "1 tablespoon thinly sliced nori seaweed",
        "¼ cup kimchi, thinly sliced, for serving",
        "¼ cup gochujang, for serving"
    ],
    "recipeInstructionSteps": [
        "To marinate the meat, add the ribeye to a medium bowl with the green onion, red chili, garlic, soy sauce, sesame oil, sugar, and mirin. Mix until the meat is well-coated. Marinate in the refrigerator for at least 30 minutes.",
        "Bring a large pot of water to boil over high heat and season generously with salt. Blanch the spinach for 30 seconds, transfer to an ice bath to shock, and drain. Transfer to a small bowl and season with 1 teaspoon of sesame oil, a pinch of salt, and pepper.",
        "Blanch the bean sprouts for 1-2 minutes, then shock the ice bath. Strain and pat dry with a paper towel. Transfer to a small bowl and season with 1 teaspoon sesame oil, a pinch of salt, and pepper.",
        "In a medium skillet over medium heat, add 1 tablespoon of sesame oil, the yellow squash, and 1 teaspoon salt. Sauté for 2-3 minutes, until the squash is softened. Set the squash aside in a small bowl.",
        "In the same skillet over medium heat, add another tablespoon of sesame oil, the zucchini, and 1 teaspoon of salt. Sauté for 2-3 minutes, until the zucchini is softened. Set aside in a small bowl.",
        "Add another tablespoon of sesame oil, the daikon, and a teaspoon of salt to the same skillet and for sauté over medium heat for 30 seconds. Add ¼ cup (60 ml) of water and cook until liquid has evaporated, 4-5 minutes. Set aside in a small bowl.",
        "In the same skillet over medium heat, add another tablespoons of sesame oil, the carrots, and 1 teaspoon of salt and sauté for 2-3 minutes, until softened. Set aside in a small bowl.",
        "In a small bowl, pour the hot water over the dried mushrooms and soak for 5 minutes, or until the mushrooms have softened. Wring out excess moisture from the mushrooms and thinly slice.",
        "In the skillet over medium heat, add 1 tablespoon of sesame oil and sauté 1 minced clove of garlic for 30 seconds, or until fragrant. Add the mushrooms and sauté for 2-3 minutes more. Set aside in a small bowl.",
        "Add the remaining ¼ cup (60 ml) of sesame oil to a liquid measuring cup or small bowl. Add 2 teaspoons of salt, the remaining minced garlic clove, the gochugaru, and sesame seeds and whisk to combine.",
        "Pour a bit of the seasoned oil over the sautéed beans sprouts, sliced cucumber, and blanched spinach, tossing with your fingers to coat.",
        "Heat a large skillet over high heat, then add the ribeye and marinade and stir-fry for 2-3 minutes, until the beef is browned. Remove the pan from the heat.",
        "Assemble the bibimbap: Place the rice in the center of a shallow dish. Add the cucumber, mushrooms, zucchini, carrots, daikon, spinach, bean sprouts, and yellow squash around the sides of the rice. Scoop the beef into the center of the rice and top with the fried egg. Garnish with thinly sliced green onions and nori and a sprinkle of sesame seeds.",
        "Serve the bibimbap with kimchi and gochujang. To eat, mix everything together.",
        "Enjoy!"
    ]
}